gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_ds_DSAKeyValue_ADD_Q) */

void zxmd_ds_DSAKeyValue_ADD_Q(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Q->g;
    x->Q = z;
    return;
  case -1:
    y = x->Q;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Q; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_DSAKeyValue_DEL_Q) */

void zxmd_ds_DSAKeyValue_DEL_Q(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Q = (struct zx_elem_s*)x->Q->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->Q;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Q; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_ds_DSAKeyValue_NUM_G) */

int zxmd_ds_DSAKeyValue_NUM_G(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->G; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_DSAKeyValue_GET_G) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_GET_G(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->G; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_DSAKeyValue_POP_G) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_POP_G(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->G;
  if (y)
    x->G = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_DSAKeyValue_PUSH_G) */

void zxmd_ds_DSAKeyValue_PUSH_G(struct zxmd_ds_DSAKeyValue_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->G->g;
  x->G = z;
}

/* FUNC(zxmd_ds_DSAKeyValue_REV_G) */

void zxmd_ds_DSAKeyValue_REV_G(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->G;
  if (!y) return;
  x->G = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->G->g;
    x->G = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_PUT_G) */

void zxmd_ds_DSAKeyValue_PUT_G(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->G;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->G = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_ADD_G) */

void zxmd_ds_DSAKeyValue_ADD_G(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->G->g;
    x->G = z;
    return;
  case -1:
    y = x->G;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->G; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_DSAKeyValue_DEL_G) */

void zxmd_ds_DSAKeyValue_DEL_G(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->G = (struct zx_elem_s*)x->G->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->G;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->G; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_ds_DSAKeyValue_NUM_Y) */

int zxmd_ds_DSAKeyValue_NUM_Y(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Y; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_DSAKeyValue_GET_Y) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_GET_Y(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Y; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_DSAKeyValue_POP_Y) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_POP_Y(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Y;
  if (y)
    x->Y = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_DSAKeyValue_PUSH_Y) */

void zxmd_ds_DSAKeyValue_PUSH_Y(struct zxmd_ds_DSAKeyValue_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->Y->g;
  x->Y = z;
}

/* FUNC(zxmd_ds_DSAKeyValue_REV_Y) */

void zxmd_ds_DSAKeyValue_REV_Y(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->Y;
  if (!y) return;
  x->Y = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->Y->g;
    x->Y = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_PUT_Y) */

void zxmd_ds_DSAKeyValue_PUT_Y(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->Y;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->Y = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_ADD_Y) */

void zxmd_ds_DSAKeyValue_ADD_Y(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Y->g;
    x->Y = z;
    return;
  case -1:
    y = x->Y;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Y; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_DSAKeyValue_DEL_Y) */

void zxmd_ds_DSAKeyValue_DEL_Y(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Y = (struct zx_elem_s*)x->Y->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->Y;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Y; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



