gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_ds_DSAKeyValue_NUM_J) */

int zxmd_ds_DSAKeyValue_NUM_J(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->J; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_DSAKeyValue_GET_J) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_GET_J(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->J; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_DSAKeyValue_POP_J) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_POP_J(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->J;
  if (y)
    x->J = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_DSAKeyValue_PUSH_J) */

void zxmd_ds_DSAKeyValue_PUSH_J(struct zxmd_ds_DSAKeyValue_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->J->g;
  x->J = z;
}

/* FUNC(zxmd_ds_DSAKeyValue_REV_J) */

void zxmd_ds_DSAKeyValue_REV_J(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->J;
  if (!y) return;
  x->J = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->J->g;
    x->J = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_PUT_J) */

void zxmd_ds_DSAKeyValue_PUT_J(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->J;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->J = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_ADD_J) */

void zxmd_ds_DSAKeyValue_ADD_J(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->J->g;
    x->J = z;
    return;
  case -1:
    y = x->J;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->J; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_DSAKeyValue_DEL_J) */

void zxmd_ds_DSAKeyValue_DEL_J(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->J = (struct zx_elem_s*)x->J->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->J;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->J; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_ds_DSAKeyValue_NUM_Seed) */

int zxmd_ds_DSAKeyValue_NUM_Seed(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Seed; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_DSAKeyValue_GET_Seed) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_GET_Seed(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Seed; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_DSAKeyValue_POP_Seed) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_POP_Seed(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Seed;
  if (y)
    x->Seed = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_DSAKeyValue_PUSH_Seed) */

void zxmd_ds_DSAKeyValue_PUSH_Seed(struct zxmd_ds_DSAKeyValue_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->Seed->g;
  x->Seed = z;
}

/* FUNC(zxmd_ds_DSAKeyValue_REV_Seed) */

void zxmd_ds_DSAKeyValue_REV_Seed(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->Seed;
  if (!y) return;
  x->Seed = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->Seed->g;
    x->Seed = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_PUT_Seed) */

void zxmd_ds_DSAKeyValue_PUT_Seed(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->Seed;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->Seed = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_ADD_Seed) */

void zxmd_ds_DSAKeyValue_ADD_Seed(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Seed->g;
    x->Seed = z;
    return;
  case -1:
    y = x->Seed;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Seed; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_DSAKeyValue_DEL_Seed) */

void zxmd_ds_DSAKeyValue_DEL_Seed(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Seed = (struct zx_elem_s*)x->Seed->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->Seed;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Seed; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_ds_DSAKeyValue_NUM_PgenCounter) */

int zxmd_ds_DSAKeyValue_NUM_PgenCounter(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->PgenCounter; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_DSAKeyValue_GET_PgenCounter) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_GET_PgenCounter(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->PgenCounter; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_DSAKeyValue_POP_PgenCounter) */

struct zx_elem_s* zxmd_ds_DSAKeyValue_POP_PgenCounter(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->PgenCounter;
  if (y)
    x->PgenCounter = (struct zx_elem_s*)y->g.n;
  return y;
}

