gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_ds_DSAKeyValue_PUSH_PgenCounter) */

void zxmd_ds_DSAKeyValue_PUSH_PgenCounter(struct zxmd_ds_DSAKeyValue_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->PgenCounter->g;
  x->PgenCounter = z;
}

/* FUNC(zxmd_ds_DSAKeyValue_REV_PgenCounter) */

void zxmd_ds_DSAKeyValue_REV_PgenCounter(struct zxmd_ds_DSAKeyValue_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->PgenCounter;
  if (!y) return;
  x->PgenCounter = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->PgenCounter->g;
    x->PgenCounter = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_PUT_PgenCounter) */

void zxmd_ds_DSAKeyValue_PUT_PgenCounter(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->PgenCounter;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->PgenCounter = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_DSAKeyValue_ADD_PgenCounter) */

void zxmd_ds_DSAKeyValue_ADD_PgenCounter(struct zxmd_ds_DSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->PgenCounter->g;
    x->PgenCounter = z;
    return;
  case -1:
    y = x->PgenCounter;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->PgenCounter; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_DSAKeyValue_DEL_PgenCounter) */

void zxmd_ds_DSAKeyValue_DEL_PgenCounter(struct zxmd_ds_DSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->PgenCounter = (struct zx_elem_s*)x->PgenCounter->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->PgenCounter;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->PgenCounter; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}






/* FUNC(zxmd_ds_DigestMethod_GET_Algorithm) */
struct zx_str_s* zxmd_ds_DigestMethod_GET_Algorithm(struct zxmd_ds_DigestMethod_s* x) { return x->Algorithm; }
/* FUNC(zxmd_ds_DigestMethod_PUT_Algorithm) */
void zxmd_ds_DigestMethod_PUT_Algorithm(struct zxmd_ds_DigestMethod_s* x, struct zx_str_s* y) { x->Algorithm = y; }







/* FUNC(zxmd_ds_KeyInfo_NUM_KeyName) */

int zxmd_ds_KeyInfo_NUM_KeyName(struct zxmd_ds_KeyInfo_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KeyName; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_KeyInfo_GET_KeyName) */

struct zx_elem_s* zxmd_ds_KeyInfo_GET_KeyName(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->KeyName; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_POP_KeyName) */

struct zx_elem_s* zxmd_ds_KeyInfo_POP_KeyName(struct zxmd_ds_KeyInfo_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->KeyName;
  if (y)
    x->KeyName = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_PUSH_KeyName) */

void zxmd_ds_KeyInfo_PUSH_KeyName(struct zxmd_ds_KeyInfo_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->KeyName->g;
  x->KeyName = z;
}

/* FUNC(zxmd_ds_KeyInfo_REV_KeyName) */

void zxmd_ds_KeyInfo_REV_KeyName(struct zxmd_ds_KeyInfo_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->KeyName;
  if (!y) return;
  x->KeyName = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->KeyName->g;
    x->KeyName = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_KeyInfo_PUT_KeyName) */

void zxmd_ds_KeyInfo_PUT_KeyName(struct zxmd_ds_KeyInfo_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->KeyName;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->KeyName = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_KeyInfo_ADD_KeyName) */

void zxmd_ds_KeyInfo_ADD_KeyName(struct zxmd_ds_KeyInfo_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->KeyName->g;
    x->KeyName = z;
    return;
  case -1:
    y = x->KeyName;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->KeyName; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_KeyInfo_DEL_KeyName) */

void zxmd_ds_KeyInfo_DEL_KeyName(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyName = (struct zx_elem_s*)x->KeyName->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->KeyName;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->KeyName; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_ds_KeyInfo_NUM_KeyValue) */

int zxmd_ds_KeyInfo_NUM_KeyValue(struct zxmd_ds_KeyInfo_s* x)
{
  struct zxmd_ds_KeyValue_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KeyValue; y; ++n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_KeyInfo_GET_KeyValue) */

struct zxmd_ds_KeyValue_s* zxmd_ds_KeyInfo_GET_KeyValue(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x) return 0;
  for (y = x->KeyValue; n>=0 && y; --n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_POP_KeyValue) */

struct zxmd_ds_KeyValue_s* zxmd_ds_KeyInfo_POP_KeyValue(struct zxmd_ds_KeyInfo_s* x)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x) return 0;
  y = x->KeyValue;
  if (y)
    x->KeyValue = (struct zxmd_ds_KeyValue_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_PUSH_KeyValue) */

void zxmd_ds_KeyInfo_PUSH_KeyValue(struct zxmd_ds_KeyInfo_s* x, struct zxmd_ds_KeyValue_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->KeyValue->gg.g;
  x->KeyValue = z;
}

/* FUNC(zxmd_ds_KeyInfo_REV_KeyValue) */

void zxmd_ds_KeyInfo_REV_KeyValue(struct zxmd_ds_KeyInfo_s* x)
{
  struct zxmd_ds_KeyValue_s* nxt;
  struct zxmd_ds_KeyValue_s* y;
  if (!x) return;
  y = x->KeyValue;
  if (!y) return;
  x->KeyValue = 0;
  while (y) {
    nxt = (struct zxmd_ds_KeyValue_s*)y->gg.g.n;
    y->gg.g.n = &x->KeyValue->gg.g;
    x->KeyValue = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_KeyInfo_PUT_KeyValue) */

