gitpan/zxid/c/saml2md-getput.c
void zxmd_ds_KeyInfo_PUT_KeyValue(struct zxmd_ds_KeyInfo_s* x, int n, struct zxmd_ds_KeyValue_s* z)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x || !z) return;
  y = x->KeyValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->KeyValue = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_KeyInfo_ADD_KeyValue) */

void zxmd_ds_KeyInfo_ADD_KeyValue(struct zxmd_ds_KeyInfo_s* x, int n, struct zxmd_ds_KeyValue_s* z)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->KeyValue->gg.g;
    x->KeyValue = z;
    return;
  case -1:
    y = x->KeyValue;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyValue; n > 1 && y; --n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_KeyInfo_DEL_KeyValue) */

void zxmd_ds_KeyInfo_DEL_KeyValue(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyValue = (struct zxmd_ds_KeyValue_s*)x->KeyValue->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_KeyValue_s*)x->KeyValue;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyValue; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_KeyInfo_NUM_RetrievalMethod) */

int zxmd_ds_KeyInfo_NUM_RetrievalMethod(struct zxmd_ds_KeyInfo_s* x)
{
  struct zxmd_ds_RetrievalMethod_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->RetrievalMethod; y; ++n, y = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_KeyInfo_GET_RetrievalMethod) */

struct zxmd_ds_RetrievalMethod_s* zxmd_ds_KeyInfo_GET_RetrievalMethod(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zxmd_ds_RetrievalMethod_s* y;
  if (!x) return 0;
  for (y = x->RetrievalMethod; n>=0 && y; --n, y = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_POP_RetrievalMethod) */

struct zxmd_ds_RetrievalMethod_s* zxmd_ds_KeyInfo_POP_RetrievalMethod(struct zxmd_ds_KeyInfo_s* x)
{
  struct zxmd_ds_RetrievalMethod_s* y;
  if (!x) return 0;
  y = x->RetrievalMethod;
  if (y)
    x->RetrievalMethod = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_PUSH_RetrievalMethod) */

void zxmd_ds_KeyInfo_PUSH_RetrievalMethod(struct zxmd_ds_KeyInfo_s* x, struct zxmd_ds_RetrievalMethod_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->RetrievalMethod->gg.g;
  x->RetrievalMethod = z;
}

/* FUNC(zxmd_ds_KeyInfo_REV_RetrievalMethod) */

void zxmd_ds_KeyInfo_REV_RetrievalMethod(struct zxmd_ds_KeyInfo_s* x)
{
  struct zxmd_ds_RetrievalMethod_s* nxt;
  struct zxmd_ds_RetrievalMethod_s* y;
  if (!x) return;
  y = x->RetrievalMethod;
  if (!y) return;
  x->RetrievalMethod = 0;
  while (y) {
    nxt = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n;
    y->gg.g.n = &x->RetrievalMethod->gg.g;
    x->RetrievalMethod = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_KeyInfo_PUT_RetrievalMethod) */

void zxmd_ds_KeyInfo_PUT_RetrievalMethod(struct zxmd_ds_KeyInfo_s* x, int n, struct zxmd_ds_RetrievalMethod_s* z)
{
  struct zxmd_ds_RetrievalMethod_s* y;
  if (!x || !z) return;
  y = x->RetrievalMethod;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->RetrievalMethod = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_KeyInfo_ADD_RetrievalMethod) */

void zxmd_ds_KeyInfo_ADD_RetrievalMethod(struct zxmd_ds_KeyInfo_s* x, int n, struct zxmd_ds_RetrievalMethod_s* z)
{
  struct zxmd_ds_RetrievalMethod_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->RetrievalMethod->gg.g;
    x->RetrievalMethod = z;
    return;
  case -1:
    y = x->RetrievalMethod;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->RetrievalMethod; n > 1 && y; --n, y = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_KeyInfo_DEL_RetrievalMethod) */

void zxmd_ds_KeyInfo_DEL_RetrievalMethod(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zxmd_ds_RetrievalMethod_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->RetrievalMethod = (struct zxmd_ds_RetrievalMethod_s*)x->RetrievalMethod->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_RetrievalMethod_s*)x->RetrievalMethod;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->RetrievalMethod; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_KeyInfo_NUM_X509Data) */

int zxmd_ds_KeyInfo_NUM_X509Data(struct zxmd_ds_KeyInfo_s* x)
{
  struct zxmd_ds_X509Data_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->X509Data; y; ++n, y = (struct zxmd_ds_X509Data_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_KeyInfo_GET_X509Data) */

struct zxmd_ds_X509Data_s* zxmd_ds_KeyInfo_GET_X509Data(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zxmd_ds_X509Data_s* y;
  if (!x) return 0;
  for (y = x->X509Data; n>=0 && y; --n, y = (struct zxmd_ds_X509Data_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_POP_X509Data) */

struct zxmd_ds_X509Data_s* zxmd_ds_KeyInfo_POP_X509Data(struct zxmd_ds_KeyInfo_s* x)
{
  struct zxmd_ds_X509Data_s* y;
  if (!x) return 0;
  y = x->X509Data;
  if (y)
    x->X509Data = (struct zxmd_ds_X509Data_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_PUSH_X509Data) */

void zxmd_ds_KeyInfo_PUSH_X509Data(struct zxmd_ds_KeyInfo_s* x, struct zxmd_ds_X509Data_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->X509Data->gg.g;
  x->X509Data = z;
}

/* FUNC(zxmd_ds_KeyInfo_REV_X509Data) */

void zxmd_ds_KeyInfo_REV_X509Data(struct zxmd_ds_KeyInfo_s* x)
{
  struct zxmd_ds_X509Data_s* nxt;
  struct zxmd_ds_X509Data_s* y;
  if (!x) return;
  y = x->X509Data;
  if (!y) return;
  x->X509Data = 0;
  while (y) {
    nxt = (struct zxmd_ds_X509Data_s*)y->gg.g.n;
    y->gg.g.n = &x->X509Data->gg.g;
    x->X509Data = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_KeyInfo_PUT_X509Data) */

