gitpan/zxid/c/saml2md-getput.c
void zxmd_ds_KeyInfo_PUT_SPKIData(struct zxmd_ds_KeyInfo_s* x, int n, struct zxmd_ds_SPKIData_s* z)
{
  struct zxmd_ds_SPKIData_s* y;
  if (!x || !z) return;
  y = x->SPKIData;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SPKIData = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_KeyInfo_ADD_SPKIData) */

void zxmd_ds_KeyInfo_ADD_SPKIData(struct zxmd_ds_KeyInfo_s* x, int n, struct zxmd_ds_SPKIData_s* z)
{
  struct zxmd_ds_SPKIData_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SPKIData->gg.g;
    x->SPKIData = z;
    return;
  case -1:
    y = x->SPKIData;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SPKIData; n > 1 && y; --n, y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_KeyInfo_DEL_SPKIData) */

void zxmd_ds_KeyInfo_DEL_SPKIData(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zxmd_ds_SPKIData_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SPKIData = (struct zxmd_ds_SPKIData_s*)x->SPKIData->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_SPKIData_s*)x->SPKIData;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SPKIData; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_KeyInfo_NUM_MgmtData) */

int zxmd_ds_KeyInfo_NUM_MgmtData(struct zxmd_ds_KeyInfo_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->MgmtData; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_KeyInfo_GET_MgmtData) */

struct zx_elem_s* zxmd_ds_KeyInfo_GET_MgmtData(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->MgmtData; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_POP_MgmtData) */

struct zx_elem_s* zxmd_ds_KeyInfo_POP_MgmtData(struct zxmd_ds_KeyInfo_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->MgmtData;
  if (y)
    x->MgmtData = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_KeyInfo_PUSH_MgmtData) */

void zxmd_ds_KeyInfo_PUSH_MgmtData(struct zxmd_ds_KeyInfo_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->MgmtData->g;
  x->MgmtData = z;
}

/* FUNC(zxmd_ds_KeyInfo_REV_MgmtData) */

void zxmd_ds_KeyInfo_REV_MgmtData(struct zxmd_ds_KeyInfo_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->MgmtData;
  if (!y) return;
  x->MgmtData = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->MgmtData->g;
    x->MgmtData = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_KeyInfo_PUT_MgmtData) */

void zxmd_ds_KeyInfo_PUT_MgmtData(struct zxmd_ds_KeyInfo_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->MgmtData;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->MgmtData = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_KeyInfo_ADD_MgmtData) */

void zxmd_ds_KeyInfo_ADD_MgmtData(struct zxmd_ds_KeyInfo_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->MgmtData->g;
    x->MgmtData = z;
    return;
  case -1:
    y = x->MgmtData;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->MgmtData; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_KeyInfo_DEL_MgmtData) */

void zxmd_ds_KeyInfo_DEL_MgmtData(struct zxmd_ds_KeyInfo_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->MgmtData = (struct zx_elem_s*)x->MgmtData->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->MgmtData;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->MgmtData; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}

/* FUNC(zxmd_ds_KeyInfo_GET_Id) */
struct zx_str_s* zxmd_ds_KeyInfo_GET_Id(struct zxmd_ds_KeyInfo_s* x) { return x->Id; }
/* FUNC(zxmd_ds_KeyInfo_PUT_Id) */
void zxmd_ds_KeyInfo_PUT_Id(struct zxmd_ds_KeyInfo_s* x, struct zx_str_s* y) { x->Id = y; }







/* FUNC(zxmd_ds_KeyValue_NUM_DSAKeyValue) */

int zxmd_ds_KeyValue_NUM_DSAKeyValue(struct zxmd_ds_KeyValue_s* x)
{
  struct zxmd_ds_DSAKeyValue_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->DSAKeyValue; y; ++n, y = (struct zxmd_ds_DSAKeyValue_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_KeyValue_GET_DSAKeyValue) */

struct zxmd_ds_DSAKeyValue_s* zxmd_ds_KeyValue_GET_DSAKeyValue(struct zxmd_ds_KeyValue_s* x, int n)
{
  struct zxmd_ds_DSAKeyValue_s* y;
  if (!x) return 0;
  for (y = x->DSAKeyValue; n>=0 && y; --n, y = (struct zxmd_ds_DSAKeyValue_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_KeyValue_POP_DSAKeyValue) */

struct zxmd_ds_DSAKeyValue_s* zxmd_ds_KeyValue_POP_DSAKeyValue(struct zxmd_ds_KeyValue_s* x)
{
  struct zxmd_ds_DSAKeyValue_s* y;
  if (!x) return 0;
  y = x->DSAKeyValue;
  if (y)
    x->DSAKeyValue = (struct zxmd_ds_DSAKeyValue_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_KeyValue_PUSH_DSAKeyValue) */

void zxmd_ds_KeyValue_PUSH_DSAKeyValue(struct zxmd_ds_KeyValue_s* x, struct zxmd_ds_DSAKeyValue_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->DSAKeyValue->gg.g;
  x->DSAKeyValue = z;
}

/* FUNC(zxmd_ds_KeyValue_REV_DSAKeyValue) */

void zxmd_ds_KeyValue_REV_DSAKeyValue(struct zxmd_ds_KeyValue_s* x)
{
  struct zxmd_ds_DSAKeyValue_s* nxt;
  struct zxmd_ds_DSAKeyValue_s* y;
  if (!x) return;
  y = x->DSAKeyValue;
  if (!y) return;
  x->DSAKeyValue = 0;
  while (y) {
    nxt = (struct zxmd_ds_DSAKeyValue_s*)y->gg.g.n;
    y->gg.g.n = &x->DSAKeyValue->gg.g;
    x->DSAKeyValue = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_KeyValue_PUT_DSAKeyValue) */

void zxmd_ds_KeyValue_PUT_DSAKeyValue(struct zxmd_ds_KeyValue_s* x, int n, struct zxmd_ds_DSAKeyValue_s* z)
{
  struct zxmd_ds_DSAKeyValue_s* y;
  if (!x || !z) return;
  y = x->DSAKeyValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->DSAKeyValue = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_DSAKeyValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_KeyValue_ADD_DSAKeyValue) */

void zxmd_ds_KeyValue_ADD_DSAKeyValue(struct zxmd_ds_KeyValue_s* x, int n, struct zxmd_ds_DSAKeyValue_s* z)
{
  struct zxmd_ds_DSAKeyValue_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->DSAKeyValue->gg.g;
    x->DSAKeyValue = z;
    return;
  case -1:
    y = x->DSAKeyValue;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_DSAKeyValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->DSAKeyValue; n > 1 && y; --n, y = (struct zxmd_ds_DSAKeyValue_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_KeyValue_DEL_DSAKeyValue) */

void zxmd_ds_KeyValue_DEL_DSAKeyValue(struct zxmd_ds_KeyValue_s* x, int n)
{
  struct zxmd_ds_DSAKeyValue_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->DSAKeyValue = (struct zxmd_ds_DSAKeyValue_s*)x->DSAKeyValue->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_DSAKeyValue_s*)x->DSAKeyValue;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_DSAKeyValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->DSAKeyValue; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_DSAKeyValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



