gitpan/zxid/c/saml2md-getput.c
void zxmd_ds_Reference_DEL_Transforms(struct zxmd_ds_Reference_s* x, int n)
{
  struct zxmd_ds_Transforms_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Transforms = (struct zxmd_ds_Transforms_s*)x->Transforms->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_Transforms_s*)x->Transforms;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_Transforms_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Transforms; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Transforms_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_Reference_NUM_DigestMethod) */

int zxmd_ds_Reference_NUM_DigestMethod(struct zxmd_ds_Reference_s* x)
{
  struct zxmd_ds_DigestMethod_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->DigestMethod; y; ++n, y = (struct zxmd_ds_DigestMethod_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_Reference_GET_DigestMethod) */

struct zxmd_ds_DigestMethod_s* zxmd_ds_Reference_GET_DigestMethod(struct zxmd_ds_Reference_s* x, int n)
{
  struct zxmd_ds_DigestMethod_s* y;
  if (!x) return 0;
  for (y = x->DigestMethod; n>=0 && y; --n, y = (struct zxmd_ds_DigestMethod_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_Reference_POP_DigestMethod) */

struct zxmd_ds_DigestMethod_s* zxmd_ds_Reference_POP_DigestMethod(struct zxmd_ds_Reference_s* x)
{
  struct zxmd_ds_DigestMethod_s* y;
  if (!x) return 0;
  y = x->DigestMethod;
  if (y)
    x->DigestMethod = (struct zxmd_ds_DigestMethod_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_Reference_PUSH_DigestMethod) */

void zxmd_ds_Reference_PUSH_DigestMethod(struct zxmd_ds_Reference_s* x, struct zxmd_ds_DigestMethod_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->DigestMethod->gg.g;
  x->DigestMethod = z;
}

/* FUNC(zxmd_ds_Reference_REV_DigestMethod) */

void zxmd_ds_Reference_REV_DigestMethod(struct zxmd_ds_Reference_s* x)
{
  struct zxmd_ds_DigestMethod_s* nxt;
  struct zxmd_ds_DigestMethod_s* y;
  if (!x) return;
  y = x->DigestMethod;
  if (!y) return;
  x->DigestMethod = 0;
  while (y) {
    nxt = (struct zxmd_ds_DigestMethod_s*)y->gg.g.n;
    y->gg.g.n = &x->DigestMethod->gg.g;
    x->DigestMethod = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_Reference_PUT_DigestMethod) */

void zxmd_ds_Reference_PUT_DigestMethod(struct zxmd_ds_Reference_s* x, int n, struct zxmd_ds_DigestMethod_s* z)
{
  struct zxmd_ds_DigestMethod_s* y;
  if (!x || !z) return;
  y = x->DigestMethod;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->DigestMethod = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_DigestMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_Reference_ADD_DigestMethod) */

void zxmd_ds_Reference_ADD_DigestMethod(struct zxmd_ds_Reference_s* x, int n, struct zxmd_ds_DigestMethod_s* z)
{
  struct zxmd_ds_DigestMethod_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->DigestMethod->gg.g;
    x->DigestMethod = z;
    return;
  case -1:
    y = x->DigestMethod;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_DigestMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->DigestMethod; n > 1 && y; --n, y = (struct zxmd_ds_DigestMethod_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_Reference_DEL_DigestMethod) */

void zxmd_ds_Reference_DEL_DigestMethod(struct zxmd_ds_Reference_s* x, int n)
{
  struct zxmd_ds_DigestMethod_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->DigestMethod = (struct zxmd_ds_DigestMethod_s*)x->DigestMethod->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_DigestMethod_s*)x->DigestMethod;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_DigestMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->DigestMethod; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_DigestMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_Reference_NUM_DigestValue) */

int zxmd_ds_Reference_NUM_DigestValue(struct zxmd_ds_Reference_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->DigestValue; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_Reference_GET_DigestValue) */

struct zx_elem_s* zxmd_ds_Reference_GET_DigestValue(struct zxmd_ds_Reference_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->DigestValue; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_Reference_POP_DigestValue) */

struct zx_elem_s* zxmd_ds_Reference_POP_DigestValue(struct zxmd_ds_Reference_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->DigestValue;
  if (y)
    x->DigestValue = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_Reference_PUSH_DigestValue) */

void zxmd_ds_Reference_PUSH_DigestValue(struct zxmd_ds_Reference_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->DigestValue->g;
  x->DigestValue = z;
}

/* FUNC(zxmd_ds_Reference_REV_DigestValue) */

void zxmd_ds_Reference_REV_DigestValue(struct zxmd_ds_Reference_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->DigestValue;
  if (!y) return;
  x->DigestValue = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->DigestValue->g;
    x->DigestValue = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_Reference_PUT_DigestValue) */

void zxmd_ds_Reference_PUT_DigestValue(struct zxmd_ds_Reference_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->DigestValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->DigestValue = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_Reference_ADD_DigestValue) */

void zxmd_ds_Reference_ADD_DigestValue(struct zxmd_ds_Reference_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->DigestValue->g;
    x->DigestValue = z;
    return;
  case -1:
    y = x->DigestValue;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->DigestValue; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_Reference_DEL_DigestValue) */

void zxmd_ds_Reference_DEL_DigestValue(struct zxmd_ds_Reference_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->DigestValue = (struct zx_elem_s*)x->DigestValue->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->DigestValue;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->DigestValue; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}

/* FUNC(zxmd_ds_Reference_GET_Id) */
struct zx_str_s* zxmd_ds_Reference_GET_Id(struct zxmd_ds_Reference_s* x) { return x->Id; }
/* FUNC(zxmd_ds_Reference_PUT_Id) */
void zxmd_ds_Reference_PUT_Id(struct zxmd_ds_Reference_s* x, struct zx_str_s* y) { x->Id = y; }
/* FUNC(zxmd_ds_Reference_GET_URI) */
struct zx_str_s* zxmd_ds_Reference_GET_URI(struct zxmd_ds_Reference_s* x) { return x->URI; }
/* FUNC(zxmd_ds_Reference_PUT_URI) */
void zxmd_ds_Reference_PUT_URI(struct zxmd_ds_Reference_s* x, struct zx_str_s* y) { x->URI = y; }
/* FUNC(zxmd_ds_Reference_GET_Type) */
struct zx_str_s* zxmd_ds_Reference_GET_Type(struct zxmd_ds_Reference_s* x) { return x->Type; }
/* FUNC(zxmd_ds_Reference_PUT_Type) */
void zxmd_ds_Reference_PUT_Type(struct zxmd_ds_Reference_s* x, struct zx_str_s* y) { x->Type = y; }







/* FUNC(zxmd_ds_RetrievalMethod_NUM_Transforms) */

int zxmd_ds_RetrievalMethod_NUM_Transforms(struct zxmd_ds_RetrievalMethod_s* x)
{
  struct zxmd_ds_Transforms_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Transforms; y; ++n, y = (struct zxmd_ds_Transforms_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_RetrievalMethod_GET_Transforms) */

struct zxmd_ds_Transforms_s* zxmd_ds_RetrievalMethod_GET_Transforms(struct zxmd_ds_RetrievalMethod_s* x, int n)
{
  struct zxmd_ds_Transforms_s* y;
  if (!x) return 0;
  for (y = x->Transforms; n>=0 && y; --n, y = (struct zxmd_ds_Transforms_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_RetrievalMethod_POP_Transforms) */

struct zxmd_ds_Transforms_s* zxmd_ds_RetrievalMethod_POP_Transforms(struct zxmd_ds_RetrievalMethod_s* x)
{
  struct zxmd_ds_Transforms_s* y;
  if (!x) return 0;
  y = x->Transforms;
  if (y)
    x->Transforms = (struct zxmd_ds_Transforms_s*)y->gg.g.n;
  return y;
}

