gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_ds_RetrievalMethod_PUSH_Transforms) */

void zxmd_ds_RetrievalMethod_PUSH_Transforms(struct zxmd_ds_RetrievalMethod_s* x, struct zxmd_ds_Transforms_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Transforms->gg.g;
  x->Transforms = z;
}

/* FUNC(zxmd_ds_RetrievalMethod_REV_Transforms) */

void zxmd_ds_RetrievalMethod_REV_Transforms(struct zxmd_ds_RetrievalMethod_s* x)
{
  struct zxmd_ds_Transforms_s* nxt;
  struct zxmd_ds_Transforms_s* y;
  if (!x) return;
  y = x->Transforms;
  if (!y) return;
  x->Transforms = 0;
  while (y) {
    nxt = (struct zxmd_ds_Transforms_s*)y->gg.g.n;
    y->gg.g.n = &x->Transforms->gg.g;
    x->Transforms = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_RetrievalMethod_PUT_Transforms) */

void zxmd_ds_RetrievalMethod_PUT_Transforms(struct zxmd_ds_RetrievalMethod_s* x, int n, struct zxmd_ds_Transforms_s* z)
{
  struct zxmd_ds_Transforms_s* y;
  if (!x || !z) return;
  y = x->Transforms;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Transforms = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Transforms_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_RetrievalMethod_ADD_Transforms) */

void zxmd_ds_RetrievalMethod_ADD_Transforms(struct zxmd_ds_RetrievalMethod_s* x, int n, struct zxmd_ds_Transforms_s* z)
{
  struct zxmd_ds_Transforms_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Transforms->gg.g;
    x->Transforms = z;
    return;
  case -1:
    y = x->Transforms;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_Transforms_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Transforms; n > 1 && y; --n, y = (struct zxmd_ds_Transforms_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_RetrievalMethod_DEL_Transforms) */

void zxmd_ds_RetrievalMethod_DEL_Transforms(struct zxmd_ds_RetrievalMethod_s* x, int n)
{
  struct zxmd_ds_Transforms_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Transforms = (struct zxmd_ds_Transforms_s*)x->Transforms->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_Transforms_s*)x->Transforms;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_Transforms_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Transforms; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Transforms_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_ds_RetrievalMethod_GET_URI) */
struct zx_str_s* zxmd_ds_RetrievalMethod_GET_URI(struct zxmd_ds_RetrievalMethod_s* x) { return x->URI; }
/* FUNC(zxmd_ds_RetrievalMethod_PUT_URI) */
void zxmd_ds_RetrievalMethod_PUT_URI(struct zxmd_ds_RetrievalMethod_s* x, struct zx_str_s* y) { x->URI = y; }
/* FUNC(zxmd_ds_RetrievalMethod_GET_Type) */
struct zx_str_s* zxmd_ds_RetrievalMethod_GET_Type(struct zxmd_ds_RetrievalMethod_s* x) { return x->Type; }
/* FUNC(zxmd_ds_RetrievalMethod_PUT_Type) */
void zxmd_ds_RetrievalMethod_PUT_Type(struct zxmd_ds_RetrievalMethod_s* x, struct zx_str_s* y) { x->Type = y; }







/* FUNC(zxmd_ds_SPKIData_NUM_SPKISexp) */

int zxmd_ds_SPKIData_NUM_SPKISexp(struct zxmd_ds_SPKIData_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SPKISexp; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_SPKIData_GET_SPKISexp) */

struct zx_elem_s* zxmd_ds_SPKIData_GET_SPKISexp(struct zxmd_ds_SPKIData_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->SPKISexp; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_SPKIData_POP_SPKISexp) */

struct zx_elem_s* zxmd_ds_SPKIData_POP_SPKISexp(struct zxmd_ds_SPKIData_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->SPKISexp;
  if (y)
    x->SPKISexp = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_SPKIData_PUSH_SPKISexp) */

void zxmd_ds_SPKIData_PUSH_SPKISexp(struct zxmd_ds_SPKIData_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->SPKISexp->g;
  x->SPKISexp = z;
}

/* FUNC(zxmd_ds_SPKIData_REV_SPKISexp) */

void zxmd_ds_SPKIData_REV_SPKISexp(struct zxmd_ds_SPKIData_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->SPKISexp;
  if (!y) return;
  x->SPKISexp = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->SPKISexp->g;
    x->SPKISexp = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_SPKIData_PUT_SPKISexp) */

void zxmd_ds_SPKIData_PUT_SPKISexp(struct zxmd_ds_SPKIData_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->SPKISexp;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->SPKISexp = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_SPKIData_ADD_SPKISexp) */

void zxmd_ds_SPKIData_ADD_SPKISexp(struct zxmd_ds_SPKIData_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->SPKISexp->g;
    x->SPKISexp = z;
    return;
  case -1:
    y = x->SPKISexp;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->SPKISexp; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_SPKIData_DEL_SPKISexp) */

void zxmd_ds_SPKIData_DEL_SPKISexp(struct zxmd_ds_SPKIData_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SPKISexp = (struct zx_elem_s*)x->SPKISexp->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->SPKISexp;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->SPKISexp; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}








/* FUNC(zxmd_ds_Signature_NUM_SignedInfo) */

int zxmd_ds_Signature_NUM_SignedInfo(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_SignedInfo_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SignedInfo; y; ++n, y = (struct zxmd_ds_SignedInfo_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_Signature_GET_SignedInfo) */

struct zxmd_ds_SignedInfo_s* zxmd_ds_Signature_GET_SignedInfo(struct zxmd_ds_Signature_s* x, int n)
{
  struct zxmd_ds_SignedInfo_s* y;
  if (!x) return 0;
  for (y = x->SignedInfo; n>=0 && y; --n, y = (struct zxmd_ds_SignedInfo_s*)y->gg.g.n) ;
  return y;
}

