gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_ds_Signature_POP_SignedInfo) */

struct zxmd_ds_SignedInfo_s* zxmd_ds_Signature_POP_SignedInfo(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_SignedInfo_s* y;
  if (!x) return 0;
  y = x->SignedInfo;
  if (y)
    x->SignedInfo = (struct zxmd_ds_SignedInfo_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_Signature_PUSH_SignedInfo) */

void zxmd_ds_Signature_PUSH_SignedInfo(struct zxmd_ds_Signature_s* x, struct zxmd_ds_SignedInfo_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SignedInfo->gg.g;
  x->SignedInfo = z;
}

/* FUNC(zxmd_ds_Signature_REV_SignedInfo) */

void zxmd_ds_Signature_REV_SignedInfo(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_SignedInfo_s* nxt;
  struct zxmd_ds_SignedInfo_s* y;
  if (!x) return;
  y = x->SignedInfo;
  if (!y) return;
  x->SignedInfo = 0;
  while (y) {
    nxt = (struct zxmd_ds_SignedInfo_s*)y->gg.g.n;
    y->gg.g.n = &x->SignedInfo->gg.g;
    x->SignedInfo = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_Signature_PUT_SignedInfo) */

void zxmd_ds_Signature_PUT_SignedInfo(struct zxmd_ds_Signature_s* x, int n, struct zxmd_ds_SignedInfo_s* z)
{
  struct zxmd_ds_SignedInfo_s* y;
  if (!x || !z) return;
  y = x->SignedInfo;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SignedInfo = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SignedInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_Signature_ADD_SignedInfo) */

void zxmd_ds_Signature_ADD_SignedInfo(struct zxmd_ds_Signature_s* x, int n, struct zxmd_ds_SignedInfo_s* z)
{
  struct zxmd_ds_SignedInfo_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SignedInfo->gg.g;
    x->SignedInfo = z;
    return;
  case -1:
    y = x->SignedInfo;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_SignedInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SignedInfo; n > 1 && y; --n, y = (struct zxmd_ds_SignedInfo_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_Signature_DEL_SignedInfo) */

void zxmd_ds_Signature_DEL_SignedInfo(struct zxmd_ds_Signature_s* x, int n)
{
  struct zxmd_ds_SignedInfo_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SignedInfo = (struct zxmd_ds_SignedInfo_s*)x->SignedInfo->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_SignedInfo_s*)x->SignedInfo;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_SignedInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SignedInfo; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SignedInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_Signature_NUM_SignatureValue) */

int zxmd_ds_Signature_NUM_SignatureValue(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_SignatureValue_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SignatureValue; y; ++n, y = (struct zxmd_ds_SignatureValue_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_Signature_GET_SignatureValue) */

struct zxmd_ds_SignatureValue_s* zxmd_ds_Signature_GET_SignatureValue(struct zxmd_ds_Signature_s* x, int n)
{
  struct zxmd_ds_SignatureValue_s* y;
  if (!x) return 0;
  for (y = x->SignatureValue; n>=0 && y; --n, y = (struct zxmd_ds_SignatureValue_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_Signature_POP_SignatureValue) */

struct zxmd_ds_SignatureValue_s* zxmd_ds_Signature_POP_SignatureValue(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_SignatureValue_s* y;
  if (!x) return 0;
  y = x->SignatureValue;
  if (y)
    x->SignatureValue = (struct zxmd_ds_SignatureValue_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_Signature_PUSH_SignatureValue) */

void zxmd_ds_Signature_PUSH_SignatureValue(struct zxmd_ds_Signature_s* x, struct zxmd_ds_SignatureValue_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SignatureValue->gg.g;
  x->SignatureValue = z;
}

/* FUNC(zxmd_ds_Signature_REV_SignatureValue) */

void zxmd_ds_Signature_REV_SignatureValue(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_SignatureValue_s* nxt;
  struct zxmd_ds_SignatureValue_s* y;
  if (!x) return;
  y = x->SignatureValue;
  if (!y) return;
  x->SignatureValue = 0;
  while (y) {
    nxt = (struct zxmd_ds_SignatureValue_s*)y->gg.g.n;
    y->gg.g.n = &x->SignatureValue->gg.g;
    x->SignatureValue = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_Signature_PUT_SignatureValue) */

void zxmd_ds_Signature_PUT_SignatureValue(struct zxmd_ds_Signature_s* x, int n, struct zxmd_ds_SignatureValue_s* z)
{
  struct zxmd_ds_SignatureValue_s* y;
  if (!x || !z) return;
  y = x->SignatureValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SignatureValue = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SignatureValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_Signature_ADD_SignatureValue) */

void zxmd_ds_Signature_ADD_SignatureValue(struct zxmd_ds_Signature_s* x, int n, struct zxmd_ds_SignatureValue_s* z)
{
  struct zxmd_ds_SignatureValue_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SignatureValue->gg.g;
    x->SignatureValue = z;
    return;
  case -1:
    y = x->SignatureValue;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_SignatureValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SignatureValue; n > 1 && y; --n, y = (struct zxmd_ds_SignatureValue_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_Signature_DEL_SignatureValue) */

void zxmd_ds_Signature_DEL_SignatureValue(struct zxmd_ds_Signature_s* x, int n)
{
  struct zxmd_ds_SignatureValue_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SignatureValue = (struct zxmd_ds_SignatureValue_s*)x->SignatureValue->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_SignatureValue_s*)x->SignatureValue;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_SignatureValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SignatureValue; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SignatureValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_Signature_NUM_KeyInfo) */

int zxmd_ds_Signature_NUM_KeyInfo(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_KeyInfo_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KeyInfo; y; ++n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_Signature_GET_KeyInfo) */

