gitpan/zxid/c/saml2md-getput.c
struct zxmd_ds_KeyInfo_s* zxmd_ds_Signature_GET_KeyInfo(struct zxmd_ds_Signature_s* x, int n)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return 0;
  for (y = x->KeyInfo; n>=0 && y; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_Signature_POP_KeyInfo) */

struct zxmd_ds_KeyInfo_s* zxmd_ds_Signature_POP_KeyInfo(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return 0;
  y = x->KeyInfo;
  if (y)
    x->KeyInfo = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_Signature_PUSH_KeyInfo) */

void zxmd_ds_Signature_PUSH_KeyInfo(struct zxmd_ds_Signature_s* x, struct zxmd_ds_KeyInfo_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->KeyInfo->gg.g;
  x->KeyInfo = z;
}

/* FUNC(zxmd_ds_Signature_REV_KeyInfo) */

void zxmd_ds_Signature_REV_KeyInfo(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_KeyInfo_s* nxt;
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return;
  y = x->KeyInfo;
  if (!y) return;
  x->KeyInfo = 0;
  while (y) {
    nxt = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n;
    y->gg.g.n = &x->KeyInfo->gg.g;
    x->KeyInfo = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_Signature_PUT_KeyInfo) */

void zxmd_ds_Signature_PUT_KeyInfo(struct zxmd_ds_Signature_s* x, int n, struct zxmd_ds_KeyInfo_s* z)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x || !z) return;
  y = x->KeyInfo;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->KeyInfo = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_Signature_ADD_KeyInfo) */

void zxmd_ds_Signature_ADD_KeyInfo(struct zxmd_ds_Signature_s* x, int n, struct zxmd_ds_KeyInfo_s* z)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->KeyInfo->gg.g;
    x->KeyInfo = z;
    return;
  case -1:
    y = x->KeyInfo;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyInfo; n > 1 && y; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_Signature_DEL_KeyInfo) */

void zxmd_ds_Signature_DEL_KeyInfo(struct zxmd_ds_Signature_s* x, int n)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyInfo = (struct zxmd_ds_KeyInfo_s*)x->KeyInfo->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_KeyInfo_s*)x->KeyInfo;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyInfo; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_Signature_NUM_Object) */

int zxmd_ds_Signature_NUM_Object(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_Object_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Object; y; ++n, y = (struct zxmd_ds_Object_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_Signature_GET_Object) */

struct zxmd_ds_Object_s* zxmd_ds_Signature_GET_Object(struct zxmd_ds_Signature_s* x, int n)
{
  struct zxmd_ds_Object_s* y;
  if (!x) return 0;
  for (y = x->Object; n>=0 && y; --n, y = (struct zxmd_ds_Object_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_Signature_POP_Object) */

struct zxmd_ds_Object_s* zxmd_ds_Signature_POP_Object(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_Object_s* y;
  if (!x) return 0;
  y = x->Object;
  if (y)
    x->Object = (struct zxmd_ds_Object_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_Signature_PUSH_Object) */

void zxmd_ds_Signature_PUSH_Object(struct zxmd_ds_Signature_s* x, struct zxmd_ds_Object_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Object->gg.g;
  x->Object = z;
}

/* FUNC(zxmd_ds_Signature_REV_Object) */

void zxmd_ds_Signature_REV_Object(struct zxmd_ds_Signature_s* x)
{
  struct zxmd_ds_Object_s* nxt;
  struct zxmd_ds_Object_s* y;
  if (!x) return;
  y = x->Object;
  if (!y) return;
  x->Object = 0;
  while (y) {
    nxt = (struct zxmd_ds_Object_s*)y->gg.g.n;
    y->gg.g.n = &x->Object->gg.g;
    x->Object = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_Signature_PUT_Object) */

void zxmd_ds_Signature_PUT_Object(struct zxmd_ds_Signature_s* x, int n, struct zxmd_ds_Object_s* z)
{
  struct zxmd_ds_Object_s* y;
  if (!x || !z) return;
  y = x->Object;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Object = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Object_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_Signature_ADD_Object) */

void zxmd_ds_Signature_ADD_Object(struct zxmd_ds_Signature_s* x, int n, struct zxmd_ds_Object_s* z)
{
  struct zxmd_ds_Object_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Object->gg.g;
    x->Object = z;
    return;
  case -1:
    y = x->Object;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_Object_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Object; n > 1 && y; --n, y = (struct zxmd_ds_Object_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_Signature_DEL_Object) */

void zxmd_ds_Signature_DEL_Object(struct zxmd_ds_Signature_s* x, int n)
{
  struct zxmd_ds_Object_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Object = (struct zxmd_ds_Object_s*)x->Object->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_Object_s*)x->Object;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_Object_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Object; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Object_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_ds_Signature_GET_Id) */
struct zx_str_s* zxmd_ds_Signature_GET_Id(struct zxmd_ds_Signature_s* x) { return x->Id; }
/* FUNC(zxmd_ds_Signature_PUT_Id) */
void zxmd_ds_Signature_PUT_Id(struct zxmd_ds_Signature_s* x, struct zx_str_s* y) { x->Id = y; }







/* FUNC(zxmd_ds_SignatureMethod_NUM_HMACOutputLength) */

int zxmd_ds_SignatureMethod_NUM_HMACOutputLength(struct zxmd_ds_SignatureMethod_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->HMACOutputLength; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_SignatureMethod_GET_HMACOutputLength) */

struct zx_elem_s* zxmd_ds_SignatureMethod_GET_HMACOutputLength(struct zxmd_ds_SignatureMethod_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->HMACOutputLength; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_SignatureMethod_POP_HMACOutputLength) */

