gitpan/zxid/c/saml2md-getput.c
struct zx_elem_s* zxmd_ds_SignatureMethod_POP_HMACOutputLength(struct zxmd_ds_SignatureMethod_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->HMACOutputLength;
  if (y)
    x->HMACOutputLength = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_SignatureMethod_PUSH_HMACOutputLength) */

void zxmd_ds_SignatureMethod_PUSH_HMACOutputLength(struct zxmd_ds_SignatureMethod_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->HMACOutputLength->g;
  x->HMACOutputLength = z;
}

/* FUNC(zxmd_ds_SignatureMethod_REV_HMACOutputLength) */

void zxmd_ds_SignatureMethod_REV_HMACOutputLength(struct zxmd_ds_SignatureMethod_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->HMACOutputLength;
  if (!y) return;
  x->HMACOutputLength = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->HMACOutputLength->g;
    x->HMACOutputLength = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_SignatureMethod_PUT_HMACOutputLength) */

void zxmd_ds_SignatureMethod_PUT_HMACOutputLength(struct zxmd_ds_SignatureMethod_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->HMACOutputLength;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->HMACOutputLength = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_SignatureMethod_ADD_HMACOutputLength) */

void zxmd_ds_SignatureMethod_ADD_HMACOutputLength(struct zxmd_ds_SignatureMethod_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->HMACOutputLength->g;
    x->HMACOutputLength = z;
    return;
  case -1:
    y = x->HMACOutputLength;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->HMACOutputLength; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_SignatureMethod_DEL_HMACOutputLength) */

void zxmd_ds_SignatureMethod_DEL_HMACOutputLength(struct zxmd_ds_SignatureMethod_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->HMACOutputLength = (struct zx_elem_s*)x->HMACOutputLength->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->HMACOutputLength;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->HMACOutputLength; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}

/* FUNC(zxmd_ds_SignatureMethod_GET_Algorithm) */
struct zx_str_s* zxmd_ds_SignatureMethod_GET_Algorithm(struct zxmd_ds_SignatureMethod_s* x) { return x->Algorithm; }
/* FUNC(zxmd_ds_SignatureMethod_PUT_Algorithm) */
void zxmd_ds_SignatureMethod_PUT_Algorithm(struct zxmd_ds_SignatureMethod_s* x, struct zx_str_s* y) { x->Algorithm = y; }







/* FUNC(zxmd_ds_SignatureProperties_NUM_SignatureProperty) */

int zxmd_ds_SignatureProperties_NUM_SignatureProperty(struct zxmd_ds_SignatureProperties_s* x)
{
  struct zxmd_ds_SignatureProperty_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SignatureProperty; y; ++n, y = (struct zxmd_ds_SignatureProperty_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_SignatureProperties_GET_SignatureProperty) */

struct zxmd_ds_SignatureProperty_s* zxmd_ds_SignatureProperties_GET_SignatureProperty(struct zxmd_ds_SignatureProperties_s* x, int n)
{
  struct zxmd_ds_SignatureProperty_s* y;
  if (!x) return 0;
  for (y = x->SignatureProperty; n>=0 && y; --n, y = (struct zxmd_ds_SignatureProperty_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_SignatureProperties_POP_SignatureProperty) */

struct zxmd_ds_SignatureProperty_s* zxmd_ds_SignatureProperties_POP_SignatureProperty(struct zxmd_ds_SignatureProperties_s* x)
{
  struct zxmd_ds_SignatureProperty_s* y;
  if (!x) return 0;
  y = x->SignatureProperty;
  if (y)
    x->SignatureProperty = (struct zxmd_ds_SignatureProperty_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_SignatureProperties_PUSH_SignatureProperty) */

void zxmd_ds_SignatureProperties_PUSH_SignatureProperty(struct zxmd_ds_SignatureProperties_s* x, struct zxmd_ds_SignatureProperty_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SignatureProperty->gg.g;
  x->SignatureProperty = z;
}

/* FUNC(zxmd_ds_SignatureProperties_REV_SignatureProperty) */

void zxmd_ds_SignatureProperties_REV_SignatureProperty(struct zxmd_ds_SignatureProperties_s* x)
{
  struct zxmd_ds_SignatureProperty_s* nxt;
  struct zxmd_ds_SignatureProperty_s* y;
  if (!x) return;
  y = x->SignatureProperty;
  if (!y) return;
  x->SignatureProperty = 0;
  while (y) {
    nxt = (struct zxmd_ds_SignatureProperty_s*)y->gg.g.n;
    y->gg.g.n = &x->SignatureProperty->gg.g;
    x->SignatureProperty = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_SignatureProperties_PUT_SignatureProperty) */

void zxmd_ds_SignatureProperties_PUT_SignatureProperty(struct zxmd_ds_SignatureProperties_s* x, int n, struct zxmd_ds_SignatureProperty_s* z)
{
  struct zxmd_ds_SignatureProperty_s* y;
  if (!x || !z) return;
  y = x->SignatureProperty;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SignatureProperty = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SignatureProperty_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_SignatureProperties_ADD_SignatureProperty) */

void zxmd_ds_SignatureProperties_ADD_SignatureProperty(struct zxmd_ds_SignatureProperties_s* x, int n, struct zxmd_ds_SignatureProperty_s* z)
{
  struct zxmd_ds_SignatureProperty_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SignatureProperty->gg.g;
    x->SignatureProperty = z;
    return;
  case -1:
    y = x->SignatureProperty;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_SignatureProperty_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SignatureProperty; n > 1 && y; --n, y = (struct zxmd_ds_SignatureProperty_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_SignatureProperties_DEL_SignatureProperty) */

void zxmd_ds_SignatureProperties_DEL_SignatureProperty(struct zxmd_ds_SignatureProperties_s* x, int n)
{
  struct zxmd_ds_SignatureProperty_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SignatureProperty = (struct zxmd_ds_SignatureProperty_s*)x->SignatureProperty->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_SignatureProperty_s*)x->SignatureProperty;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_SignatureProperty_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SignatureProperty; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SignatureProperty_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_ds_SignatureProperties_GET_Id) */
struct zx_str_s* zxmd_ds_SignatureProperties_GET_Id(struct zxmd_ds_SignatureProperties_s* x) { return x->Id; }
/* FUNC(zxmd_ds_SignatureProperties_PUT_Id) */
void zxmd_ds_SignatureProperties_PUT_Id(struct zxmd_ds_SignatureProperties_s* x, struct zx_str_s* y) { x->Id = y; }





/* FUNC(zxmd_ds_SignatureProperty_GET_Target) */
struct zx_str_s* zxmd_ds_SignatureProperty_GET_Target(struct zxmd_ds_SignatureProperty_s* x) { return x->Target; }
/* FUNC(zxmd_ds_SignatureProperty_PUT_Target) */
void zxmd_ds_SignatureProperty_PUT_Target(struct zxmd_ds_SignatureProperty_s* x, struct zx_str_s* y) { x->Target = y; }
/* FUNC(zxmd_ds_SignatureProperty_GET_Id) */
struct zx_str_s* zxmd_ds_SignatureProperty_GET_Id(struct zxmd_ds_SignatureProperty_s* x) { return x->Id; }
/* FUNC(zxmd_ds_SignatureProperty_PUT_Id) */
void zxmd_ds_SignatureProperty_PUT_Id(struct zxmd_ds_SignatureProperty_s* x, struct zx_str_s* y) { x->Id = y; }





