gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_ds_SignatureValue_GET_Id) */
struct zx_str_s* zxmd_ds_SignatureValue_GET_Id(struct zxmd_ds_SignatureValue_s* x) { return x->Id; }
/* FUNC(zxmd_ds_SignatureValue_PUT_Id) */
void zxmd_ds_SignatureValue_PUT_Id(struct zxmd_ds_SignatureValue_s* x, struct zx_str_s* y) { x->Id = y; }







/* FUNC(zxmd_ds_SignedInfo_NUM_CanonicalizationMethod) */

int zxmd_ds_SignedInfo_NUM_CanonicalizationMethod(struct zxmd_ds_SignedInfo_s* x)
{
  struct zxmd_ds_CanonicalizationMethod_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->CanonicalizationMethod; y; ++n, y = (struct zxmd_ds_CanonicalizationMethod_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_SignedInfo_GET_CanonicalizationMethod) */

struct zxmd_ds_CanonicalizationMethod_s* zxmd_ds_SignedInfo_GET_CanonicalizationMethod(struct zxmd_ds_SignedInfo_s* x, int n)
{
  struct zxmd_ds_CanonicalizationMethod_s* y;
  if (!x) return 0;
  for (y = x->CanonicalizationMethod; n>=0 && y; --n, y = (struct zxmd_ds_CanonicalizationMethod_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_SignedInfo_POP_CanonicalizationMethod) */

struct zxmd_ds_CanonicalizationMethod_s* zxmd_ds_SignedInfo_POP_CanonicalizationMethod(struct zxmd_ds_SignedInfo_s* x)
{
  struct zxmd_ds_CanonicalizationMethod_s* y;
  if (!x) return 0;
  y = x->CanonicalizationMethod;
  if (y)
    x->CanonicalizationMethod = (struct zxmd_ds_CanonicalizationMethod_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_SignedInfo_PUSH_CanonicalizationMethod) */

void zxmd_ds_SignedInfo_PUSH_CanonicalizationMethod(struct zxmd_ds_SignedInfo_s* x, struct zxmd_ds_CanonicalizationMethod_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->CanonicalizationMethod->gg.g;
  x->CanonicalizationMethod = z;
}

/* FUNC(zxmd_ds_SignedInfo_REV_CanonicalizationMethod) */

void zxmd_ds_SignedInfo_REV_CanonicalizationMethod(struct zxmd_ds_SignedInfo_s* x)
{
  struct zxmd_ds_CanonicalizationMethod_s* nxt;
  struct zxmd_ds_CanonicalizationMethod_s* y;
  if (!x) return;
  y = x->CanonicalizationMethod;
  if (!y) return;
  x->CanonicalizationMethod = 0;
  while (y) {
    nxt = (struct zxmd_ds_CanonicalizationMethod_s*)y->gg.g.n;
    y->gg.g.n = &x->CanonicalizationMethod->gg.g;
    x->CanonicalizationMethod = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_SignedInfo_PUT_CanonicalizationMethod) */

void zxmd_ds_SignedInfo_PUT_CanonicalizationMethod(struct zxmd_ds_SignedInfo_s* x, int n, struct zxmd_ds_CanonicalizationMethod_s* z)
{
  struct zxmd_ds_CanonicalizationMethod_s* y;
  if (!x || !z) return;
  y = x->CanonicalizationMethod;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->CanonicalizationMethod = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_CanonicalizationMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_SignedInfo_ADD_CanonicalizationMethod) */

void zxmd_ds_SignedInfo_ADD_CanonicalizationMethod(struct zxmd_ds_SignedInfo_s* x, int n, struct zxmd_ds_CanonicalizationMethod_s* z)
{
  struct zxmd_ds_CanonicalizationMethod_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->CanonicalizationMethod->gg.g;
    x->CanonicalizationMethod = z;
    return;
  case -1:
    y = x->CanonicalizationMethod;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_CanonicalizationMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->CanonicalizationMethod; n > 1 && y; --n, y = (struct zxmd_ds_CanonicalizationMethod_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_SignedInfo_DEL_CanonicalizationMethod) */

void zxmd_ds_SignedInfo_DEL_CanonicalizationMethod(struct zxmd_ds_SignedInfo_s* x, int n)
{
  struct zxmd_ds_CanonicalizationMethod_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->CanonicalizationMethod = (struct zxmd_ds_CanonicalizationMethod_s*)x->CanonicalizationMethod->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_CanonicalizationMethod_s*)x->CanonicalizationMethod;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_CanonicalizationMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->CanonicalizationMethod; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_CanonicalizationMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_SignedInfo_NUM_SignatureMethod) */

int zxmd_ds_SignedInfo_NUM_SignatureMethod(struct zxmd_ds_SignedInfo_s* x)
{
  struct zxmd_ds_SignatureMethod_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SignatureMethod; y; ++n, y = (struct zxmd_ds_SignatureMethod_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_SignedInfo_GET_SignatureMethod) */

struct zxmd_ds_SignatureMethod_s* zxmd_ds_SignedInfo_GET_SignatureMethod(struct zxmd_ds_SignedInfo_s* x, int n)
{
  struct zxmd_ds_SignatureMethod_s* y;
  if (!x) return 0;
  for (y = x->SignatureMethod; n>=0 && y; --n, y = (struct zxmd_ds_SignatureMethod_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_SignedInfo_POP_SignatureMethod) */

struct zxmd_ds_SignatureMethod_s* zxmd_ds_SignedInfo_POP_SignatureMethod(struct zxmd_ds_SignedInfo_s* x)
{
  struct zxmd_ds_SignatureMethod_s* y;
  if (!x) return 0;
  y = x->SignatureMethod;
  if (y)
    x->SignatureMethod = (struct zxmd_ds_SignatureMethod_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_SignedInfo_PUSH_SignatureMethod) */

void zxmd_ds_SignedInfo_PUSH_SignatureMethod(struct zxmd_ds_SignedInfo_s* x, struct zxmd_ds_SignatureMethod_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SignatureMethod->gg.g;
  x->SignatureMethod = z;
}

/* FUNC(zxmd_ds_SignedInfo_REV_SignatureMethod) */

void zxmd_ds_SignedInfo_REV_SignatureMethod(struct zxmd_ds_SignedInfo_s* x)
{
  struct zxmd_ds_SignatureMethod_s* nxt;
  struct zxmd_ds_SignatureMethod_s* y;
  if (!x) return;
  y = x->SignatureMethod;
  if (!y) return;
  x->SignatureMethod = 0;
  while (y) {
    nxt = (struct zxmd_ds_SignatureMethod_s*)y->gg.g.n;
    y->gg.g.n = &x->SignatureMethod->gg.g;
    x->SignatureMethod = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_SignedInfo_PUT_SignatureMethod) */

void zxmd_ds_SignedInfo_PUT_SignatureMethod(struct zxmd_ds_SignedInfo_s* x, int n, struct zxmd_ds_SignatureMethod_s* z)
{
  struct zxmd_ds_SignatureMethod_s* y;
  if (!x || !z) return;
  y = x->SignatureMethod;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SignatureMethod = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SignatureMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_SignedInfo_ADD_SignatureMethod) */

