gitpan/zxid/c/saml2md-getput.c
void zxmd_ds_SignedInfo_ADD_SignatureMethod(struct zxmd_ds_SignedInfo_s* x, int n, struct zxmd_ds_SignatureMethod_s* z)
{
  struct zxmd_ds_SignatureMethod_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SignatureMethod->gg.g;
    x->SignatureMethod = z;
    return;
  case -1:
    y = x->SignatureMethod;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_SignatureMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SignatureMethod; n > 1 && y; --n, y = (struct zxmd_ds_SignatureMethod_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_SignedInfo_DEL_SignatureMethod) */

void zxmd_ds_SignedInfo_DEL_SignatureMethod(struct zxmd_ds_SignedInfo_s* x, int n)
{
  struct zxmd_ds_SignatureMethod_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SignatureMethod = (struct zxmd_ds_SignatureMethod_s*)x->SignatureMethod->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_SignatureMethod_s*)x->SignatureMethod;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_SignatureMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SignatureMethod; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SignatureMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_SignedInfo_NUM_Reference) */

int zxmd_ds_SignedInfo_NUM_Reference(struct zxmd_ds_SignedInfo_s* x)
{
  struct zxmd_ds_Reference_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Reference; y; ++n, y = (struct zxmd_ds_Reference_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_SignedInfo_GET_Reference) */

struct zxmd_ds_Reference_s* zxmd_ds_SignedInfo_GET_Reference(struct zxmd_ds_SignedInfo_s* x, int n)
{
  struct zxmd_ds_Reference_s* y;
  if (!x) return 0;
  for (y = x->Reference; n>=0 && y; --n, y = (struct zxmd_ds_Reference_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_SignedInfo_POP_Reference) */

struct zxmd_ds_Reference_s* zxmd_ds_SignedInfo_POP_Reference(struct zxmd_ds_SignedInfo_s* x)
{
  struct zxmd_ds_Reference_s* y;
  if (!x) return 0;
  y = x->Reference;
  if (y)
    x->Reference = (struct zxmd_ds_Reference_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_SignedInfo_PUSH_Reference) */

void zxmd_ds_SignedInfo_PUSH_Reference(struct zxmd_ds_SignedInfo_s* x, struct zxmd_ds_Reference_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Reference->gg.g;
  x->Reference = z;
}

/* FUNC(zxmd_ds_SignedInfo_REV_Reference) */

void zxmd_ds_SignedInfo_REV_Reference(struct zxmd_ds_SignedInfo_s* x)
{
  struct zxmd_ds_Reference_s* nxt;
  struct zxmd_ds_Reference_s* y;
  if (!x) return;
  y = x->Reference;
  if (!y) return;
  x->Reference = 0;
  while (y) {
    nxt = (struct zxmd_ds_Reference_s*)y->gg.g.n;
    y->gg.g.n = &x->Reference->gg.g;
    x->Reference = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_SignedInfo_PUT_Reference) */

void zxmd_ds_SignedInfo_PUT_Reference(struct zxmd_ds_SignedInfo_s* x, int n, struct zxmd_ds_Reference_s* z)
{
  struct zxmd_ds_Reference_s* y;
  if (!x || !z) return;
  y = x->Reference;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Reference = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Reference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_SignedInfo_ADD_Reference) */

void zxmd_ds_SignedInfo_ADD_Reference(struct zxmd_ds_SignedInfo_s* x, int n, struct zxmd_ds_Reference_s* z)
{
  struct zxmd_ds_Reference_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Reference->gg.g;
    x->Reference = z;
    return;
  case -1:
    y = x->Reference;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_Reference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Reference; n > 1 && y; --n, y = (struct zxmd_ds_Reference_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_SignedInfo_DEL_Reference) */

void zxmd_ds_SignedInfo_DEL_Reference(struct zxmd_ds_SignedInfo_s* x, int n)
{
  struct zxmd_ds_Reference_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Reference = (struct zxmd_ds_Reference_s*)x->Reference->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_Reference_s*)x->Reference;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_Reference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Reference; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Reference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_ds_SignedInfo_GET_Id) */
struct zx_str_s* zxmd_ds_SignedInfo_GET_Id(struct zxmd_ds_SignedInfo_s* x) { return x->Id; }
/* FUNC(zxmd_ds_SignedInfo_PUT_Id) */
void zxmd_ds_SignedInfo_PUT_Id(struct zxmd_ds_SignedInfo_s* x, struct zx_str_s* y) { x->Id = y; }







/* FUNC(zxmd_ds_Transform_NUM_XPath) */

int zxmd_ds_Transform_NUM_XPath(struct zxmd_ds_Transform_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->XPath; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_Transform_GET_XPath) */

struct zx_elem_s* zxmd_ds_Transform_GET_XPath(struct zxmd_ds_Transform_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->XPath; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_Transform_POP_XPath) */

struct zx_elem_s* zxmd_ds_Transform_POP_XPath(struct zxmd_ds_Transform_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->XPath;
  if (y)
    x->XPath = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_Transform_PUSH_XPath) */

void zxmd_ds_Transform_PUSH_XPath(struct zxmd_ds_Transform_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->XPath->g;
  x->XPath = z;
}

/* FUNC(zxmd_ds_Transform_REV_XPath) */

void zxmd_ds_Transform_REV_XPath(struct zxmd_ds_Transform_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->XPath;
  if (!y) return;
  x->XPath = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->XPath->g;
    x->XPath = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_Transform_PUT_XPath) */

void zxmd_ds_Transform_PUT_XPath(struct zxmd_ds_Transform_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->XPath;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->XPath = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_Transform_ADD_XPath) */

void zxmd_ds_Transform_ADD_XPath(struct zxmd_ds_Transform_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->XPath->g;
    x->XPath = z;
    return;
  case -1:
    y = x->XPath;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->XPath; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_Transform_DEL_XPath) */

void zxmd_ds_Transform_DEL_XPath(struct zxmd_ds_Transform_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->XPath = (struct zx_elem_s*)x->XPath->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->XPath;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->XPath; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}

/* FUNC(zxmd_ds_Transform_GET_Algorithm) */
struct zx_str_s* zxmd_ds_Transform_GET_Algorithm(struct zxmd_ds_Transform_s* x) { return x->Algorithm; }
/* FUNC(zxmd_ds_Transform_PUT_Algorithm) */
void zxmd_ds_Transform_PUT_Algorithm(struct zxmd_ds_Transform_s* x, struct zx_str_s* y) { x->Algorithm = y; }







