gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_ds_Transforms_NUM_Transform) */

int zxmd_ds_Transforms_NUM_Transform(struct zxmd_ds_Transforms_s* x)
{
  struct zxmd_ds_Transform_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Transform; y; ++n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_Transforms_GET_Transform) */

struct zxmd_ds_Transform_s* zxmd_ds_Transforms_GET_Transform(struct zxmd_ds_Transforms_s* x, int n)
{
  struct zxmd_ds_Transform_s* y;
  if (!x) return 0;
  for (y = x->Transform; n>=0 && y; --n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_Transforms_POP_Transform) */

struct zxmd_ds_Transform_s* zxmd_ds_Transforms_POP_Transform(struct zxmd_ds_Transforms_s* x)
{
  struct zxmd_ds_Transform_s* y;
  if (!x) return 0;
  y = x->Transform;
  if (y)
    x->Transform = (struct zxmd_ds_Transform_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_Transforms_PUSH_Transform) */

void zxmd_ds_Transforms_PUSH_Transform(struct zxmd_ds_Transforms_s* x, struct zxmd_ds_Transform_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Transform->gg.g;
  x->Transform = z;
}

/* FUNC(zxmd_ds_Transforms_REV_Transform) */

void zxmd_ds_Transforms_REV_Transform(struct zxmd_ds_Transforms_s* x)
{
  struct zxmd_ds_Transform_s* nxt;
  struct zxmd_ds_Transform_s* y;
  if (!x) return;
  y = x->Transform;
  if (!y) return;
  x->Transform = 0;
  while (y) {
    nxt = (struct zxmd_ds_Transform_s*)y->gg.g.n;
    y->gg.g.n = &x->Transform->gg.g;
    x->Transform = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_Transforms_PUT_Transform) */

void zxmd_ds_Transforms_PUT_Transform(struct zxmd_ds_Transforms_s* x, int n, struct zxmd_ds_Transform_s* z)
{
  struct zxmd_ds_Transform_s* y;
  if (!x || !z) return;
  y = x->Transform;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Transform = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_Transforms_ADD_Transform) */

void zxmd_ds_Transforms_ADD_Transform(struct zxmd_ds_Transforms_s* x, int n, struct zxmd_ds_Transform_s* z)
{
  struct zxmd_ds_Transform_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Transform->gg.g;
    x->Transform = z;
    return;
  case -1:
    y = x->Transform;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Transform; n > 1 && y; --n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_Transforms_DEL_Transform) */

void zxmd_ds_Transforms_DEL_Transform(struct zxmd_ds_Transforms_s* x, int n)
{
  struct zxmd_ds_Transform_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Transform = (struct zxmd_ds_Transform_s*)x->Transform->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_Transform_s*)x->Transform;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Transform; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zxmd_ds_X509Data_NUM_X509IssuerSerial) */

int zxmd_ds_X509Data_NUM_X509IssuerSerial(struct zxmd_ds_X509Data_s* x)
{
  struct zxmd_ds_X509IssuerSerial_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->X509IssuerSerial; y; ++n, y = (struct zxmd_ds_X509IssuerSerial_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_ds_X509Data_GET_X509IssuerSerial) */

struct zxmd_ds_X509IssuerSerial_s* zxmd_ds_X509Data_GET_X509IssuerSerial(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zxmd_ds_X509IssuerSerial_s* y;
  if (!x) return 0;
  for (y = x->X509IssuerSerial; n>=0 && y; --n, y = (struct zxmd_ds_X509IssuerSerial_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_ds_X509Data_POP_X509IssuerSerial) */

struct zxmd_ds_X509IssuerSerial_s* zxmd_ds_X509Data_POP_X509IssuerSerial(struct zxmd_ds_X509Data_s* x)
{
  struct zxmd_ds_X509IssuerSerial_s* y;
  if (!x) return 0;
  y = x->X509IssuerSerial;
  if (y)
    x->X509IssuerSerial = (struct zxmd_ds_X509IssuerSerial_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_ds_X509Data_PUSH_X509IssuerSerial) */

void zxmd_ds_X509Data_PUSH_X509IssuerSerial(struct zxmd_ds_X509Data_s* x, struct zxmd_ds_X509IssuerSerial_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->X509IssuerSerial->gg.g;
  x->X509IssuerSerial = z;
}

/* FUNC(zxmd_ds_X509Data_REV_X509IssuerSerial) */

void zxmd_ds_X509Data_REV_X509IssuerSerial(struct zxmd_ds_X509Data_s* x)
{
  struct zxmd_ds_X509IssuerSerial_s* nxt;
  struct zxmd_ds_X509IssuerSerial_s* y;
  if (!x) return;
  y = x->X509IssuerSerial;
  if (!y) return;
  x->X509IssuerSerial = 0;
  while (y) {
    nxt = (struct zxmd_ds_X509IssuerSerial_s*)y->gg.g.n;
    y->gg.g.n = &x->X509IssuerSerial->gg.g;
    x->X509IssuerSerial = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_X509Data_PUT_X509IssuerSerial) */

void zxmd_ds_X509Data_PUT_X509IssuerSerial(struct zxmd_ds_X509Data_s* x, int n, struct zxmd_ds_X509IssuerSerial_s* z)
{
  struct zxmd_ds_X509IssuerSerial_s* y;
  if (!x || !z) return;
  y = x->X509IssuerSerial;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->X509IssuerSerial = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_X509IssuerSerial_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_ds_X509Data_ADD_X509IssuerSerial) */

void zxmd_ds_X509Data_ADD_X509IssuerSerial(struct zxmd_ds_X509Data_s* x, int n, struct zxmd_ds_X509IssuerSerial_s* z)
{
  struct zxmd_ds_X509IssuerSerial_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->X509IssuerSerial->gg.g;
    x->X509IssuerSerial = z;
    return;
  case -1:
    y = x->X509IssuerSerial;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_X509IssuerSerial_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->X509IssuerSerial; n > 1 && y; --n, y = (struct zxmd_ds_X509IssuerSerial_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_ds_X509Data_DEL_X509IssuerSerial) */

void zxmd_ds_X509Data_DEL_X509IssuerSerial(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zxmd_ds_X509IssuerSerial_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->X509IssuerSerial = (struct zxmd_ds_X509IssuerSerial_s*)x->X509IssuerSerial->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_X509IssuerSerial_s*)x->X509IssuerSerial;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_X509IssuerSerial_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->X509IssuerSerial; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_X509IssuerSerial_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_ds_X509Data_NUM_X509SKI) */

