gitpan/zxid/c/saml2md-getput.c
int zxmd_ds_X509Data_NUM_X509SKI(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->X509SKI; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_X509Data_GET_X509SKI) */

struct zx_elem_s* zxmd_ds_X509Data_GET_X509SKI(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->X509SKI; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_X509Data_POP_X509SKI) */

struct zx_elem_s* zxmd_ds_X509Data_POP_X509SKI(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->X509SKI;
  if (y)
    x->X509SKI = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_X509Data_PUSH_X509SKI) */

void zxmd_ds_X509Data_PUSH_X509SKI(struct zxmd_ds_X509Data_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->X509SKI->g;
  x->X509SKI = z;
}

/* FUNC(zxmd_ds_X509Data_REV_X509SKI) */

void zxmd_ds_X509Data_REV_X509SKI(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->X509SKI;
  if (!y) return;
  x->X509SKI = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->X509SKI->g;
    x->X509SKI = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_X509Data_PUT_X509SKI) */

void zxmd_ds_X509Data_PUT_X509SKI(struct zxmd_ds_X509Data_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->X509SKI;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->X509SKI = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_X509Data_ADD_X509SKI) */

void zxmd_ds_X509Data_ADD_X509SKI(struct zxmd_ds_X509Data_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->X509SKI->g;
    x->X509SKI = z;
    return;
  case -1:
    y = x->X509SKI;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509SKI; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_X509Data_DEL_X509SKI) */

void zxmd_ds_X509Data_DEL_X509SKI(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->X509SKI = (struct zx_elem_s*)x->X509SKI->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->X509SKI;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509SKI; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_ds_X509Data_NUM_X509SubjectName) */

int zxmd_ds_X509Data_NUM_X509SubjectName(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->X509SubjectName; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_X509Data_GET_X509SubjectName) */

struct zx_elem_s* zxmd_ds_X509Data_GET_X509SubjectName(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->X509SubjectName; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_X509Data_POP_X509SubjectName) */

struct zx_elem_s* zxmd_ds_X509Data_POP_X509SubjectName(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->X509SubjectName;
  if (y)
    x->X509SubjectName = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_X509Data_PUSH_X509SubjectName) */

void zxmd_ds_X509Data_PUSH_X509SubjectName(struct zxmd_ds_X509Data_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->X509SubjectName->g;
  x->X509SubjectName = z;
}

/* FUNC(zxmd_ds_X509Data_REV_X509SubjectName) */

void zxmd_ds_X509Data_REV_X509SubjectName(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->X509SubjectName;
  if (!y) return;
  x->X509SubjectName = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->X509SubjectName->g;
    x->X509SubjectName = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_X509Data_PUT_X509SubjectName) */

void zxmd_ds_X509Data_PUT_X509SubjectName(struct zxmd_ds_X509Data_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->X509SubjectName;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->X509SubjectName = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_X509Data_ADD_X509SubjectName) */

void zxmd_ds_X509Data_ADD_X509SubjectName(struct zxmd_ds_X509Data_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->X509SubjectName->g;
    x->X509SubjectName = z;
    return;
  case -1:
    y = x->X509SubjectName;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509SubjectName; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_X509Data_DEL_X509SubjectName) */

void zxmd_ds_X509Data_DEL_X509SubjectName(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->X509SubjectName = (struct zx_elem_s*)x->X509SubjectName->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->X509SubjectName;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509SubjectName; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_ds_X509Data_NUM_X509Certificate) */

int zxmd_ds_X509Data_NUM_X509Certificate(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->X509Certificate; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_X509Data_GET_X509Certificate) */

struct zx_elem_s* zxmd_ds_X509Data_GET_X509Certificate(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->X509Certificate; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

