gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_ds_X509Data_POP_X509Certificate) */

struct zx_elem_s* zxmd_ds_X509Data_POP_X509Certificate(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->X509Certificate;
  if (y)
    x->X509Certificate = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_X509Data_PUSH_X509Certificate) */

void zxmd_ds_X509Data_PUSH_X509Certificate(struct zxmd_ds_X509Data_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->X509Certificate->g;
  x->X509Certificate = z;
}

/* FUNC(zxmd_ds_X509Data_REV_X509Certificate) */

void zxmd_ds_X509Data_REV_X509Certificate(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->X509Certificate;
  if (!y) return;
  x->X509Certificate = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->X509Certificate->g;
    x->X509Certificate = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_X509Data_PUT_X509Certificate) */

void zxmd_ds_X509Data_PUT_X509Certificate(struct zxmd_ds_X509Data_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->X509Certificate;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->X509Certificate = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_X509Data_ADD_X509Certificate) */

void zxmd_ds_X509Data_ADD_X509Certificate(struct zxmd_ds_X509Data_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->X509Certificate->g;
    x->X509Certificate = z;
    return;
  case -1:
    y = x->X509Certificate;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509Certificate; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_X509Data_DEL_X509Certificate) */

void zxmd_ds_X509Data_DEL_X509Certificate(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->X509Certificate = (struct zx_elem_s*)x->X509Certificate->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->X509Certificate;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509Certificate; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_ds_X509Data_NUM_X509CRL) */

int zxmd_ds_X509Data_NUM_X509CRL(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->X509CRL; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_X509Data_GET_X509CRL) */

struct zx_elem_s* zxmd_ds_X509Data_GET_X509CRL(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->X509CRL; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_X509Data_POP_X509CRL) */

struct zx_elem_s* zxmd_ds_X509Data_POP_X509CRL(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->X509CRL;
  if (y)
    x->X509CRL = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_X509Data_PUSH_X509CRL) */

void zxmd_ds_X509Data_PUSH_X509CRL(struct zxmd_ds_X509Data_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->X509CRL->g;
  x->X509CRL = z;
}

/* FUNC(zxmd_ds_X509Data_REV_X509CRL) */

void zxmd_ds_X509Data_REV_X509CRL(struct zxmd_ds_X509Data_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->X509CRL;
  if (!y) return;
  x->X509CRL = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->X509CRL->g;
    x->X509CRL = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_X509Data_PUT_X509CRL) */

void zxmd_ds_X509Data_PUT_X509CRL(struct zxmd_ds_X509Data_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->X509CRL;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->X509CRL = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_X509Data_ADD_X509CRL) */

void zxmd_ds_X509Data_ADD_X509CRL(struct zxmd_ds_X509Data_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->X509CRL->g;
    x->X509CRL = z;
    return;
  case -1:
    y = x->X509CRL;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509CRL; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_X509Data_DEL_X509CRL) */

void zxmd_ds_X509Data_DEL_X509CRL(struct zxmd_ds_X509Data_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->X509CRL = (struct zx_elem_s*)x->X509CRL->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->X509CRL;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509CRL; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}








/* FUNC(zxmd_ds_X509IssuerSerial_NUM_X509IssuerName) */

int zxmd_ds_X509IssuerSerial_NUM_X509IssuerName(struct zxmd_ds_X509IssuerSerial_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->X509IssuerName; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_X509IssuerSerial_GET_X509IssuerName) */

struct zx_elem_s* zxmd_ds_X509IssuerSerial_GET_X509IssuerName(struct zxmd_ds_X509IssuerSerial_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->X509IssuerName; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

