gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_ds_X509IssuerSerial_POP_X509IssuerName) */

struct zx_elem_s* zxmd_ds_X509IssuerSerial_POP_X509IssuerName(struct zxmd_ds_X509IssuerSerial_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->X509IssuerName;
  if (y)
    x->X509IssuerName = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_X509IssuerSerial_PUSH_X509IssuerName) */

void zxmd_ds_X509IssuerSerial_PUSH_X509IssuerName(struct zxmd_ds_X509IssuerSerial_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->X509IssuerName->g;
  x->X509IssuerName = z;
}

/* FUNC(zxmd_ds_X509IssuerSerial_REV_X509IssuerName) */

void zxmd_ds_X509IssuerSerial_REV_X509IssuerName(struct zxmd_ds_X509IssuerSerial_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->X509IssuerName;
  if (!y) return;
  x->X509IssuerName = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->X509IssuerName->g;
    x->X509IssuerName = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_X509IssuerSerial_PUT_X509IssuerName) */

void zxmd_ds_X509IssuerSerial_PUT_X509IssuerName(struct zxmd_ds_X509IssuerSerial_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->X509IssuerName;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->X509IssuerName = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_X509IssuerSerial_ADD_X509IssuerName) */

void zxmd_ds_X509IssuerSerial_ADD_X509IssuerName(struct zxmd_ds_X509IssuerSerial_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->X509IssuerName->g;
    x->X509IssuerName = z;
    return;
  case -1:
    y = x->X509IssuerName;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509IssuerName; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_X509IssuerSerial_DEL_X509IssuerName) */

void zxmd_ds_X509IssuerSerial_DEL_X509IssuerName(struct zxmd_ds_X509IssuerSerial_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->X509IssuerName = (struct zx_elem_s*)x->X509IssuerName->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->X509IssuerName;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509IssuerName; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_ds_X509IssuerSerial_NUM_X509SerialNumber) */

int zxmd_ds_X509IssuerSerial_NUM_X509SerialNumber(struct zxmd_ds_X509IssuerSerial_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->X509SerialNumber; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_ds_X509IssuerSerial_GET_X509SerialNumber) */

struct zx_elem_s* zxmd_ds_X509IssuerSerial_GET_X509SerialNumber(struct zxmd_ds_X509IssuerSerial_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->X509SerialNumber; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_ds_X509IssuerSerial_POP_X509SerialNumber) */

struct zx_elem_s* zxmd_ds_X509IssuerSerial_POP_X509SerialNumber(struct zxmd_ds_X509IssuerSerial_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->X509SerialNumber;
  if (y)
    x->X509SerialNumber = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_ds_X509IssuerSerial_PUSH_X509SerialNumber) */

void zxmd_ds_X509IssuerSerial_PUSH_X509SerialNumber(struct zxmd_ds_X509IssuerSerial_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->X509SerialNumber->g;
  x->X509SerialNumber = z;
}

/* FUNC(zxmd_ds_X509IssuerSerial_REV_X509SerialNumber) */

void zxmd_ds_X509IssuerSerial_REV_X509SerialNumber(struct zxmd_ds_X509IssuerSerial_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->X509SerialNumber;
  if (!y) return;
  x->X509SerialNumber = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->X509SerialNumber->g;
    x->X509SerialNumber = y;
    y = nxt;
  }
}

/* FUNC(zxmd_ds_X509IssuerSerial_PUT_X509SerialNumber) */

void zxmd_ds_X509IssuerSerial_PUT_X509SerialNumber(struct zxmd_ds_X509IssuerSerial_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->X509SerialNumber;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->X509SerialNumber = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_ds_X509IssuerSerial_ADD_X509SerialNumber) */

void zxmd_ds_X509IssuerSerial_ADD_X509SerialNumber(struct zxmd_ds_X509IssuerSerial_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->X509SerialNumber->g;
    x->X509SerialNumber = z;
    return;
  case -1:
    y = x->X509SerialNumber;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509SerialNumber; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_ds_X509IssuerSerial_DEL_X509SerialNumber) */

void zxmd_ds_X509IssuerSerial_DEL_X509SerialNumber(struct zxmd_ds_X509IssuerSerial_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->X509SerialNumber = (struct zx_elem_s*)x->X509SerialNumber->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->X509SerialNumber;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->X509SerialNumber; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}






/* FUNC(zxmd_md_AdditionalMetadataLocation_GET_namespace) */
struct zx_str_s* zxmd_md_AdditionalMetadataLocation_GET_namespace(struct zxmd_md_AdditionalMetadataLocation_s* x) { return x->namespace; }
/* FUNC(zxmd_md_AdditionalMetadataLocation_PUT_namespace) */
void zxmd_md_AdditionalMetadataLocation_PUT_namespace(struct zxmd_md_AdditionalMetadataLocation_s* x, struct zx_str_s* y) { x->namespace = y; }







/* FUNC(zxmd_md_AffiliationDescriptor_NUM_Signature) */

int zxmd_md_AffiliationDescriptor_NUM_Signature(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Signature; y; ++n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AffiliationDescriptor_GET_Signature) */

