gitpan/zxid/c/saml2md-getput.c
struct zxmd_ds_Signature_s* zxmd_md_AffiliationDescriptor_GET_Signature(struct zxmd_md_AffiliationDescriptor_s* x, int n)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  for (y = x->Signature; n>=0 && y; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AffiliationDescriptor_POP_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_AffiliationDescriptor_POP_Signature(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  y = x->Signature;
  if (y)
    x->Signature = (struct zxmd_ds_Signature_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AffiliationDescriptor_PUSH_Signature) */

void zxmd_md_AffiliationDescriptor_PUSH_Signature(struct zxmd_md_AffiliationDescriptor_s* x, struct zxmd_ds_Signature_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Signature->gg.g;
  x->Signature = z;
}

/* FUNC(zxmd_md_AffiliationDescriptor_REV_Signature) */

void zxmd_md_AffiliationDescriptor_REV_Signature(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* nxt;
  struct zxmd_ds_Signature_s* y;
  if (!x) return;
  y = x->Signature;
  if (!y) return;
  x->Signature = 0;
  while (y) {
    nxt = (struct zxmd_ds_Signature_s*)y->gg.g.n;
    y->gg.g.n = &x->Signature->gg.g;
    x->Signature = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AffiliationDescriptor_PUT_Signature) */

void zxmd_md_AffiliationDescriptor_PUT_Signature(struct zxmd_md_AffiliationDescriptor_s* x, int n, struct zxmd_ds_Signature_s* z)
{
  struct zxmd_ds_Signature_s* y;
  if (!x || !z) return;
  y = x->Signature;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Signature = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AffiliationDescriptor_ADD_Signature) */

void zxmd_md_AffiliationDescriptor_ADD_Signature(struct zxmd_md_AffiliationDescriptor_s* x, int n, struct zxmd_ds_Signature_s* z)
{
  struct zxmd_ds_Signature_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Signature->gg.g;
    x->Signature = z;
    return;
  case -1:
    y = x->Signature;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Signature; n > 1 && y; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AffiliationDescriptor_DEL_Signature) */

void zxmd_md_AffiliationDescriptor_DEL_Signature(struct zxmd_md_AffiliationDescriptor_s* x, int n)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Signature = (struct zxmd_ds_Signature_s*)x->Signature->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_Signature_s*)x->Signature;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Signature; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_AffiliationDescriptor_NUM_Extensions) */

int zxmd_md_AffiliationDescriptor_NUM_Extensions(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zxmd_md_Extensions_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Extensions; y; ++n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AffiliationDescriptor_GET_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_AffiliationDescriptor_GET_Extensions(struct zxmd_md_AffiliationDescriptor_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  for (y = x->Extensions; n>=0 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AffiliationDescriptor_POP_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_AffiliationDescriptor_POP_Extensions(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  y = x->Extensions;
  if (y)
    x->Extensions = (struct zxmd_md_Extensions_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AffiliationDescriptor_PUSH_Extensions) */

void zxmd_md_AffiliationDescriptor_PUSH_Extensions(struct zxmd_md_AffiliationDescriptor_s* x, struct zxmd_md_Extensions_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Extensions->gg.g;
  x->Extensions = z;
}

/* FUNC(zxmd_md_AffiliationDescriptor_REV_Extensions) */

void zxmd_md_AffiliationDescriptor_REV_Extensions(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zxmd_md_Extensions_s* nxt;
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  y = x->Extensions;
  if (!y) return;
  x->Extensions = 0;
  while (y) {
    nxt = (struct zxmd_md_Extensions_s*)y->gg.g.n;
    y->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AffiliationDescriptor_PUT_Extensions) */

void zxmd_md_AffiliationDescriptor_PUT_Extensions(struct zxmd_md_AffiliationDescriptor_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  y = x->Extensions;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Extensions = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AffiliationDescriptor_ADD_Extensions) */

void zxmd_md_AffiliationDescriptor_ADD_Extensions(struct zxmd_md_AffiliationDescriptor_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = z;
    return;
  case -1:
    y = x->Extensions;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AffiliationDescriptor_DEL_Extensions) */

void zxmd_md_AffiliationDescriptor_DEL_Extensions(struct zxmd_md_AffiliationDescriptor_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Extensions = (struct zxmd_md_Extensions_s*)x->Extensions->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_Extensions_s*)x->Extensions;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_AffiliationDescriptor_NUM_AffiliateMember) */

