gitpan/zxid/c/saml2md-getput.c
int zxmd_md_AffiliationDescriptor_NUM_AffiliateMember(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AffiliateMember; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_md_AffiliationDescriptor_GET_AffiliateMember) */

struct zx_elem_s* zxmd_md_AffiliationDescriptor_GET_AffiliateMember(struct zxmd_md_AffiliationDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->AffiliateMember; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_AffiliationDescriptor_POP_AffiliateMember) */

struct zx_elem_s* zxmd_md_AffiliationDescriptor_POP_AffiliateMember(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->AffiliateMember;
  if (y)
    x->AffiliateMember = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_AffiliationDescriptor_PUSH_AffiliateMember) */

void zxmd_md_AffiliationDescriptor_PUSH_AffiliateMember(struct zxmd_md_AffiliationDescriptor_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->AffiliateMember->g;
  x->AffiliateMember = z;
}

/* FUNC(zxmd_md_AffiliationDescriptor_REV_AffiliateMember) */

void zxmd_md_AffiliationDescriptor_REV_AffiliateMember(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->AffiliateMember;
  if (!y) return;
  x->AffiliateMember = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->AffiliateMember->g;
    x->AffiliateMember = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AffiliationDescriptor_PUT_AffiliateMember) */

void zxmd_md_AffiliationDescriptor_PUT_AffiliateMember(struct zxmd_md_AffiliationDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->AffiliateMember;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->AffiliateMember = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_AffiliationDescriptor_ADD_AffiliateMember) */

void zxmd_md_AffiliationDescriptor_ADD_AffiliateMember(struct zxmd_md_AffiliationDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->AffiliateMember->g;
    x->AffiliateMember = z;
    return;
  case -1:
    y = x->AffiliateMember;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AffiliateMember; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_AffiliationDescriptor_DEL_AffiliateMember) */

void zxmd_md_AffiliationDescriptor_DEL_AffiliateMember(struct zxmd_md_AffiliationDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AffiliateMember = (struct zx_elem_s*)x->AffiliateMember->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->AffiliateMember;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AffiliateMember; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_md_AffiliationDescriptor_NUM_KeyDescriptor) */

int zxmd_md_AffiliationDescriptor_NUM_KeyDescriptor(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zxmd_md_KeyDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KeyDescriptor; y; ++n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AffiliationDescriptor_GET_KeyDescriptor) */

struct zxmd_md_KeyDescriptor_s* zxmd_md_AffiliationDescriptor_GET_KeyDescriptor(struct zxmd_md_AffiliationDescriptor_s* x, int n)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x) return 0;
  for (y = x->KeyDescriptor; n>=0 && y; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AffiliationDescriptor_POP_KeyDescriptor) */

struct zxmd_md_KeyDescriptor_s* zxmd_md_AffiliationDescriptor_POP_KeyDescriptor(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x) return 0;
  y = x->KeyDescriptor;
  if (y)
    x->KeyDescriptor = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AffiliationDescriptor_PUSH_KeyDescriptor) */

void zxmd_md_AffiliationDescriptor_PUSH_KeyDescriptor(struct zxmd_md_AffiliationDescriptor_s* x, struct zxmd_md_KeyDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->KeyDescriptor->gg.g;
  x->KeyDescriptor = z;
}

/* FUNC(zxmd_md_AffiliationDescriptor_REV_KeyDescriptor) */

void zxmd_md_AffiliationDescriptor_REV_KeyDescriptor(struct zxmd_md_AffiliationDescriptor_s* x)
{
  struct zxmd_md_KeyDescriptor_s* nxt;
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x) return;
  y = x->KeyDescriptor;
  if (!y) return;
  x->KeyDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->KeyDescriptor->gg.g;
    x->KeyDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AffiliationDescriptor_PUT_KeyDescriptor) */

void zxmd_md_AffiliationDescriptor_PUT_KeyDescriptor(struct zxmd_md_AffiliationDescriptor_s* x, int n, struct zxmd_md_KeyDescriptor_s* z)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x || !z) return;
  y = x->KeyDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->KeyDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AffiliationDescriptor_ADD_KeyDescriptor) */

void zxmd_md_AffiliationDescriptor_ADD_KeyDescriptor(struct zxmd_md_AffiliationDescriptor_s* x, int n, struct zxmd_md_KeyDescriptor_s* z)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->KeyDescriptor->gg.g;
    x->KeyDescriptor = z;
    return;
  case -1:
    y = x->KeyDescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyDescriptor; n > 1 && y; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AffiliationDescriptor_DEL_KeyDescriptor) */

void zxmd_md_AffiliationDescriptor_DEL_KeyDescriptor(struct zxmd_md_AffiliationDescriptor_s* x, int n)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyDescriptor = (struct zxmd_md_KeyDescriptor_s*)x->KeyDescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_KeyDescriptor_s*)x->KeyDescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyDescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_md_AffiliationDescriptor_GET_affiliationOwnerID) */
struct zx_str_s* zxmd_md_AffiliationDescriptor_GET_affiliationOwnerID(struct zxmd_md_AffiliationDescriptor_s* x) { return x->affiliationOwnerID; }
/* FUNC(zxmd_md_AffiliationDescriptor_PUT_affiliationOwnerID) */
void zxmd_md_AffiliationDescriptor_PUT_affiliationOwnerID(struct zxmd_md_AffiliationDescriptor_s* x, struct zx_str_s* y) { x->affiliationOwnerID = y; }
/* FUNC(zxmd_md_AffiliationDescriptor_GET_validUntil) */
struct zx_str_s* zxmd_md_AffiliationDescriptor_GET_validUntil(struct zxmd_md_AffiliationDescriptor_s* x) { return x->validUntil; }
/* FUNC(zxmd_md_AffiliationDescriptor_PUT_validUntil) */
void zxmd_md_AffiliationDescriptor_PUT_validUntil(struct zxmd_md_AffiliationDescriptor_s* x, struct zx_str_s* y) { x->validUntil = y; }
/* FUNC(zxmd_md_AffiliationDescriptor_GET_cacheDuration) */
struct zx_str_s* zxmd_md_AffiliationDescriptor_GET_cacheDuration(struct zxmd_md_AffiliationDescriptor_s* x) { return x->cacheDuration; }
/* FUNC(zxmd_md_AffiliationDescriptor_PUT_cacheDuration) */
void zxmd_md_AffiliationDescriptor_PUT_cacheDuration(struct zxmd_md_AffiliationDescriptor_s* x, struct zx_str_s* y) { x->cacheDuration = y; }
/* FUNC(zxmd_md_AffiliationDescriptor_GET_ID) */
struct zx_str_s* zxmd_md_AffiliationDescriptor_GET_ID(struct zxmd_md_AffiliationDescriptor_s* x) { return x->ID; }
/* FUNC(zxmd_md_AffiliationDescriptor_PUT_ID) */
void zxmd_md_AffiliationDescriptor_PUT_ID(struct zxmd_md_AffiliationDescriptor_s* x, struct zx_str_s* y) { x->ID = y; }





/* FUNC(zxmd_md_ArtifactResolutionService_GET_Binding) */
struct zx_str_s* zxmd_md_ArtifactResolutionService_GET_Binding(struct zxmd_md_ArtifactResolutionService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_ArtifactResolutionService_PUT_Binding) */
void zxmd_md_ArtifactResolutionService_PUT_Binding(struct zxmd_md_ArtifactResolutionService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_ArtifactResolutionService_GET_Location) */
struct zx_str_s* zxmd_md_ArtifactResolutionService_GET_Location(struct zxmd_md_ArtifactResolutionService_s* x) { return x->Location; }
/* FUNC(zxmd_md_ArtifactResolutionService_PUT_Location) */
void zxmd_md_ArtifactResolutionService_PUT_Location(struct zxmd_md_ArtifactResolutionService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_ArtifactResolutionService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_ArtifactResolutionService_GET_ResponseLocation(struct zxmd_md_ArtifactResolutionService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_ArtifactResolutionService_PUT_ResponseLocation) */
void zxmd_md_ArtifactResolutionService_PUT_ResponseLocation(struct zxmd_md_ArtifactResolutionService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }
/* FUNC(zxmd_md_ArtifactResolutionService_GET_index) */
struct zx_str_s* zxmd_md_ArtifactResolutionService_GET_index(struct zxmd_md_ArtifactResolutionService_s* x) { return x->index; }
/* FUNC(zxmd_md_ArtifactResolutionService_PUT_index) */
void zxmd_md_ArtifactResolutionService_PUT_index(struct zxmd_md_ArtifactResolutionService_s* x, struct zx_str_s* y) { x->index = y; }
/* FUNC(zxmd_md_ArtifactResolutionService_GET_isDefault) */
struct zx_str_s* zxmd_md_ArtifactResolutionService_GET_isDefault(struct zxmd_md_ArtifactResolutionService_s* x) { return x->isDefault; }
/* FUNC(zxmd_md_ArtifactResolutionService_PUT_isDefault) */
void zxmd_md_ArtifactResolutionService_PUT_isDefault(struct zxmd_md_ArtifactResolutionService_s* x, struct zx_str_s* y) { x->isDefault = y; }





/* FUNC(zxmd_md_AssertionConsumerService_GET_Binding) */
struct zx_str_s* zxmd_md_AssertionConsumerService_GET_Binding(struct zxmd_md_AssertionConsumerService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_AssertionConsumerService_PUT_Binding) */
void zxmd_md_AssertionConsumerService_PUT_Binding(struct zxmd_md_AssertionConsumerService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_AssertionConsumerService_GET_Location) */
struct zx_str_s* zxmd_md_AssertionConsumerService_GET_Location(struct zxmd_md_AssertionConsumerService_s* x) { return x->Location; }
/* FUNC(zxmd_md_AssertionConsumerService_PUT_Location) */
void zxmd_md_AssertionConsumerService_PUT_Location(struct zxmd_md_AssertionConsumerService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_AssertionConsumerService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_AssertionConsumerService_GET_ResponseLocation(struct zxmd_md_AssertionConsumerService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_AssertionConsumerService_PUT_ResponseLocation) */
void zxmd_md_AssertionConsumerService_PUT_ResponseLocation(struct zxmd_md_AssertionConsumerService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }
/* FUNC(zxmd_md_AssertionConsumerService_GET_index) */
struct zx_str_s* zxmd_md_AssertionConsumerService_GET_index(struct zxmd_md_AssertionConsumerService_s* x) { return x->index; }
/* FUNC(zxmd_md_AssertionConsumerService_PUT_index) */
void zxmd_md_AssertionConsumerService_PUT_index(struct zxmd_md_AssertionConsumerService_s* x, struct zx_str_s* y) { x->index = y; }
/* FUNC(zxmd_md_AssertionConsumerService_GET_isDefault) */
struct zx_str_s* zxmd_md_AssertionConsumerService_GET_isDefault(struct zxmd_md_AssertionConsumerService_s* x) { return x->isDefault; }
/* FUNC(zxmd_md_AssertionConsumerService_PUT_isDefault) */
void zxmd_md_AssertionConsumerService_PUT_isDefault(struct zxmd_md_AssertionConsumerService_s* x, struct zx_str_s* y) { x->isDefault = y; }





/* FUNC(zxmd_md_AssertionIDRequestService_GET_Binding) */
struct zx_str_s* zxmd_md_AssertionIDRequestService_GET_Binding(struct zxmd_md_AssertionIDRequestService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_AssertionIDRequestService_PUT_Binding) */
void zxmd_md_AssertionIDRequestService_PUT_Binding(struct zxmd_md_AssertionIDRequestService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_AssertionIDRequestService_GET_Location) */
struct zx_str_s* zxmd_md_AssertionIDRequestService_GET_Location(struct zxmd_md_AssertionIDRequestService_s* x) { return x->Location; }
/* FUNC(zxmd_md_AssertionIDRequestService_PUT_Location) */
void zxmd_md_AssertionIDRequestService_PUT_Location(struct zxmd_md_AssertionIDRequestService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_AssertionIDRequestService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_AssertionIDRequestService_GET_ResponseLocation(struct zxmd_md_AssertionIDRequestService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_AssertionIDRequestService_PUT_ResponseLocation) */
void zxmd_md_AssertionIDRequestService_PUT_ResponseLocation(struct zxmd_md_AssertionIDRequestService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }







/* FUNC(zxmd_md_AttributeAuthorityDescriptor_NUM_Signature) */

int zxmd_md_AttributeAuthorityDescriptor_NUM_Signature(struct zxmd_md_AttributeAuthorityDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Signature; y; ++n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_GET_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_AttributeAuthorityDescriptor_GET_Signature(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  for (y = x->Signature; n>=0 && y; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return y;
}

