gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_AttributeAuthorityDescriptor_GET_NameIDFormat) */

struct zx_elem_s* zxmd_md_AttributeAuthorityDescriptor_GET_NameIDFormat(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->NameIDFormat; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_POP_NameIDFormat) */

struct zx_elem_s* zxmd_md_AttributeAuthorityDescriptor_POP_NameIDFormat(struct zxmd_md_AttributeAuthorityDescriptor_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->NameIDFormat;
  if (y)
    x->NameIDFormat = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_PUSH_NameIDFormat) */

void zxmd_md_AttributeAuthorityDescriptor_PUSH_NameIDFormat(struct zxmd_md_AttributeAuthorityDescriptor_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->NameIDFormat->g;
  x->NameIDFormat = z;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_REV_NameIDFormat) */

void zxmd_md_AttributeAuthorityDescriptor_REV_NameIDFormat(struct zxmd_md_AttributeAuthorityDescriptor_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->NameIDFormat;
  if (!y) return;
  x->NameIDFormat = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_PUT_NameIDFormat) */

void zxmd_md_AttributeAuthorityDescriptor_PUT_NameIDFormat(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->NameIDFormat;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->NameIDFormat = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_ADD_NameIDFormat) */

void zxmd_md_AttributeAuthorityDescriptor_ADD_NameIDFormat(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = z;
    return;
  case -1:
    y = x->NameIDFormat;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_DEL_NameIDFormat) */

void zxmd_md_AttributeAuthorityDescriptor_DEL_NameIDFormat(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->NameIDFormat = (struct zx_elem_s*)x->NameIDFormat->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->NameIDFormat;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_md_AttributeAuthorityDescriptor_NUM_AttributeProfile) */

int zxmd_md_AttributeAuthorityDescriptor_NUM_AttributeProfile(struct zxmd_md_AttributeAuthorityDescriptor_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AttributeProfile; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_GET_AttributeProfile) */

struct zx_elem_s* zxmd_md_AttributeAuthorityDescriptor_GET_AttributeProfile(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->AttributeProfile; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_POP_AttributeProfile) */

struct zx_elem_s* zxmd_md_AttributeAuthorityDescriptor_POP_AttributeProfile(struct zxmd_md_AttributeAuthorityDescriptor_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->AttributeProfile;
  if (y)
    x->AttributeProfile = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_PUSH_AttributeProfile) */

void zxmd_md_AttributeAuthorityDescriptor_PUSH_AttributeProfile(struct zxmd_md_AttributeAuthorityDescriptor_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->AttributeProfile->g;
  x->AttributeProfile = z;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_REV_AttributeProfile) */

void zxmd_md_AttributeAuthorityDescriptor_REV_AttributeProfile(struct zxmd_md_AttributeAuthorityDescriptor_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->AttributeProfile;
  if (!y) return;
  x->AttributeProfile = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->AttributeProfile->g;
    x->AttributeProfile = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_PUT_AttributeProfile) */

void zxmd_md_AttributeAuthorityDescriptor_PUT_AttributeProfile(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->AttributeProfile;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->AttributeProfile = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_ADD_AttributeProfile) */

void zxmd_md_AttributeAuthorityDescriptor_ADD_AttributeProfile(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->AttributeProfile->g;
    x->AttributeProfile = z;
    return;
  case -1:
    y = x->AttributeProfile;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AttributeProfile; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_DEL_AttributeProfile) */

