gitpan/zxid/c/saml2md-getput.c
void zxmd_md_AttributeAuthorityDescriptor_DEL_AttributeProfile(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AttributeProfile = (struct zx_elem_s*)x->AttributeProfile->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->AttributeProfile;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AttributeProfile; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_md_AttributeAuthorityDescriptor_NUM_Attribute) */

int zxmd_md_AttributeAuthorityDescriptor_NUM_Attribute(struct zxmd_md_AttributeAuthorityDescriptor_s* x)
{
  struct zxmd_sa_Attribute_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Attribute; y; ++n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_GET_Attribute) */

struct zxmd_sa_Attribute_s* zxmd_md_AttributeAuthorityDescriptor_GET_Attribute(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x) return 0;
  for (y = x->Attribute; n>=0 && y; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_POP_Attribute) */

struct zxmd_sa_Attribute_s* zxmd_md_AttributeAuthorityDescriptor_POP_Attribute(struct zxmd_md_AttributeAuthorityDescriptor_s* x)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x) return 0;
  y = x->Attribute;
  if (y)
    x->Attribute = (struct zxmd_sa_Attribute_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_PUSH_Attribute) */

void zxmd_md_AttributeAuthorityDescriptor_PUSH_Attribute(struct zxmd_md_AttributeAuthorityDescriptor_s* x, struct zxmd_sa_Attribute_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Attribute->gg.g;
  x->Attribute = z;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_REV_Attribute) */

void zxmd_md_AttributeAuthorityDescriptor_REV_Attribute(struct zxmd_md_AttributeAuthorityDescriptor_s* x)
{
  struct zxmd_sa_Attribute_s* nxt;
  struct zxmd_sa_Attribute_s* y;
  if (!x) return;
  y = x->Attribute;
  if (!y) return;
  x->Attribute = 0;
  while (y) {
    nxt = (struct zxmd_sa_Attribute_s*)y->gg.g.n;
    y->gg.g.n = &x->Attribute->gg.g;
    x->Attribute = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_PUT_Attribute) */

void zxmd_md_AttributeAuthorityDescriptor_PUT_Attribute(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n, struct zxmd_sa_Attribute_s* z)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x || !z) return;
  y = x->Attribute;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Attribute = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_ADD_Attribute) */

void zxmd_md_AttributeAuthorityDescriptor_ADD_Attribute(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n, struct zxmd_sa_Attribute_s* z)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Attribute->gg.g;
    x->Attribute = z;
    return;
  case -1:
    y = x->Attribute;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Attribute; n > 1 && y; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AttributeAuthorityDescriptor_DEL_Attribute) */

void zxmd_md_AttributeAuthorityDescriptor_DEL_Attribute(struct zxmd_md_AttributeAuthorityDescriptor_s* x, int n)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Attribute = (struct zxmd_sa_Attribute_s*)x->Attribute->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_Attribute_s*)x->Attribute;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Attribute; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zxmd_md_AttributeConsumingService_NUM_ServiceName) */

int zxmd_md_AttributeConsumingService_NUM_ServiceName(struct zxmd_md_AttributeConsumingService_s* x)
{
  struct zxmd_md_ServiceName_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ServiceName; y; ++n, y = (struct zxmd_md_ServiceName_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AttributeConsumingService_GET_ServiceName) */

struct zxmd_md_ServiceName_s* zxmd_md_AttributeConsumingService_GET_ServiceName(struct zxmd_md_AttributeConsumingService_s* x, int n)
{
  struct zxmd_md_ServiceName_s* y;
  if (!x) return 0;
  for (y = x->ServiceName; n>=0 && y; --n, y = (struct zxmd_md_ServiceName_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AttributeConsumingService_POP_ServiceName) */

struct zxmd_md_ServiceName_s* zxmd_md_AttributeConsumingService_POP_ServiceName(struct zxmd_md_AttributeConsumingService_s* x)
{
  struct zxmd_md_ServiceName_s* y;
  if (!x) return 0;
  y = x->ServiceName;
  if (y)
    x->ServiceName = (struct zxmd_md_ServiceName_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AttributeConsumingService_PUSH_ServiceName) */

void zxmd_md_AttributeConsumingService_PUSH_ServiceName(struct zxmd_md_AttributeConsumingService_s* x, struct zxmd_md_ServiceName_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ServiceName->gg.g;
  x->ServiceName = z;
}

/* FUNC(zxmd_md_AttributeConsumingService_REV_ServiceName) */

void zxmd_md_AttributeConsumingService_REV_ServiceName(struct zxmd_md_AttributeConsumingService_s* x)
{
  struct zxmd_md_ServiceName_s* nxt;
  struct zxmd_md_ServiceName_s* y;
  if (!x) return;
  y = x->ServiceName;
  if (!y) return;
  x->ServiceName = 0;
  while (y) {
    nxt = (struct zxmd_md_ServiceName_s*)y->gg.g.n;
    y->gg.g.n = &x->ServiceName->gg.g;
    x->ServiceName = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AttributeConsumingService_PUT_ServiceName) */

void zxmd_md_AttributeConsumingService_PUT_ServiceName(struct zxmd_md_AttributeConsumingService_s* x, int n, struct zxmd_md_ServiceName_s* z)
{
  struct zxmd_md_ServiceName_s* y;
  if (!x || !z) return;
  y = x->ServiceName;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ServiceName = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ServiceName_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AttributeConsumingService_ADD_ServiceName) */

void zxmd_md_AttributeConsumingService_ADD_ServiceName(struct zxmd_md_AttributeConsumingService_s* x, int n, struct zxmd_md_ServiceName_s* z)
{
  struct zxmd_md_ServiceName_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ServiceName->gg.g;
    x->ServiceName = z;
    return;
  case -1:
    y = x->ServiceName;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_ServiceName_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ServiceName; n > 1 && y; --n, y = (struct zxmd_md_ServiceName_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AttributeConsumingService_DEL_ServiceName) */

