gitpan/zxid/c/saml2md-getput.c
void zxmd_md_AttributeConsumingService_DEL_ServiceName(struct zxmd_md_AttributeConsumingService_s* x, int n)
{
  struct zxmd_md_ServiceName_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ServiceName = (struct zxmd_md_ServiceName_s*)x->ServiceName->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_ServiceName_s*)x->ServiceName;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_ServiceName_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ServiceName; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ServiceName_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_AttributeConsumingService_NUM_ServiceDescription) */

int zxmd_md_AttributeConsumingService_NUM_ServiceDescription(struct zxmd_md_AttributeConsumingService_s* x)
{
  struct zxmd_md_ServiceDescription_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ServiceDescription; y; ++n, y = (struct zxmd_md_ServiceDescription_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AttributeConsumingService_GET_ServiceDescription) */

struct zxmd_md_ServiceDescription_s* zxmd_md_AttributeConsumingService_GET_ServiceDescription(struct zxmd_md_AttributeConsumingService_s* x, int n)
{
  struct zxmd_md_ServiceDescription_s* y;
  if (!x) return 0;
  for (y = x->ServiceDescription; n>=0 && y; --n, y = (struct zxmd_md_ServiceDescription_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AttributeConsumingService_POP_ServiceDescription) */

struct zxmd_md_ServiceDescription_s* zxmd_md_AttributeConsumingService_POP_ServiceDescription(struct zxmd_md_AttributeConsumingService_s* x)
{
  struct zxmd_md_ServiceDescription_s* y;
  if (!x) return 0;
  y = x->ServiceDescription;
  if (y)
    x->ServiceDescription = (struct zxmd_md_ServiceDescription_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AttributeConsumingService_PUSH_ServiceDescription) */

void zxmd_md_AttributeConsumingService_PUSH_ServiceDescription(struct zxmd_md_AttributeConsumingService_s* x, struct zxmd_md_ServiceDescription_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ServiceDescription->gg.g;
  x->ServiceDescription = z;
}

/* FUNC(zxmd_md_AttributeConsumingService_REV_ServiceDescription) */

void zxmd_md_AttributeConsumingService_REV_ServiceDescription(struct zxmd_md_AttributeConsumingService_s* x)
{
  struct zxmd_md_ServiceDescription_s* nxt;
  struct zxmd_md_ServiceDescription_s* y;
  if (!x) return;
  y = x->ServiceDescription;
  if (!y) return;
  x->ServiceDescription = 0;
  while (y) {
    nxt = (struct zxmd_md_ServiceDescription_s*)y->gg.g.n;
    y->gg.g.n = &x->ServiceDescription->gg.g;
    x->ServiceDescription = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AttributeConsumingService_PUT_ServiceDescription) */

void zxmd_md_AttributeConsumingService_PUT_ServiceDescription(struct zxmd_md_AttributeConsumingService_s* x, int n, struct zxmd_md_ServiceDescription_s* z)
{
  struct zxmd_md_ServiceDescription_s* y;
  if (!x || !z) return;
  y = x->ServiceDescription;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ServiceDescription = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ServiceDescription_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AttributeConsumingService_ADD_ServiceDescription) */

void zxmd_md_AttributeConsumingService_ADD_ServiceDescription(struct zxmd_md_AttributeConsumingService_s* x, int n, struct zxmd_md_ServiceDescription_s* z)
{
  struct zxmd_md_ServiceDescription_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ServiceDescription->gg.g;
    x->ServiceDescription = z;
    return;
  case -1:
    y = x->ServiceDescription;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_ServiceDescription_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ServiceDescription; n > 1 && y; --n, y = (struct zxmd_md_ServiceDescription_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AttributeConsumingService_DEL_ServiceDescription) */

void zxmd_md_AttributeConsumingService_DEL_ServiceDescription(struct zxmd_md_AttributeConsumingService_s* x, int n)
{
  struct zxmd_md_ServiceDescription_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ServiceDescription = (struct zxmd_md_ServiceDescription_s*)x->ServiceDescription->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_ServiceDescription_s*)x->ServiceDescription;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_ServiceDescription_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ServiceDescription; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ServiceDescription_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_AttributeConsumingService_NUM_RequestedAttribute) */

int zxmd_md_AttributeConsumingService_NUM_RequestedAttribute(struct zxmd_md_AttributeConsumingService_s* x)
{
  struct zxmd_md_RequestedAttribute_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->RequestedAttribute; y; ++n, y = (struct zxmd_md_RequestedAttribute_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AttributeConsumingService_GET_RequestedAttribute) */

struct zxmd_md_RequestedAttribute_s* zxmd_md_AttributeConsumingService_GET_RequestedAttribute(struct zxmd_md_AttributeConsumingService_s* x, int n)
{
  struct zxmd_md_RequestedAttribute_s* y;
  if (!x) return 0;
  for (y = x->RequestedAttribute; n>=0 && y; --n, y = (struct zxmd_md_RequestedAttribute_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AttributeConsumingService_POP_RequestedAttribute) */

struct zxmd_md_RequestedAttribute_s* zxmd_md_AttributeConsumingService_POP_RequestedAttribute(struct zxmd_md_AttributeConsumingService_s* x)
{
  struct zxmd_md_RequestedAttribute_s* y;
  if (!x) return 0;
  y = x->RequestedAttribute;
  if (y)
    x->RequestedAttribute = (struct zxmd_md_RequestedAttribute_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AttributeConsumingService_PUSH_RequestedAttribute) */

