gitpan/zxid/c/saml2md-getput.c
void zxmd_md_AttributeConsumingService_PUSH_RequestedAttribute(struct zxmd_md_AttributeConsumingService_s* x, struct zxmd_md_RequestedAttribute_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->RequestedAttribute->gg.g;
  x->RequestedAttribute = z;
}

/* FUNC(zxmd_md_AttributeConsumingService_REV_RequestedAttribute) */

void zxmd_md_AttributeConsumingService_REV_RequestedAttribute(struct zxmd_md_AttributeConsumingService_s* x)
{
  struct zxmd_md_RequestedAttribute_s* nxt;
  struct zxmd_md_RequestedAttribute_s* y;
  if (!x) return;
  y = x->RequestedAttribute;
  if (!y) return;
  x->RequestedAttribute = 0;
  while (y) {
    nxt = (struct zxmd_md_RequestedAttribute_s*)y->gg.g.n;
    y->gg.g.n = &x->RequestedAttribute->gg.g;
    x->RequestedAttribute = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AttributeConsumingService_PUT_RequestedAttribute) */

void zxmd_md_AttributeConsumingService_PUT_RequestedAttribute(struct zxmd_md_AttributeConsumingService_s* x, int n, struct zxmd_md_RequestedAttribute_s* z)
{
  struct zxmd_md_RequestedAttribute_s* y;
  if (!x || !z) return;
  y = x->RequestedAttribute;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->RequestedAttribute = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_RequestedAttribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AttributeConsumingService_ADD_RequestedAttribute) */

void zxmd_md_AttributeConsumingService_ADD_RequestedAttribute(struct zxmd_md_AttributeConsumingService_s* x, int n, struct zxmd_md_RequestedAttribute_s* z)
{
  struct zxmd_md_RequestedAttribute_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->RequestedAttribute->gg.g;
    x->RequestedAttribute = z;
    return;
  case -1:
    y = x->RequestedAttribute;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_RequestedAttribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->RequestedAttribute; n > 1 && y; --n, y = (struct zxmd_md_RequestedAttribute_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AttributeConsumingService_DEL_RequestedAttribute) */

void zxmd_md_AttributeConsumingService_DEL_RequestedAttribute(struct zxmd_md_AttributeConsumingService_s* x, int n)
{
  struct zxmd_md_RequestedAttribute_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->RequestedAttribute = (struct zxmd_md_RequestedAttribute_s*)x->RequestedAttribute->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_RequestedAttribute_s*)x->RequestedAttribute;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_RequestedAttribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->RequestedAttribute; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_RequestedAttribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_md_AttributeConsumingService_GET_index) */
struct zx_str_s* zxmd_md_AttributeConsumingService_GET_index(struct zxmd_md_AttributeConsumingService_s* x) { return x->index; }
/* FUNC(zxmd_md_AttributeConsumingService_PUT_index) */
void zxmd_md_AttributeConsumingService_PUT_index(struct zxmd_md_AttributeConsumingService_s* x, struct zx_str_s* y) { x->index = y; }
/* FUNC(zxmd_md_AttributeConsumingService_GET_isDefault) */
struct zx_str_s* zxmd_md_AttributeConsumingService_GET_isDefault(struct zxmd_md_AttributeConsumingService_s* x) { return x->isDefault; }
/* FUNC(zxmd_md_AttributeConsumingService_PUT_isDefault) */
void zxmd_md_AttributeConsumingService_PUT_isDefault(struct zxmd_md_AttributeConsumingService_s* x, struct zx_str_s* y) { x->isDefault = y; }





/* FUNC(zxmd_md_AttributeService_GET_Binding) */
struct zx_str_s* zxmd_md_AttributeService_GET_Binding(struct zxmd_md_AttributeService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_AttributeService_PUT_Binding) */
void zxmd_md_AttributeService_PUT_Binding(struct zxmd_md_AttributeService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_AttributeService_GET_Location) */
struct zx_str_s* zxmd_md_AttributeService_GET_Location(struct zxmd_md_AttributeService_s* x) { return x->Location; }
/* FUNC(zxmd_md_AttributeService_PUT_Location) */
void zxmd_md_AttributeService_PUT_Location(struct zxmd_md_AttributeService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_AttributeService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_AttributeService_GET_ResponseLocation(struct zxmd_md_AttributeService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_AttributeService_PUT_ResponseLocation) */
void zxmd_md_AttributeService_PUT_ResponseLocation(struct zxmd_md_AttributeService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }







/* FUNC(zxmd_md_AuthnAuthorityDescriptor_NUM_Signature) */

int zxmd_md_AuthnAuthorityDescriptor_NUM_Signature(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Signature; y; ++n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_AuthnAuthorityDescriptor_GET_Signature(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  for (y = x->Signature; n>=0 && y; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_POP_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_AuthnAuthorityDescriptor_POP_Signature(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  y = x->Signature;
  if (y)
    x->Signature = (struct zxmd_ds_Signature_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUSH_Signature) */

void zxmd_md_AuthnAuthorityDescriptor_PUSH_Signature(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zxmd_ds_Signature_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Signature->gg.g;
  x->Signature = z;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_REV_Signature) */

void zxmd_md_AuthnAuthorityDescriptor_REV_Signature(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* nxt;
  struct zxmd_ds_Signature_s* y;
  if (!x) return;
  y = x->Signature;
  if (!y) return;
  x->Signature = 0;
  while (y) {
    nxt = (struct zxmd_ds_Signature_s*)y->gg.g.n;
    y->gg.g.n = &x->Signature->gg.g;
    x->Signature = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_Signature) */

void zxmd_md_AuthnAuthorityDescriptor_PUT_Signature(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_ds_Signature_s* z)
{
  struct zxmd_ds_Signature_s* y;
  if (!x || !z) return;
  y = x->Signature;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Signature = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

