gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUSH_KeyDescriptor) */

void zxmd_md_AuthnAuthorityDescriptor_PUSH_KeyDescriptor(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zxmd_md_KeyDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->KeyDescriptor->gg.g;
  x->KeyDescriptor = z;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_REV_KeyDescriptor) */

void zxmd_md_AuthnAuthorityDescriptor_REV_KeyDescriptor(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_KeyDescriptor_s* nxt;
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x) return;
  y = x->KeyDescriptor;
  if (!y) return;
  x->KeyDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->KeyDescriptor->gg.g;
    x->KeyDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_KeyDescriptor) */

void zxmd_md_AuthnAuthorityDescriptor_PUT_KeyDescriptor(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_KeyDescriptor_s* z)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x || !z) return;
  y = x->KeyDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->KeyDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_ADD_KeyDescriptor) */

void zxmd_md_AuthnAuthorityDescriptor_ADD_KeyDescriptor(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_KeyDescriptor_s* z)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->KeyDescriptor->gg.g;
    x->KeyDescriptor = z;
    return;
  case -1:
    y = x->KeyDescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyDescriptor; n > 1 && y; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_DEL_KeyDescriptor) */

void zxmd_md_AuthnAuthorityDescriptor_DEL_KeyDescriptor(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyDescriptor = (struct zxmd_md_KeyDescriptor_s*)x->KeyDescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_KeyDescriptor_s*)x->KeyDescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyDescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_AuthnAuthorityDescriptor_NUM_Organization) */

int zxmd_md_AuthnAuthorityDescriptor_NUM_Organization(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_Organization_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Organization; y; ++n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_Organization) */

struct zxmd_md_Organization_s* zxmd_md_AuthnAuthorityDescriptor_GET_Organization(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_md_Organization_s* y;
  if (!x) return 0;
  for (y = x->Organization; n>=0 && y; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_POP_Organization) */

struct zxmd_md_Organization_s* zxmd_md_AuthnAuthorityDescriptor_POP_Organization(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_Organization_s* y;
  if (!x) return 0;
  y = x->Organization;
  if (y)
    x->Organization = (struct zxmd_md_Organization_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUSH_Organization) */

void zxmd_md_AuthnAuthorityDescriptor_PUSH_Organization(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zxmd_md_Organization_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Organization->gg.g;
  x->Organization = z;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_REV_Organization) */

void zxmd_md_AuthnAuthorityDescriptor_REV_Organization(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_Organization_s* nxt;
  struct zxmd_md_Organization_s* y;
  if (!x) return;
  y = x->Organization;
  if (!y) return;
  x->Organization = 0;
  while (y) {
    nxt = (struct zxmd_md_Organization_s*)y->gg.g.n;
    y->gg.g.n = &x->Organization->gg.g;
    x->Organization = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_Organization) */

void zxmd_md_AuthnAuthorityDescriptor_PUT_Organization(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_Organization_s* z)
{
  struct zxmd_md_Organization_s* y;
  if (!x || !z) return;
  y = x->Organization;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Organization = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_ADD_Organization) */

void zxmd_md_AuthnAuthorityDescriptor_ADD_Organization(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_Organization_s* z)
{
  struct zxmd_md_Organization_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Organization->gg.g;
    x->Organization = z;
    return;
  case -1:
    y = x->Organization;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Organization; n > 1 && y; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_DEL_Organization) */

void zxmd_md_AuthnAuthorityDescriptor_DEL_Organization(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_md_Organization_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Organization = (struct zxmd_md_Organization_s*)x->Organization->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_Organization_s*)x->Organization;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Organization; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_AuthnAuthorityDescriptor_NUM_ContactPerson) */

