gitpan/zxid/c/saml2md-getput.c
int zxmd_md_AuthnAuthorityDescriptor_NUM_ContactPerson(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_ContactPerson_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ContactPerson; y; ++n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_ContactPerson) */

struct zxmd_md_ContactPerson_s* zxmd_md_AuthnAuthorityDescriptor_GET_ContactPerson(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return 0;
  for (y = x->ContactPerson; n>=0 && y; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_POP_ContactPerson) */

struct zxmd_md_ContactPerson_s* zxmd_md_AuthnAuthorityDescriptor_POP_ContactPerson(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return 0;
  y = x->ContactPerson;
  if (y)
    x->ContactPerson = (struct zxmd_md_ContactPerson_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUSH_ContactPerson) */

void zxmd_md_AuthnAuthorityDescriptor_PUSH_ContactPerson(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zxmd_md_ContactPerson_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ContactPerson->gg.g;
  x->ContactPerson = z;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_REV_ContactPerson) */

void zxmd_md_AuthnAuthorityDescriptor_REV_ContactPerson(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_ContactPerson_s* nxt;
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return;
  y = x->ContactPerson;
  if (!y) return;
  x->ContactPerson = 0;
  while (y) {
    nxt = (struct zxmd_md_ContactPerson_s*)y->gg.g.n;
    y->gg.g.n = &x->ContactPerson->gg.g;
    x->ContactPerson = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_ContactPerson) */

void zxmd_md_AuthnAuthorityDescriptor_PUT_ContactPerson(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_ContactPerson_s* z)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x || !z) return;
  y = x->ContactPerson;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ContactPerson = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_ADD_ContactPerson) */

void zxmd_md_AuthnAuthorityDescriptor_ADD_ContactPerson(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_ContactPerson_s* z)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ContactPerson->gg.g;
    x->ContactPerson = z;
    return;
  case -1:
    y = x->ContactPerson;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ContactPerson; n > 1 && y; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_DEL_ContactPerson) */

void zxmd_md_AuthnAuthorityDescriptor_DEL_ContactPerson(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ContactPerson = (struct zxmd_md_ContactPerson_s*)x->ContactPerson->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_ContactPerson_s*)x->ContactPerson;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ContactPerson; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_ID) */
struct zx_str_s* zxmd_md_AuthnAuthorityDescriptor_GET_ID(struct zxmd_md_AuthnAuthorityDescriptor_s* x) { return x->ID; }
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_ID) */
void zxmd_md_AuthnAuthorityDescriptor_PUT_ID(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zx_str_s* y) { x->ID = y; }
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_validUntil) */
struct zx_str_s* zxmd_md_AuthnAuthorityDescriptor_GET_validUntil(struct zxmd_md_AuthnAuthorityDescriptor_s* x) { return x->validUntil; }
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_validUntil) */
void zxmd_md_AuthnAuthorityDescriptor_PUT_validUntil(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zx_str_s* y) { x->validUntil = y; }
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_cacheDuration) */
struct zx_str_s* zxmd_md_AuthnAuthorityDescriptor_GET_cacheDuration(struct zxmd_md_AuthnAuthorityDescriptor_s* x) { return x->cacheDuration; }
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_cacheDuration) */
void zxmd_md_AuthnAuthorityDescriptor_PUT_cacheDuration(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zx_str_s* y) { x->cacheDuration = y; }
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_protocolSupportEnumeration) */
struct zx_str_s* zxmd_md_AuthnAuthorityDescriptor_GET_protocolSupportEnumeration(struct zxmd_md_AuthnAuthorityDescriptor_s* x) { return x->protocolSupportEnumeration; }
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_protocolSupportEnumeration) */
void zxmd_md_AuthnAuthorityDescriptor_PUT_protocolSupportEnumeration(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zx_str_s* y) { x->protocolSupportEnumeration = y; }
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_errorURL) */
struct zx_str_s* zxmd_md_AuthnAuthorityDescriptor_GET_errorURL(struct zxmd_md_AuthnAuthorityDescriptor_s* x) { return x->errorURL; }
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_errorURL) */
void zxmd_md_AuthnAuthorityDescriptor_PUT_errorURL(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zx_str_s* y) { x->errorURL = y; }


/* FUNC(zxmd_md_AuthnAuthorityDescriptor_NUM_AuthnQueryService) */

int zxmd_md_AuthnAuthorityDescriptor_NUM_AuthnQueryService(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_AuthnQueryService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AuthnQueryService; y; ++n, y = (struct zxmd_md_AuthnQueryService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_AuthnQueryService) */

struct zxmd_md_AuthnQueryService_s* zxmd_md_AuthnAuthorityDescriptor_GET_AuthnQueryService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_md_AuthnQueryService_s* y;
  if (!x) return 0;
  for (y = x->AuthnQueryService; n>=0 && y; --n, y = (struct zxmd_md_AuthnQueryService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_POP_AuthnQueryService) */

struct zxmd_md_AuthnQueryService_s* zxmd_md_AuthnAuthorityDescriptor_POP_AuthnQueryService(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_AuthnQueryService_s* y;
  if (!x) return 0;
  y = x->AuthnQueryService;
  if (y)
    x->AuthnQueryService = (struct zxmd_md_AuthnQueryService_s*)y->gg.g.n;
  return y;
}

