gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUSH_AuthnQueryService) */

void zxmd_md_AuthnAuthorityDescriptor_PUSH_AuthnQueryService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zxmd_md_AuthnQueryService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AuthnQueryService->gg.g;
  x->AuthnQueryService = z;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_REV_AuthnQueryService) */

void zxmd_md_AuthnAuthorityDescriptor_REV_AuthnQueryService(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_AuthnQueryService_s* nxt;
  struct zxmd_md_AuthnQueryService_s* y;
  if (!x) return;
  y = x->AuthnQueryService;
  if (!y) return;
  x->AuthnQueryService = 0;
  while (y) {
    nxt = (struct zxmd_md_AuthnQueryService_s*)y->gg.g.n;
    y->gg.g.n = &x->AuthnQueryService->gg.g;
    x->AuthnQueryService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_AuthnQueryService) */

void zxmd_md_AuthnAuthorityDescriptor_PUT_AuthnQueryService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_AuthnQueryService_s* z)
{
  struct zxmd_md_AuthnQueryService_s* y;
  if (!x || !z) return;
  y = x->AuthnQueryService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AuthnQueryService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AuthnQueryService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_ADD_AuthnQueryService) */

void zxmd_md_AuthnAuthorityDescriptor_ADD_AuthnQueryService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_AuthnQueryService_s* z)
{
  struct zxmd_md_AuthnQueryService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AuthnQueryService->gg.g;
    x->AuthnQueryService = z;
    return;
  case -1:
    y = x->AuthnQueryService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AuthnQueryService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthnQueryService; n > 1 && y; --n, y = (struct zxmd_md_AuthnQueryService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_DEL_AuthnQueryService) */

void zxmd_md_AuthnAuthorityDescriptor_DEL_AuthnQueryService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_md_AuthnQueryService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AuthnQueryService = (struct zxmd_md_AuthnQueryService_s*)x->AuthnQueryService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AuthnQueryService_s*)x->AuthnQueryService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AuthnQueryService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthnQueryService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AuthnQueryService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_AuthnAuthorityDescriptor_NUM_AssertionIDRequestService) */

int zxmd_md_AuthnAuthorityDescriptor_NUM_AssertionIDRequestService(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AssertionIDRequestService; y; ++n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_AssertionIDRequestService) */

struct zxmd_md_AssertionIDRequestService_s* zxmd_md_AuthnAuthorityDescriptor_GET_AssertionIDRequestService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return 0;
  for (y = x->AssertionIDRequestService; n>=0 && y; --n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_POP_AssertionIDRequestService) */

struct zxmd_md_AssertionIDRequestService_s* zxmd_md_AuthnAuthorityDescriptor_POP_AssertionIDRequestService(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return 0;
  y = x->AssertionIDRequestService;
  if (y)
    x->AssertionIDRequestService = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUSH_AssertionIDRequestService) */

void zxmd_md_AuthnAuthorityDescriptor_PUSH_AssertionIDRequestService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zxmd_md_AssertionIDRequestService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AssertionIDRequestService->gg.g;
  x->AssertionIDRequestService = z;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_REV_AssertionIDRequestService) */

void zxmd_md_AuthnAuthorityDescriptor_REV_AssertionIDRequestService(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zxmd_md_AssertionIDRequestService_s* nxt;
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return;
  y = x->AssertionIDRequestService;
  if (!y) return;
  x->AssertionIDRequestService = 0;
  while (y) {
    nxt = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n;
    y->gg.g.n = &x->AssertionIDRequestService->gg.g;
    x->AssertionIDRequestService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_AssertionIDRequestService) */

void zxmd_md_AuthnAuthorityDescriptor_PUT_AssertionIDRequestService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_AssertionIDRequestService_s* z)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x || !z) return;
  y = x->AssertionIDRequestService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AssertionIDRequestService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_ADD_AssertionIDRequestService) */

void zxmd_md_AuthnAuthorityDescriptor_ADD_AssertionIDRequestService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zxmd_md_AssertionIDRequestService_s* z)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AssertionIDRequestService->gg.g;
    x->AssertionIDRequestService = z;
    return;
  case -1:
    y = x->AssertionIDRequestService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AssertionIDRequestService; n > 1 && y; --n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_DEL_AssertionIDRequestService) */

