gitpan/zxid/c/saml2md-getput.c
void zxmd_md_AuthnAuthorityDescriptor_DEL_AssertionIDRequestService(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AssertionIDRequestService = (struct zxmd_md_AssertionIDRequestService_s*)x->AssertionIDRequestService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AssertionIDRequestService_s*)x->AssertionIDRequestService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AssertionIDRequestService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_AuthnAuthorityDescriptor_NUM_NameIDFormat) */

int zxmd_md_AuthnAuthorityDescriptor_NUM_NameIDFormat(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->NameIDFormat; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_GET_NameIDFormat) */

struct zx_elem_s* zxmd_md_AuthnAuthorityDescriptor_GET_NameIDFormat(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->NameIDFormat; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_POP_NameIDFormat) */

struct zx_elem_s* zxmd_md_AuthnAuthorityDescriptor_POP_NameIDFormat(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->NameIDFormat;
  if (y)
    x->NameIDFormat = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUSH_NameIDFormat) */

void zxmd_md_AuthnAuthorityDescriptor_PUSH_NameIDFormat(struct zxmd_md_AuthnAuthorityDescriptor_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->NameIDFormat->g;
  x->NameIDFormat = z;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_REV_NameIDFormat) */

void zxmd_md_AuthnAuthorityDescriptor_REV_NameIDFormat(struct zxmd_md_AuthnAuthorityDescriptor_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->NameIDFormat;
  if (!y) return;
  x->NameIDFormat = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_PUT_NameIDFormat) */

void zxmd_md_AuthnAuthorityDescriptor_PUT_NameIDFormat(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->NameIDFormat;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->NameIDFormat = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_ADD_NameIDFormat) */

void zxmd_md_AuthnAuthorityDescriptor_ADD_NameIDFormat(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = z;
    return;
  case -1:
    y = x->NameIDFormat;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_AuthnAuthorityDescriptor_DEL_NameIDFormat) */

void zxmd_md_AuthnAuthorityDescriptor_DEL_NameIDFormat(struct zxmd_md_AuthnAuthorityDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->NameIDFormat = (struct zx_elem_s*)x->NameIDFormat->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->NameIDFormat;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}






/* FUNC(zxmd_md_AuthnQueryService_GET_Binding) */
struct zx_str_s* zxmd_md_AuthnQueryService_GET_Binding(struct zxmd_md_AuthnQueryService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_AuthnQueryService_PUT_Binding) */
void zxmd_md_AuthnQueryService_PUT_Binding(struct zxmd_md_AuthnQueryService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_AuthnQueryService_GET_Location) */
struct zx_str_s* zxmd_md_AuthnQueryService_GET_Location(struct zxmd_md_AuthnQueryService_s* x) { return x->Location; }
/* FUNC(zxmd_md_AuthnQueryService_PUT_Location) */
void zxmd_md_AuthnQueryService_PUT_Location(struct zxmd_md_AuthnQueryService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_AuthnQueryService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_AuthnQueryService_GET_ResponseLocation(struct zxmd_md_AuthnQueryService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_AuthnQueryService_PUT_ResponseLocation) */
void zxmd_md_AuthnQueryService_PUT_ResponseLocation(struct zxmd_md_AuthnQueryService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }





/* FUNC(zxmd_md_AuthzService_GET_Binding) */
struct zx_str_s* zxmd_md_AuthzService_GET_Binding(struct zxmd_md_AuthzService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_AuthzService_PUT_Binding) */
void zxmd_md_AuthzService_PUT_Binding(struct zxmd_md_AuthzService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_AuthzService_GET_Location) */
struct zx_str_s* zxmd_md_AuthzService_GET_Location(struct zxmd_md_AuthzService_s* x) { return x->Location; }
/* FUNC(zxmd_md_AuthzService_PUT_Location) */
void zxmd_md_AuthzService_PUT_Location(struct zxmd_md_AuthzService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_AuthzService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_AuthzService_GET_ResponseLocation(struct zxmd_md_AuthzService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_AuthzService_PUT_ResponseLocation) */
void zxmd_md_AuthzService_PUT_ResponseLocation(struct zxmd_md_AuthzService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }







/* FUNC(zxmd_md_ContactPerson_NUM_Extensions) */

