gitpan/zxid/c/saml2md-getput.c
int zxmd_md_ContactPerson_NUM_Extensions(struct zxmd_md_ContactPerson_s* x)
{
  struct zxmd_md_Extensions_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Extensions; y; ++n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_ContactPerson_GET_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_ContactPerson_GET_Extensions(struct zxmd_md_ContactPerson_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  for (y = x->Extensions; n>=0 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_ContactPerson_POP_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_ContactPerson_POP_Extensions(struct zxmd_md_ContactPerson_s* x)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  y = x->Extensions;
  if (y)
    x->Extensions = (struct zxmd_md_Extensions_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_ContactPerson_PUSH_Extensions) */

void zxmd_md_ContactPerson_PUSH_Extensions(struct zxmd_md_ContactPerson_s* x, struct zxmd_md_Extensions_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Extensions->gg.g;
  x->Extensions = z;
}

/* FUNC(zxmd_md_ContactPerson_REV_Extensions) */

void zxmd_md_ContactPerson_REV_Extensions(struct zxmd_md_ContactPerson_s* x)
{
  struct zxmd_md_Extensions_s* nxt;
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  y = x->Extensions;
  if (!y) return;
  x->Extensions = 0;
  while (y) {
    nxt = (struct zxmd_md_Extensions_s*)y->gg.g.n;
    y->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_ContactPerson_PUT_Extensions) */

void zxmd_md_ContactPerson_PUT_Extensions(struct zxmd_md_ContactPerson_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  y = x->Extensions;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Extensions = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_ContactPerson_ADD_Extensions) */

void zxmd_md_ContactPerson_ADD_Extensions(struct zxmd_md_ContactPerson_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = z;
    return;
  case -1:
    y = x->Extensions;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_ContactPerson_DEL_Extensions) */

void zxmd_md_ContactPerson_DEL_Extensions(struct zxmd_md_ContactPerson_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Extensions = (struct zxmd_md_Extensions_s*)x->Extensions->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_Extensions_s*)x->Extensions;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_ContactPerson_NUM_Company) */

int zxmd_md_ContactPerson_NUM_Company(struct zxmd_md_ContactPerson_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Company; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_md_ContactPerson_GET_Company) */

struct zx_elem_s* zxmd_md_ContactPerson_GET_Company(struct zxmd_md_ContactPerson_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Company; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_ContactPerson_POP_Company) */

struct zx_elem_s* zxmd_md_ContactPerson_POP_Company(struct zxmd_md_ContactPerson_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Company;
  if (y)
    x->Company = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_ContactPerson_PUSH_Company) */

void zxmd_md_ContactPerson_PUSH_Company(struct zxmd_md_ContactPerson_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->Company->g;
  x->Company = z;
}

/* FUNC(zxmd_md_ContactPerson_REV_Company) */

void zxmd_md_ContactPerson_REV_Company(struct zxmd_md_ContactPerson_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->Company;
  if (!y) return;
  x->Company = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->Company->g;
    x->Company = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_ContactPerson_PUT_Company) */

void zxmd_md_ContactPerson_PUT_Company(struct zxmd_md_ContactPerson_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->Company;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->Company = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_ContactPerson_ADD_Company) */

void zxmd_md_ContactPerson_ADD_Company(struct zxmd_md_ContactPerson_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Company->g;
    x->Company = z;
    return;
  case -1:
    y = x->Company;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Company; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_ContactPerson_DEL_Company) */

void zxmd_md_ContactPerson_DEL_Company(struct zxmd_md_ContactPerson_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Company = (struct zx_elem_s*)x->Company->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->Company;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Company; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



