gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_EncryptionMethod_PUSH_KeySize) */

void zxmd_md_EncryptionMethod_PUSH_KeySize(struct zxmd_md_EncryptionMethod_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->KeySize->g;
  x->KeySize = z;
}

/* FUNC(zxmd_md_EncryptionMethod_REV_KeySize) */

void zxmd_md_EncryptionMethod_REV_KeySize(struct zxmd_md_EncryptionMethod_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->KeySize;
  if (!y) return;
  x->KeySize = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->KeySize->g;
    x->KeySize = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EncryptionMethod_PUT_KeySize) */

void zxmd_md_EncryptionMethod_PUT_KeySize(struct zxmd_md_EncryptionMethod_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->KeySize;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->KeySize = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_EncryptionMethod_ADD_KeySize) */

void zxmd_md_EncryptionMethod_ADD_KeySize(struct zxmd_md_EncryptionMethod_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->KeySize->g;
    x->KeySize = z;
    return;
  case -1:
    y = x->KeySize;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->KeySize; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_EncryptionMethod_DEL_KeySize) */

void zxmd_md_EncryptionMethod_DEL_KeySize(struct zxmd_md_EncryptionMethod_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeySize = (struct zx_elem_s*)x->KeySize->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->KeySize;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->KeySize; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_md_EncryptionMethod_NUM_OAEPparams) */

int zxmd_md_EncryptionMethod_NUM_OAEPparams(struct zxmd_md_EncryptionMethod_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->OAEPparams; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_md_EncryptionMethod_GET_OAEPparams) */

struct zx_elem_s* zxmd_md_EncryptionMethod_GET_OAEPparams(struct zxmd_md_EncryptionMethod_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->OAEPparams; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_EncryptionMethod_POP_OAEPparams) */

struct zx_elem_s* zxmd_md_EncryptionMethod_POP_OAEPparams(struct zxmd_md_EncryptionMethod_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->OAEPparams;
  if (y)
    x->OAEPparams = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_EncryptionMethod_PUSH_OAEPparams) */

void zxmd_md_EncryptionMethod_PUSH_OAEPparams(struct zxmd_md_EncryptionMethod_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->OAEPparams->g;
  x->OAEPparams = z;
}

/* FUNC(zxmd_md_EncryptionMethod_REV_OAEPparams) */

void zxmd_md_EncryptionMethod_REV_OAEPparams(struct zxmd_md_EncryptionMethod_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->OAEPparams;
  if (!y) return;
  x->OAEPparams = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->OAEPparams->g;
    x->OAEPparams = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EncryptionMethod_PUT_OAEPparams) */

void zxmd_md_EncryptionMethod_PUT_OAEPparams(struct zxmd_md_EncryptionMethod_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->OAEPparams;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->OAEPparams = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_EncryptionMethod_ADD_OAEPparams) */

void zxmd_md_EncryptionMethod_ADD_OAEPparams(struct zxmd_md_EncryptionMethod_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->OAEPparams->g;
    x->OAEPparams = z;
    return;
  case -1:
    y = x->OAEPparams;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->OAEPparams; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_EncryptionMethod_DEL_OAEPparams) */

void zxmd_md_EncryptionMethod_DEL_OAEPparams(struct zxmd_md_EncryptionMethod_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->OAEPparams = (struct zx_elem_s*)x->OAEPparams->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->OAEPparams;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->OAEPparams; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}

/* FUNC(zxmd_md_EncryptionMethod_GET_Algorithm) */
struct zx_str_s* zxmd_md_EncryptionMethod_GET_Algorithm(struct zxmd_md_EncryptionMethod_s* x) { return x->Algorithm; }
/* FUNC(zxmd_md_EncryptionMethod_PUT_Algorithm) */
void zxmd_md_EncryptionMethod_PUT_Algorithm(struct zxmd_md_EncryptionMethod_s* x, struct zx_str_s* y) { x->Algorithm = y; }







/* FUNC(zxmd_md_EntitiesDescriptor_NUM_Signature) */

int zxmd_md_EntitiesDescriptor_NUM_Signature(struct zxmd_md_EntitiesDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Signature; y; ++n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntitiesDescriptor_GET_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_EntitiesDescriptor_GET_Signature(struct zxmd_md_EntitiesDescriptor_s* x, int n)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  for (y = x->Signature; n>=0 && y; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntitiesDescriptor_POP_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_EntitiesDescriptor_POP_Signature(struct zxmd_md_EntitiesDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  y = x->Signature;
  if (y)
    x->Signature = (struct zxmd_ds_Signature_s*)y->gg.g.n;
  return y;
}

