gitpan/zxid/c/saml2md-getput.c
int zxmd_md_EntitiesDescriptor_NUM_EntityDescriptor(struct zxmd_md_EntitiesDescriptor_s* x)
{
  struct zxmd_md_EntityDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EntityDescriptor; y; ++n, y = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntitiesDescriptor_GET_EntityDescriptor) */

struct zxmd_md_EntityDescriptor_s* zxmd_md_EntitiesDescriptor_GET_EntityDescriptor(struct zxmd_md_EntitiesDescriptor_s* x, int n)
{
  struct zxmd_md_EntityDescriptor_s* y;
  if (!x) return 0;
  for (y = x->EntityDescriptor; n>=0 && y; --n, y = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntitiesDescriptor_POP_EntityDescriptor) */

struct zxmd_md_EntityDescriptor_s* zxmd_md_EntitiesDescriptor_POP_EntityDescriptor(struct zxmd_md_EntitiesDescriptor_s* x)
{
  struct zxmd_md_EntityDescriptor_s* y;
  if (!x) return 0;
  y = x->EntityDescriptor;
  if (y)
    x->EntityDescriptor = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntitiesDescriptor_PUSH_EntityDescriptor) */

void zxmd_md_EntitiesDescriptor_PUSH_EntityDescriptor(struct zxmd_md_EntitiesDescriptor_s* x, struct zxmd_md_EntityDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EntityDescriptor->gg.g;
  x->EntityDescriptor = z;
}

/* FUNC(zxmd_md_EntitiesDescriptor_REV_EntityDescriptor) */

void zxmd_md_EntitiesDescriptor_REV_EntityDescriptor(struct zxmd_md_EntitiesDescriptor_s* x)
{
  struct zxmd_md_EntityDescriptor_s* nxt;
  struct zxmd_md_EntityDescriptor_s* y;
  if (!x) return;
  y = x->EntityDescriptor;
  if (!y) return;
  x->EntityDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->EntityDescriptor->gg.g;
    x->EntityDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntitiesDescriptor_PUT_EntityDescriptor) */

void zxmd_md_EntitiesDescriptor_PUT_EntityDescriptor(struct zxmd_md_EntitiesDescriptor_s* x, int n, struct zxmd_md_EntityDescriptor_s* z)
{
  struct zxmd_md_EntityDescriptor_s* y;
  if (!x || !z) return;
  y = x->EntityDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EntityDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntitiesDescriptor_ADD_EntityDescriptor) */

void zxmd_md_EntitiesDescriptor_ADD_EntityDescriptor(struct zxmd_md_EntitiesDescriptor_s* x, int n, struct zxmd_md_EntityDescriptor_s* z)
{
  struct zxmd_md_EntityDescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EntityDescriptor->gg.g;
    x->EntityDescriptor = z;
    return;
  case -1:
    y = x->EntityDescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EntityDescriptor; n > 1 && y; --n, y = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntitiesDescriptor_DEL_EntityDescriptor) */

void zxmd_md_EntitiesDescriptor_DEL_EntityDescriptor(struct zxmd_md_EntitiesDescriptor_s* x, int n)
{
  struct zxmd_md_EntityDescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EntityDescriptor = (struct zxmd_md_EntityDescriptor_s*)x->EntityDescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_EntityDescriptor_s*)x->EntityDescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EntityDescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntitiesDescriptor_NUM_EntitiesDescriptor) */

int zxmd_md_EntitiesDescriptor_NUM_EntitiesDescriptor(struct zxmd_md_EntitiesDescriptor_s* x)
{
  struct zxmd_md_EntitiesDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EntitiesDescriptor; y; ++n, y = (struct zxmd_md_EntitiesDescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntitiesDescriptor_GET_EntitiesDescriptor) */

struct zxmd_md_EntitiesDescriptor_s* zxmd_md_EntitiesDescriptor_GET_EntitiesDescriptor(struct zxmd_md_EntitiesDescriptor_s* x, int n)
{
  struct zxmd_md_EntitiesDescriptor_s* y;
  if (!x) return 0;
  for (y = x->EntitiesDescriptor; n>=0 && y; --n, y = (struct zxmd_md_EntitiesDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntitiesDescriptor_POP_EntitiesDescriptor) */

struct zxmd_md_EntitiesDescriptor_s* zxmd_md_EntitiesDescriptor_POP_EntitiesDescriptor(struct zxmd_md_EntitiesDescriptor_s* x)
{
  struct zxmd_md_EntitiesDescriptor_s* y;
  if (!x) return 0;
  y = x->EntitiesDescriptor;
  if (y)
    x->EntitiesDescriptor = (struct zxmd_md_EntitiesDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntitiesDescriptor_PUSH_EntitiesDescriptor) */

void zxmd_md_EntitiesDescriptor_PUSH_EntitiesDescriptor(struct zxmd_md_EntitiesDescriptor_s* x, struct zxmd_md_EntitiesDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EntitiesDescriptor->gg.g;
  x->EntitiesDescriptor = z;
}

/* FUNC(zxmd_md_EntitiesDescriptor_REV_EntitiesDescriptor) */

void zxmd_md_EntitiesDescriptor_REV_EntitiesDescriptor(struct zxmd_md_EntitiesDescriptor_s* x)
{
  struct zxmd_md_EntitiesDescriptor_s* nxt;
  struct zxmd_md_EntitiesDescriptor_s* y;
  if (!x) return;
  y = x->EntitiesDescriptor;
  if (!y) return;
  x->EntitiesDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_EntitiesDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->EntitiesDescriptor->gg.g;
    x->EntitiesDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntitiesDescriptor_PUT_EntitiesDescriptor) */

void zxmd_md_EntitiesDescriptor_PUT_EntitiesDescriptor(struct zxmd_md_EntitiesDescriptor_s* x, int n, struct zxmd_md_EntitiesDescriptor_s* z)
{
  struct zxmd_md_EntitiesDescriptor_s* y;
  if (!x || !z) return;
  y = x->EntitiesDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EntitiesDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_EntitiesDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

