gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_EntityDescriptor_NUM_Extensions) */

int zxmd_md_EntityDescriptor_NUM_Extensions(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_Extensions_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Extensions; y; ++n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_EntityDescriptor_GET_Extensions(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  for (y = x->Extensions; n>=0 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_EntityDescriptor_POP_Extensions(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  y = x->Extensions;
  if (y)
    x->Extensions = (struct zxmd_md_Extensions_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_Extensions) */

void zxmd_md_EntityDescriptor_PUSH_Extensions(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_Extensions_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Extensions->gg.g;
  x->Extensions = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_Extensions) */

void zxmd_md_EntityDescriptor_REV_Extensions(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_Extensions_s* nxt;
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  y = x->Extensions;
  if (!y) return;
  x->Extensions = 0;
  while (y) {
    nxt = (struct zxmd_md_Extensions_s*)y->gg.g.n;
    y->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_Extensions) */

void zxmd_md_EntityDescriptor_PUT_Extensions(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  y = x->Extensions;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Extensions = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_Extensions) */

void zxmd_md_EntityDescriptor_ADD_Extensions(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = z;
    return;
  case -1:
    y = x->Extensions;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_Extensions) */

void zxmd_md_EntityDescriptor_DEL_Extensions(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Extensions = (struct zxmd_md_Extensions_s*)x->Extensions->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_Extensions_s*)x->Extensions;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_RoleDescriptor) */

int zxmd_md_EntityDescriptor_NUM_RoleDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_RoleDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->RoleDescriptor; y; ++n, y = (struct zxmd_md_RoleDescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_RoleDescriptor) */

struct zxmd_md_RoleDescriptor_s* zxmd_md_EntityDescriptor_GET_RoleDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_RoleDescriptor_s* y;
  if (!x) return 0;
  for (y = x->RoleDescriptor; n>=0 && y; --n, y = (struct zxmd_md_RoleDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_RoleDescriptor) */

struct zxmd_md_RoleDescriptor_s* zxmd_md_EntityDescriptor_POP_RoleDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_RoleDescriptor_s* y;
  if (!x) return 0;
  y = x->RoleDescriptor;
  if (y)
    x->RoleDescriptor = (struct zxmd_md_RoleDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_RoleDescriptor) */

void zxmd_md_EntityDescriptor_PUSH_RoleDescriptor(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_RoleDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->RoleDescriptor->gg.g;
  x->RoleDescriptor = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_RoleDescriptor) */

void zxmd_md_EntityDescriptor_REV_RoleDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_RoleDescriptor_s* nxt;
  struct zxmd_md_RoleDescriptor_s* y;
  if (!x) return;
  y = x->RoleDescriptor;
  if (!y) return;
  x->RoleDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_RoleDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->RoleDescriptor->gg.g;
    x->RoleDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_RoleDescriptor) */

void zxmd_md_EntityDescriptor_PUT_RoleDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_RoleDescriptor_s* z)
{
  struct zxmd_md_RoleDescriptor_s* y;
  if (!x || !z) return;
  y = x->RoleDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->RoleDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_RoleDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_RoleDescriptor) */

void zxmd_md_EntityDescriptor_ADD_RoleDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_RoleDescriptor_s* z)
{
  struct zxmd_md_RoleDescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->RoleDescriptor->gg.g;
    x->RoleDescriptor = z;
    return;
  case -1:
    y = x->RoleDescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_RoleDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->RoleDescriptor; n > 1 && y; --n, y = (struct zxmd_md_RoleDescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_RoleDescriptor) */

void zxmd_md_EntityDescriptor_DEL_RoleDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_RoleDescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->RoleDescriptor = (struct zxmd_md_RoleDescriptor_s*)x->RoleDescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_RoleDescriptor_s*)x->RoleDescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_RoleDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->RoleDescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_RoleDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_IDPSSODescriptor) */

int zxmd_md_EntityDescriptor_NUM_IDPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_IDPSSODescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->IDPSSODescriptor; y; ++n, y = (struct zxmd_md_IDPSSODescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_IDPSSODescriptor) */

