gitpan/zxid/c/saml2md-getput.c
struct zxmd_md_IDPSSODescriptor_s* zxmd_md_EntityDescriptor_GET_IDPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_IDPSSODescriptor_s* y;
  if (!x) return 0;
  for (y = x->IDPSSODescriptor; n>=0 && y; --n, y = (struct zxmd_md_IDPSSODescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_IDPSSODescriptor) */

struct zxmd_md_IDPSSODescriptor_s* zxmd_md_EntityDescriptor_POP_IDPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_IDPSSODescriptor_s* y;
  if (!x) return 0;
  y = x->IDPSSODescriptor;
  if (y)
    x->IDPSSODescriptor = (struct zxmd_md_IDPSSODescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_IDPSSODescriptor) */

void zxmd_md_EntityDescriptor_PUSH_IDPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_IDPSSODescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->IDPSSODescriptor->gg.g;
  x->IDPSSODescriptor = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_IDPSSODescriptor) */

void zxmd_md_EntityDescriptor_REV_IDPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_IDPSSODescriptor_s* nxt;
  struct zxmd_md_IDPSSODescriptor_s* y;
  if (!x) return;
  y = x->IDPSSODescriptor;
  if (!y) return;
  x->IDPSSODescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_IDPSSODescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->IDPSSODescriptor->gg.g;
    x->IDPSSODescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_IDPSSODescriptor) */

void zxmd_md_EntityDescriptor_PUT_IDPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_IDPSSODescriptor_s* z)
{
  struct zxmd_md_IDPSSODescriptor_s* y;
  if (!x || !z) return;
  y = x->IDPSSODescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->IDPSSODescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_IDPSSODescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_IDPSSODescriptor) */

void zxmd_md_EntityDescriptor_ADD_IDPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_IDPSSODescriptor_s* z)
{
  struct zxmd_md_IDPSSODescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->IDPSSODescriptor->gg.g;
    x->IDPSSODescriptor = z;
    return;
  case -1:
    y = x->IDPSSODescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_IDPSSODescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->IDPSSODescriptor; n > 1 && y; --n, y = (struct zxmd_md_IDPSSODescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_IDPSSODescriptor) */

void zxmd_md_EntityDescriptor_DEL_IDPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_IDPSSODescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->IDPSSODescriptor = (struct zxmd_md_IDPSSODescriptor_s*)x->IDPSSODescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_IDPSSODescriptor_s*)x->IDPSSODescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_IDPSSODescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->IDPSSODescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_IDPSSODescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_SPSSODescriptor) */

int zxmd_md_EntityDescriptor_NUM_SPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_SPSSODescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SPSSODescriptor; y; ++n, y = (struct zxmd_md_SPSSODescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_SPSSODescriptor) */

struct zxmd_md_SPSSODescriptor_s* zxmd_md_EntityDescriptor_GET_SPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_SPSSODescriptor_s* y;
  if (!x) return 0;
  for (y = x->SPSSODescriptor; n>=0 && y; --n, y = (struct zxmd_md_SPSSODescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_SPSSODescriptor) */

struct zxmd_md_SPSSODescriptor_s* zxmd_md_EntityDescriptor_POP_SPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_SPSSODescriptor_s* y;
  if (!x) return 0;
  y = x->SPSSODescriptor;
  if (y)
    x->SPSSODescriptor = (struct zxmd_md_SPSSODescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_SPSSODescriptor) */

void zxmd_md_EntityDescriptor_PUSH_SPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_SPSSODescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SPSSODescriptor->gg.g;
  x->SPSSODescriptor = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_SPSSODescriptor) */

void zxmd_md_EntityDescriptor_REV_SPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_SPSSODescriptor_s* nxt;
  struct zxmd_md_SPSSODescriptor_s* y;
  if (!x) return;
  y = x->SPSSODescriptor;
  if (!y) return;
  x->SPSSODescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_SPSSODescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->SPSSODescriptor->gg.g;
    x->SPSSODescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_SPSSODescriptor) */

void zxmd_md_EntityDescriptor_PUT_SPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_SPSSODescriptor_s* z)
{
  struct zxmd_md_SPSSODescriptor_s* y;
  if (!x || !z) return;
  y = x->SPSSODescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SPSSODescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_SPSSODescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_SPSSODescriptor) */

void zxmd_md_EntityDescriptor_ADD_SPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_SPSSODescriptor_s* z)
{
  struct zxmd_md_SPSSODescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SPSSODescriptor->gg.g;
    x->SPSSODescriptor = z;
    return;
  case -1:
    y = x->SPSSODescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_SPSSODescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SPSSODescriptor; n > 1 && y; --n, y = (struct zxmd_md_SPSSODescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_SPSSODescriptor) */

void zxmd_md_EntityDescriptor_DEL_SPSSODescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_SPSSODescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SPSSODescriptor = (struct zxmd_md_SPSSODescriptor_s*)x->SPSSODescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_SPSSODescriptor_s*)x->SPSSODescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_SPSSODescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SPSSODescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_SPSSODescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_AuthnAuthorityDescriptor) */

int zxmd_md_EntityDescriptor_NUM_AuthnAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AuthnAuthorityDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AuthnAuthorityDescriptor; y; ++n, y = (struct zxmd_md_AuthnAuthorityDescriptor_s*)y->gg.g.n) ;
  return n;
}

