gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_EntityDescriptor_GET_AuthnAuthorityDescriptor) */

struct zxmd_md_AuthnAuthorityDescriptor_s* zxmd_md_EntityDescriptor_GET_AuthnAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_AuthnAuthorityDescriptor_s* y;
  if (!x) return 0;
  for (y = x->AuthnAuthorityDescriptor; n>=0 && y; --n, y = (struct zxmd_md_AuthnAuthorityDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_AuthnAuthorityDescriptor) */

struct zxmd_md_AuthnAuthorityDescriptor_s* zxmd_md_EntityDescriptor_POP_AuthnAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AuthnAuthorityDescriptor_s* y;
  if (!x) return 0;
  y = x->AuthnAuthorityDescriptor;
  if (y)
    x->AuthnAuthorityDescriptor = (struct zxmd_md_AuthnAuthorityDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_AuthnAuthorityDescriptor) */

void zxmd_md_EntityDescriptor_PUSH_AuthnAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_AuthnAuthorityDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AuthnAuthorityDescriptor->gg.g;
  x->AuthnAuthorityDescriptor = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_AuthnAuthorityDescriptor) */

void zxmd_md_EntityDescriptor_REV_AuthnAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AuthnAuthorityDescriptor_s* nxt;
  struct zxmd_md_AuthnAuthorityDescriptor_s* y;
  if (!x) return;
  y = x->AuthnAuthorityDescriptor;
  if (!y) return;
  x->AuthnAuthorityDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_AuthnAuthorityDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->AuthnAuthorityDescriptor->gg.g;
    x->AuthnAuthorityDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_AuthnAuthorityDescriptor) */

void zxmd_md_EntityDescriptor_PUT_AuthnAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_AuthnAuthorityDescriptor_s* z)
{
  struct zxmd_md_AuthnAuthorityDescriptor_s* y;
  if (!x || !z) return;
  y = x->AuthnAuthorityDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AuthnAuthorityDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AuthnAuthorityDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_AuthnAuthorityDescriptor) */

void zxmd_md_EntityDescriptor_ADD_AuthnAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_AuthnAuthorityDescriptor_s* z)
{
  struct zxmd_md_AuthnAuthorityDescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AuthnAuthorityDescriptor->gg.g;
    x->AuthnAuthorityDescriptor = z;
    return;
  case -1:
    y = x->AuthnAuthorityDescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AuthnAuthorityDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthnAuthorityDescriptor; n > 1 && y; --n, y = (struct zxmd_md_AuthnAuthorityDescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_AuthnAuthorityDescriptor) */

void zxmd_md_EntityDescriptor_DEL_AuthnAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_AuthnAuthorityDescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AuthnAuthorityDescriptor = (struct zxmd_md_AuthnAuthorityDescriptor_s*)x->AuthnAuthorityDescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AuthnAuthorityDescriptor_s*)x->AuthnAuthorityDescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AuthnAuthorityDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthnAuthorityDescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AuthnAuthorityDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_AttributeAuthorityDescriptor) */

int zxmd_md_EntityDescriptor_NUM_AttributeAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AttributeAuthorityDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AttributeAuthorityDescriptor; y; ++n, y = (struct zxmd_md_AttributeAuthorityDescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_AttributeAuthorityDescriptor) */

struct zxmd_md_AttributeAuthorityDescriptor_s* zxmd_md_EntityDescriptor_GET_AttributeAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_AttributeAuthorityDescriptor_s* y;
  if (!x) return 0;
  for (y = x->AttributeAuthorityDescriptor; n>=0 && y; --n, y = (struct zxmd_md_AttributeAuthorityDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_AttributeAuthorityDescriptor) */

struct zxmd_md_AttributeAuthorityDescriptor_s* zxmd_md_EntityDescriptor_POP_AttributeAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AttributeAuthorityDescriptor_s* y;
  if (!x) return 0;
  y = x->AttributeAuthorityDescriptor;
  if (y)
    x->AttributeAuthorityDescriptor = (struct zxmd_md_AttributeAuthorityDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_AttributeAuthorityDescriptor) */

void zxmd_md_EntityDescriptor_PUSH_AttributeAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_AttributeAuthorityDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AttributeAuthorityDescriptor->gg.g;
  x->AttributeAuthorityDescriptor = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_AttributeAuthorityDescriptor) */

void zxmd_md_EntityDescriptor_REV_AttributeAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AttributeAuthorityDescriptor_s* nxt;
  struct zxmd_md_AttributeAuthorityDescriptor_s* y;
  if (!x) return;
  y = x->AttributeAuthorityDescriptor;
  if (!y) return;
  x->AttributeAuthorityDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_AttributeAuthorityDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->AttributeAuthorityDescriptor->gg.g;
    x->AttributeAuthorityDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_AttributeAuthorityDescriptor) */

