gitpan/zxid/c/saml2md-getput.c
void zxmd_md_EntityDescriptor_PUT_AttributeAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_AttributeAuthorityDescriptor_s* z)
{
  struct zxmd_md_AttributeAuthorityDescriptor_s* y;
  if (!x || !z) return;
  y = x->AttributeAuthorityDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AttributeAuthorityDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AttributeAuthorityDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_AttributeAuthorityDescriptor) */

void zxmd_md_EntityDescriptor_ADD_AttributeAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_AttributeAuthorityDescriptor_s* z)
{
  struct zxmd_md_AttributeAuthorityDescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AttributeAuthorityDescriptor->gg.g;
    x->AttributeAuthorityDescriptor = z;
    return;
  case -1:
    y = x->AttributeAuthorityDescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AttributeAuthorityDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AttributeAuthorityDescriptor; n > 1 && y; --n, y = (struct zxmd_md_AttributeAuthorityDescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_AttributeAuthorityDescriptor) */

void zxmd_md_EntityDescriptor_DEL_AttributeAuthorityDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_AttributeAuthorityDescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AttributeAuthorityDescriptor = (struct zxmd_md_AttributeAuthorityDescriptor_s*)x->AttributeAuthorityDescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AttributeAuthorityDescriptor_s*)x->AttributeAuthorityDescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AttributeAuthorityDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AttributeAuthorityDescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AttributeAuthorityDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_PDPDescriptor) */

int zxmd_md_EntityDescriptor_NUM_PDPDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_PDPDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->PDPDescriptor; y; ++n, y = (struct zxmd_md_PDPDescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_PDPDescriptor) */

struct zxmd_md_PDPDescriptor_s* zxmd_md_EntityDescriptor_GET_PDPDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_PDPDescriptor_s* y;
  if (!x) return 0;
  for (y = x->PDPDescriptor; n>=0 && y; --n, y = (struct zxmd_md_PDPDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_PDPDescriptor) */

struct zxmd_md_PDPDescriptor_s* zxmd_md_EntityDescriptor_POP_PDPDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_PDPDescriptor_s* y;
  if (!x) return 0;
  y = x->PDPDescriptor;
  if (y)
    x->PDPDescriptor = (struct zxmd_md_PDPDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_PDPDescriptor) */

void zxmd_md_EntityDescriptor_PUSH_PDPDescriptor(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_PDPDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->PDPDescriptor->gg.g;
  x->PDPDescriptor = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_PDPDescriptor) */

void zxmd_md_EntityDescriptor_REV_PDPDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_PDPDescriptor_s* nxt;
  struct zxmd_md_PDPDescriptor_s* y;
  if (!x) return;
  y = x->PDPDescriptor;
  if (!y) return;
  x->PDPDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_PDPDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->PDPDescriptor->gg.g;
    x->PDPDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_PDPDescriptor) */

void zxmd_md_EntityDescriptor_PUT_PDPDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_PDPDescriptor_s* z)
{
  struct zxmd_md_PDPDescriptor_s* y;
  if (!x || !z) return;
  y = x->PDPDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->PDPDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_PDPDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_PDPDescriptor) */

void zxmd_md_EntityDescriptor_ADD_PDPDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_PDPDescriptor_s* z)
{
  struct zxmd_md_PDPDescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->PDPDescriptor->gg.g;
    x->PDPDescriptor = z;
    return;
  case -1:
    y = x->PDPDescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_PDPDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->PDPDescriptor; n > 1 && y; --n, y = (struct zxmd_md_PDPDescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_PDPDescriptor) */

void zxmd_md_EntityDescriptor_DEL_PDPDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_PDPDescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->PDPDescriptor = (struct zxmd_md_PDPDescriptor_s*)x->PDPDescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_PDPDescriptor_s*)x->PDPDescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_PDPDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->PDPDescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_PDPDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_AffiliationDescriptor) */

