gitpan/zxid/c/saml2md-getput.c
int zxmd_md_EntityDescriptor_NUM_AffiliationDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AffiliationDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AffiliationDescriptor; y; ++n, y = (struct zxmd_md_AffiliationDescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_AffiliationDescriptor) */

struct zxmd_md_AffiliationDescriptor_s* zxmd_md_EntityDescriptor_GET_AffiliationDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_AffiliationDescriptor_s* y;
  if (!x) return 0;
  for (y = x->AffiliationDescriptor; n>=0 && y; --n, y = (struct zxmd_md_AffiliationDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_AffiliationDescriptor) */

struct zxmd_md_AffiliationDescriptor_s* zxmd_md_EntityDescriptor_POP_AffiliationDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AffiliationDescriptor_s* y;
  if (!x) return 0;
  y = x->AffiliationDescriptor;
  if (y)
    x->AffiliationDescriptor = (struct zxmd_md_AffiliationDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_AffiliationDescriptor) */

void zxmd_md_EntityDescriptor_PUSH_AffiliationDescriptor(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_AffiliationDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AffiliationDescriptor->gg.g;
  x->AffiliationDescriptor = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_AffiliationDescriptor) */

void zxmd_md_EntityDescriptor_REV_AffiliationDescriptor(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AffiliationDescriptor_s* nxt;
  struct zxmd_md_AffiliationDescriptor_s* y;
  if (!x) return;
  y = x->AffiliationDescriptor;
  if (!y) return;
  x->AffiliationDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_AffiliationDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->AffiliationDescriptor->gg.g;
    x->AffiliationDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_AffiliationDescriptor) */

void zxmd_md_EntityDescriptor_PUT_AffiliationDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_AffiliationDescriptor_s* z)
{
  struct zxmd_md_AffiliationDescriptor_s* y;
  if (!x || !z) return;
  y = x->AffiliationDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AffiliationDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AffiliationDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_AffiliationDescriptor) */

void zxmd_md_EntityDescriptor_ADD_AffiliationDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_AffiliationDescriptor_s* z)
{
  struct zxmd_md_AffiliationDescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AffiliationDescriptor->gg.g;
    x->AffiliationDescriptor = z;
    return;
  case -1:
    y = x->AffiliationDescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AffiliationDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AffiliationDescriptor; n > 1 && y; --n, y = (struct zxmd_md_AffiliationDescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_AffiliationDescriptor) */

void zxmd_md_EntityDescriptor_DEL_AffiliationDescriptor(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_AffiliationDescriptor_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AffiliationDescriptor = (struct zxmd_md_AffiliationDescriptor_s*)x->AffiliationDescriptor->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AffiliationDescriptor_s*)x->AffiliationDescriptor;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AffiliationDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AffiliationDescriptor; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AffiliationDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_Organization) */

int zxmd_md_EntityDescriptor_NUM_Organization(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_Organization_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Organization; y; ++n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_Organization) */

struct zxmd_md_Organization_s* zxmd_md_EntityDescriptor_GET_Organization(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_Organization_s* y;
  if (!x) return 0;
  for (y = x->Organization; n>=0 && y; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_Organization) */

struct zxmd_md_Organization_s* zxmd_md_EntityDescriptor_POP_Organization(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_Organization_s* y;
  if (!x) return 0;
  y = x->Organization;
  if (y)
    x->Organization = (struct zxmd_md_Organization_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_Organization) */

void zxmd_md_EntityDescriptor_PUSH_Organization(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_Organization_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Organization->gg.g;
  x->Organization = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_Organization) */

void zxmd_md_EntityDescriptor_REV_Organization(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_Organization_s* nxt;
  struct zxmd_md_Organization_s* y;
  if (!x) return;
  y = x->Organization;
  if (!y) return;
  x->Organization = 0;
  while (y) {
    nxt = (struct zxmd_md_Organization_s*)y->gg.g.n;
    y->gg.g.n = &x->Organization->gg.g;
    x->Organization = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_Organization) */

void zxmd_md_EntityDescriptor_PUT_Organization(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_Organization_s* z)
{
  struct zxmd_md_Organization_s* y;
  if (!x || !z) return;
  y = x->Organization;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Organization = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_Organization) */

void zxmd_md_EntityDescriptor_ADD_Organization(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_Organization_s* z)
{
  struct zxmd_md_Organization_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Organization->gg.g;
    x->Organization = z;
    return;
  case -1:
    y = x->Organization;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Organization; n > 1 && y; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_Organization) */

