gitpan/zxid/c/saml2md-getput.c
void zxmd_md_EntityDescriptor_DEL_Organization(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_Organization_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Organization = (struct zxmd_md_Organization_s*)x->Organization->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_Organization_s*)x->Organization;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Organization; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_ContactPerson) */

int zxmd_md_EntityDescriptor_NUM_ContactPerson(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_ContactPerson_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ContactPerson; y; ++n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_ContactPerson) */

struct zxmd_md_ContactPerson_s* zxmd_md_EntityDescriptor_GET_ContactPerson(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return 0;
  for (y = x->ContactPerson; n>=0 && y; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_ContactPerson) */

struct zxmd_md_ContactPerson_s* zxmd_md_EntityDescriptor_POP_ContactPerson(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return 0;
  y = x->ContactPerson;
  if (y)
    x->ContactPerson = (struct zxmd_md_ContactPerson_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_ContactPerson) */

void zxmd_md_EntityDescriptor_PUSH_ContactPerson(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_ContactPerson_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ContactPerson->gg.g;
  x->ContactPerson = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_ContactPerson) */

void zxmd_md_EntityDescriptor_REV_ContactPerson(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_ContactPerson_s* nxt;
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return;
  y = x->ContactPerson;
  if (!y) return;
  x->ContactPerson = 0;
  while (y) {
    nxt = (struct zxmd_md_ContactPerson_s*)y->gg.g.n;
    y->gg.g.n = &x->ContactPerson->gg.g;
    x->ContactPerson = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_ContactPerson) */

void zxmd_md_EntityDescriptor_PUT_ContactPerson(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_ContactPerson_s* z)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x || !z) return;
  y = x->ContactPerson;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ContactPerson = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_ContactPerson) */

void zxmd_md_EntityDescriptor_ADD_ContactPerson(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_ContactPerson_s* z)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ContactPerson->gg.g;
    x->ContactPerson = z;
    return;
  case -1:
    y = x->ContactPerson;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ContactPerson; n > 1 && y; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_ContactPerson) */

void zxmd_md_EntityDescriptor_DEL_ContactPerson(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ContactPerson = (struct zxmd_md_ContactPerson_s*)x->ContactPerson->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_ContactPerson_s*)x->ContactPerson;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ContactPerson; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_EntityDescriptor_NUM_AdditionalMetadataLocation) */

int zxmd_md_EntityDescriptor_NUM_AdditionalMetadataLocation(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AdditionalMetadataLocation_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AdditionalMetadataLocation; y; ++n, y = (struct zxmd_md_AdditionalMetadataLocation_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_AdditionalMetadataLocation) */

struct zxmd_md_AdditionalMetadataLocation_s* zxmd_md_EntityDescriptor_GET_AdditionalMetadataLocation(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_AdditionalMetadataLocation_s* y;
  if (!x) return 0;
  for (y = x->AdditionalMetadataLocation; n>=0 && y; --n, y = (struct zxmd_md_AdditionalMetadataLocation_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_POP_AdditionalMetadataLocation) */

struct zxmd_md_AdditionalMetadataLocation_s* zxmd_md_EntityDescriptor_POP_AdditionalMetadataLocation(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AdditionalMetadataLocation_s* y;
  if (!x) return 0;
  y = x->AdditionalMetadataLocation;
  if (y)
    x->AdditionalMetadataLocation = (struct zxmd_md_AdditionalMetadataLocation_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_EntityDescriptor_PUSH_AdditionalMetadataLocation) */

void zxmd_md_EntityDescriptor_PUSH_AdditionalMetadataLocation(struct zxmd_md_EntityDescriptor_s* x, struct zxmd_md_AdditionalMetadataLocation_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AdditionalMetadataLocation->gg.g;
  x->AdditionalMetadataLocation = z;
}

/* FUNC(zxmd_md_EntityDescriptor_REV_AdditionalMetadataLocation) */

void zxmd_md_EntityDescriptor_REV_AdditionalMetadataLocation(struct zxmd_md_EntityDescriptor_s* x)
{
  struct zxmd_md_AdditionalMetadataLocation_s* nxt;
  struct zxmd_md_AdditionalMetadataLocation_s* y;
  if (!x) return;
  y = x->AdditionalMetadataLocation;
  if (!y) return;
  x->AdditionalMetadataLocation = 0;
  while (y) {
    nxt = (struct zxmd_md_AdditionalMetadataLocation_s*)y->gg.g.n;
    y->gg.g.n = &x->AdditionalMetadataLocation->gg.g;
    x->AdditionalMetadataLocation = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_PUT_AdditionalMetadataLocation) */

