gitpan/zxid/c/saml2md-getput.c
void zxmd_md_EntityDescriptor_PUT_AdditionalMetadataLocation(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_AdditionalMetadataLocation_s* z)
{
  struct zxmd_md_AdditionalMetadataLocation_s* y;
  if (!x || !z) return;
  y = x->AdditionalMetadataLocation;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AdditionalMetadataLocation = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AdditionalMetadataLocation_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_EntityDescriptor_ADD_AdditionalMetadataLocation) */

void zxmd_md_EntityDescriptor_ADD_AdditionalMetadataLocation(struct zxmd_md_EntityDescriptor_s* x, int n, struct zxmd_md_AdditionalMetadataLocation_s* z)
{
  struct zxmd_md_AdditionalMetadataLocation_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AdditionalMetadataLocation->gg.g;
    x->AdditionalMetadataLocation = z;
    return;
  case -1:
    y = x->AdditionalMetadataLocation;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AdditionalMetadataLocation_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AdditionalMetadataLocation; n > 1 && y; --n, y = (struct zxmd_md_AdditionalMetadataLocation_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_EntityDescriptor_DEL_AdditionalMetadataLocation) */

void zxmd_md_EntityDescriptor_DEL_AdditionalMetadataLocation(struct zxmd_md_EntityDescriptor_s* x, int n)
{
  struct zxmd_md_AdditionalMetadataLocation_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AdditionalMetadataLocation = (struct zxmd_md_AdditionalMetadataLocation_s*)x->AdditionalMetadataLocation->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AdditionalMetadataLocation_s*)x->AdditionalMetadataLocation;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AdditionalMetadataLocation_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AdditionalMetadataLocation; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AdditionalMetadataLocation_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_md_EntityDescriptor_GET_entityID) */
struct zx_str_s* zxmd_md_EntityDescriptor_GET_entityID(struct zxmd_md_EntityDescriptor_s* x) { return x->entityID; }
/* FUNC(zxmd_md_EntityDescriptor_PUT_entityID) */
void zxmd_md_EntityDescriptor_PUT_entityID(struct zxmd_md_EntityDescriptor_s* x, struct zx_str_s* y) { x->entityID = y; }
/* FUNC(zxmd_md_EntityDescriptor_GET_validUntil) */
struct zx_str_s* zxmd_md_EntityDescriptor_GET_validUntil(struct zxmd_md_EntityDescriptor_s* x) { return x->validUntil; }
/* FUNC(zxmd_md_EntityDescriptor_PUT_validUntil) */
void zxmd_md_EntityDescriptor_PUT_validUntil(struct zxmd_md_EntityDescriptor_s* x, struct zx_str_s* y) { x->validUntil = y; }
/* FUNC(zxmd_md_EntityDescriptor_GET_cacheDuration) */
struct zx_str_s* zxmd_md_EntityDescriptor_GET_cacheDuration(struct zxmd_md_EntityDescriptor_s* x) { return x->cacheDuration; }
/* FUNC(zxmd_md_EntityDescriptor_PUT_cacheDuration) */
void zxmd_md_EntityDescriptor_PUT_cacheDuration(struct zxmd_md_EntityDescriptor_s* x, struct zx_str_s* y) { x->cacheDuration = y; }
/* FUNC(zxmd_md_EntityDescriptor_GET_ID) */
struct zx_str_s* zxmd_md_EntityDescriptor_GET_ID(struct zxmd_md_EntityDescriptor_s* x) { return x->ID; }
/* FUNC(zxmd_md_EntityDescriptor_PUT_ID) */
void zxmd_md_EntityDescriptor_PUT_ID(struct zxmd_md_EntityDescriptor_s* x, struct zx_str_s* y) { x->ID = y; }












/* FUNC(zxmd_md_IDPSSODescriptor_NUM_Signature) */

int zxmd_md_IDPSSODescriptor_NUM_Signature(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Signature; y; ++n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_IDPSSODescriptor_GET_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_IDPSSODescriptor_GET_Signature(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  for (y = x->Signature; n>=0 && y; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_POP_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_IDPSSODescriptor_POP_Signature(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  y = x->Signature;
  if (y)
    x->Signature = (struct zxmd_ds_Signature_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUSH_Signature) */

void zxmd_md_IDPSSODescriptor_PUSH_Signature(struct zxmd_md_IDPSSODescriptor_s* x, struct zxmd_ds_Signature_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Signature->gg.g;
  x->Signature = z;
}

/* FUNC(zxmd_md_IDPSSODescriptor_REV_Signature) */

void zxmd_md_IDPSSODescriptor_REV_Signature(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_ds_Signature_s* nxt;
  struct zxmd_ds_Signature_s* y;
  if (!x) return;
  y = x->Signature;
  if (!y) return;
  x->Signature = 0;
  while (y) {
    nxt = (struct zxmd_ds_Signature_s*)y->gg.g.n;
    y->gg.g.n = &x->Signature->gg.g;
    x->Signature = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUT_Signature) */

void zxmd_md_IDPSSODescriptor_PUT_Signature(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_ds_Signature_s* z)
{
  struct zxmd_ds_Signature_s* y;
  if (!x || !z) return;
  y = x->Signature;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Signature = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_ADD_Signature) */

void zxmd_md_IDPSSODescriptor_ADD_Signature(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_ds_Signature_s* z)
{
  struct zxmd_ds_Signature_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Signature->gg.g;
    x->Signature = z;
    return;
  case -1:
    y = x->Signature;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Signature; n > 1 && y; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_IDPSSODescriptor_DEL_Signature) */

void zxmd_md_IDPSSODescriptor_DEL_Signature(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Signature = (struct zxmd_ds_Signature_s*)x->Signature->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_Signature_s*)x->Signature;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Signature; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_IDPSSODescriptor_NUM_Extensions) */

int zxmd_md_IDPSSODescriptor_NUM_Extensions(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_Extensions_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Extensions; y; ++n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_IDPSSODescriptor_GET_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_IDPSSODescriptor_GET_Extensions(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  for (y = x->Extensions; n>=0 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_POP_Extensions) */

