gitpan/zxid/c/saml2md-getput.c
struct zxmd_md_ManageNameIDService_s* zxmd_md_IDPSSODescriptor_GET_ManageNameIDService(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x) return 0;
  for (y = x->ManageNameIDService; n>=0 && y; --n, y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_POP_ManageNameIDService) */

struct zxmd_md_ManageNameIDService_s* zxmd_md_IDPSSODescriptor_POP_ManageNameIDService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x) return 0;
  y = x->ManageNameIDService;
  if (y)
    x->ManageNameIDService = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUSH_ManageNameIDService) */

void zxmd_md_IDPSSODescriptor_PUSH_ManageNameIDService(struct zxmd_md_IDPSSODescriptor_s* x, struct zxmd_md_ManageNameIDService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ManageNameIDService->gg.g;
  x->ManageNameIDService = z;
}

/* FUNC(zxmd_md_IDPSSODescriptor_REV_ManageNameIDService) */

void zxmd_md_IDPSSODescriptor_REV_ManageNameIDService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_ManageNameIDService_s* nxt;
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x) return;
  y = x->ManageNameIDService;
  if (!y) return;
  x->ManageNameIDService = 0;
  while (y) {
    nxt = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n;
    y->gg.g.n = &x->ManageNameIDService->gg.g;
    x->ManageNameIDService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUT_ManageNameIDService) */

void zxmd_md_IDPSSODescriptor_PUT_ManageNameIDService(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_md_ManageNameIDService_s* z)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x || !z) return;
  y = x->ManageNameIDService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ManageNameIDService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_ADD_ManageNameIDService) */

void zxmd_md_IDPSSODescriptor_ADD_ManageNameIDService(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_md_ManageNameIDService_s* z)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ManageNameIDService->gg.g;
    x->ManageNameIDService = z;
    return;
  case -1:
    y = x->ManageNameIDService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ManageNameIDService; n > 1 && y; --n, y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_IDPSSODescriptor_DEL_ManageNameIDService) */

void zxmd_md_IDPSSODescriptor_DEL_ManageNameIDService(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ManageNameIDService = (struct zxmd_md_ManageNameIDService_s*)x->ManageNameIDService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_ManageNameIDService_s*)x->ManageNameIDService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ManageNameIDService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_IDPSSODescriptor_NUM_NameIDFormat) */

int zxmd_md_IDPSSODescriptor_NUM_NameIDFormat(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->NameIDFormat; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_md_IDPSSODescriptor_GET_NameIDFormat) */

struct zx_elem_s* zxmd_md_IDPSSODescriptor_GET_NameIDFormat(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->NameIDFormat; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_POP_NameIDFormat) */

struct zx_elem_s* zxmd_md_IDPSSODescriptor_POP_NameIDFormat(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->NameIDFormat;
  if (y)
    x->NameIDFormat = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUSH_NameIDFormat) */

void zxmd_md_IDPSSODescriptor_PUSH_NameIDFormat(struct zxmd_md_IDPSSODescriptor_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->NameIDFormat->g;
  x->NameIDFormat = z;
}

/* FUNC(zxmd_md_IDPSSODescriptor_REV_NameIDFormat) */

void zxmd_md_IDPSSODescriptor_REV_NameIDFormat(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->NameIDFormat;
  if (!y) return;
  x->NameIDFormat = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUT_NameIDFormat) */

void zxmd_md_IDPSSODescriptor_PUT_NameIDFormat(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->NameIDFormat;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->NameIDFormat = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_ADD_NameIDFormat) */

void zxmd_md_IDPSSODescriptor_ADD_NameIDFormat(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = z;
    return;
  case -1:
    y = x->NameIDFormat;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_IDPSSODescriptor_DEL_NameIDFormat) */

void zxmd_md_IDPSSODescriptor_DEL_NameIDFormat(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->NameIDFormat = (struct zx_elem_s*)x->NameIDFormat->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->NameIDFormat;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_md_IDPSSODescriptor_NUM_SingleSignOnService) */

int zxmd_md_IDPSSODescriptor_NUM_SingleSignOnService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_SingleSignOnService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SingleSignOnService; y; ++n, y = (struct zxmd_md_SingleSignOnService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_IDPSSODescriptor_GET_SingleSignOnService) */

struct zxmd_md_SingleSignOnService_s* zxmd_md_IDPSSODescriptor_GET_SingleSignOnService(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_md_SingleSignOnService_s* y;
  if (!x) return 0;
  for (y = x->SingleSignOnService; n>=0 && y; --n, y = (struct zxmd_md_SingleSignOnService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_POP_SingleSignOnService) */

struct zxmd_md_SingleSignOnService_s* zxmd_md_IDPSSODescriptor_POP_SingleSignOnService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_SingleSignOnService_s* y;
  if (!x) return 0;
  y = x->SingleSignOnService;
  if (y)
    x->SingleSignOnService = (struct zxmd_md_SingleSignOnService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUSH_SingleSignOnService) */

void zxmd_md_IDPSSODescriptor_PUSH_SingleSignOnService(struct zxmd_md_IDPSSODescriptor_s* x, struct zxmd_md_SingleSignOnService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SingleSignOnService->gg.g;
  x->SingleSignOnService = z;
}

/* FUNC(zxmd_md_IDPSSODescriptor_REV_SingleSignOnService) */

void zxmd_md_IDPSSODescriptor_REV_SingleSignOnService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_SingleSignOnService_s* nxt;
  struct zxmd_md_SingleSignOnService_s* y;
  if (!x) return;
  y = x->SingleSignOnService;
  if (!y) return;
  x->SingleSignOnService = 0;
  while (y) {
    nxt = (struct zxmd_md_SingleSignOnService_s*)y->gg.g.n;
    y->gg.g.n = &x->SingleSignOnService->gg.g;
    x->SingleSignOnService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUT_SingleSignOnService) */

void zxmd_md_IDPSSODescriptor_PUT_SingleSignOnService(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_md_SingleSignOnService_s* z)
{
  struct zxmd_md_SingleSignOnService_s* y;
  if (!x || !z) return;
  y = x->SingleSignOnService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SingleSignOnService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_SingleSignOnService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_ADD_SingleSignOnService) */

void zxmd_md_IDPSSODescriptor_ADD_SingleSignOnService(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_md_SingleSignOnService_s* z)
{
  struct zxmd_md_SingleSignOnService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SingleSignOnService->gg.g;
    x->SingleSignOnService = z;
    return;
  case -1:
    y = x->SingleSignOnService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_SingleSignOnService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SingleSignOnService; n > 1 && y; --n, y = (struct zxmd_md_SingleSignOnService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_IDPSSODescriptor_DEL_SingleSignOnService) */

