gitpan/zxid/c/saml2md-getput.c
void zxmd_md_IDPSSODescriptor_DEL_SingleSignOnService(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_md_SingleSignOnService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SingleSignOnService = (struct zxmd_md_SingleSignOnService_s*)x->SingleSignOnService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_SingleSignOnService_s*)x->SingleSignOnService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_SingleSignOnService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SingleSignOnService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_SingleSignOnService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_IDPSSODescriptor_NUM_NameIDMappingService) */

int zxmd_md_IDPSSODescriptor_NUM_NameIDMappingService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_NameIDMappingService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->NameIDMappingService; y; ++n, y = (struct zxmd_md_NameIDMappingService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_IDPSSODescriptor_GET_NameIDMappingService) */

struct zxmd_md_NameIDMappingService_s* zxmd_md_IDPSSODescriptor_GET_NameIDMappingService(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_md_NameIDMappingService_s* y;
  if (!x) return 0;
  for (y = x->NameIDMappingService; n>=0 && y; --n, y = (struct zxmd_md_NameIDMappingService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_POP_NameIDMappingService) */

struct zxmd_md_NameIDMappingService_s* zxmd_md_IDPSSODescriptor_POP_NameIDMappingService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_NameIDMappingService_s* y;
  if (!x) return 0;
  y = x->NameIDMappingService;
  if (y)
    x->NameIDMappingService = (struct zxmd_md_NameIDMappingService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUSH_NameIDMappingService) */

void zxmd_md_IDPSSODescriptor_PUSH_NameIDMappingService(struct zxmd_md_IDPSSODescriptor_s* x, struct zxmd_md_NameIDMappingService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->NameIDMappingService->gg.g;
  x->NameIDMappingService = z;
}

/* FUNC(zxmd_md_IDPSSODescriptor_REV_NameIDMappingService) */

void zxmd_md_IDPSSODescriptor_REV_NameIDMappingService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_NameIDMappingService_s* nxt;
  struct zxmd_md_NameIDMappingService_s* y;
  if (!x) return;
  y = x->NameIDMappingService;
  if (!y) return;
  x->NameIDMappingService = 0;
  while (y) {
    nxt = (struct zxmd_md_NameIDMappingService_s*)y->gg.g.n;
    y->gg.g.n = &x->NameIDMappingService->gg.g;
    x->NameIDMappingService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUT_NameIDMappingService) */

void zxmd_md_IDPSSODescriptor_PUT_NameIDMappingService(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_md_NameIDMappingService_s* z)
{
  struct zxmd_md_NameIDMappingService_s* y;
  if (!x || !z) return;
  y = x->NameIDMappingService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->NameIDMappingService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_NameIDMappingService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_ADD_NameIDMappingService) */

void zxmd_md_IDPSSODescriptor_ADD_NameIDMappingService(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_md_NameIDMappingService_s* z)
{
  struct zxmd_md_NameIDMappingService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->NameIDMappingService->gg.g;
    x->NameIDMappingService = z;
    return;
  case -1:
    y = x->NameIDMappingService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_NameIDMappingService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->NameIDMappingService; n > 1 && y; --n, y = (struct zxmd_md_NameIDMappingService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_IDPSSODescriptor_DEL_NameIDMappingService) */

void zxmd_md_IDPSSODescriptor_DEL_NameIDMappingService(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_md_NameIDMappingService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->NameIDMappingService = (struct zxmd_md_NameIDMappingService_s*)x->NameIDMappingService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_NameIDMappingService_s*)x->NameIDMappingService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_NameIDMappingService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->NameIDMappingService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_NameIDMappingService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_IDPSSODescriptor_NUM_AssertionIDRequestService) */

int zxmd_md_IDPSSODescriptor_NUM_AssertionIDRequestService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AssertionIDRequestService; y; ++n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_IDPSSODescriptor_GET_AssertionIDRequestService) */

struct zxmd_md_AssertionIDRequestService_s* zxmd_md_IDPSSODescriptor_GET_AssertionIDRequestService(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return 0;
  for (y = x->AssertionIDRequestService; n>=0 && y; --n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_POP_AssertionIDRequestService) */

struct zxmd_md_AssertionIDRequestService_s* zxmd_md_IDPSSODescriptor_POP_AssertionIDRequestService(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return 0;
  y = x->AssertionIDRequestService;
  if (y)
    x->AssertionIDRequestService = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUSH_AssertionIDRequestService) */

void zxmd_md_IDPSSODescriptor_PUSH_AssertionIDRequestService(struct zxmd_md_IDPSSODescriptor_s* x, struct zxmd_md_AssertionIDRequestService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AssertionIDRequestService->gg.g;
  x->AssertionIDRequestService = z;
}

/* FUNC(zxmd_md_IDPSSODescriptor_REV_AssertionIDRequestService) */

