gitpan/zxid/c/saml2md-getput.c
int zxmd_md_IDPSSODescriptor_NUM_Attribute(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_sa_Attribute_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Attribute; y; ++n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_IDPSSODescriptor_GET_Attribute) */

struct zxmd_sa_Attribute_s* zxmd_md_IDPSSODescriptor_GET_Attribute(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x) return 0;
  for (y = x->Attribute; n>=0 && y; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_POP_Attribute) */

struct zxmd_sa_Attribute_s* zxmd_md_IDPSSODescriptor_POP_Attribute(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x) return 0;
  y = x->Attribute;
  if (y)
    x->Attribute = (struct zxmd_sa_Attribute_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUSH_Attribute) */

void zxmd_md_IDPSSODescriptor_PUSH_Attribute(struct zxmd_md_IDPSSODescriptor_s* x, struct zxmd_sa_Attribute_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Attribute->gg.g;
  x->Attribute = z;
}

/* FUNC(zxmd_md_IDPSSODescriptor_REV_Attribute) */

void zxmd_md_IDPSSODescriptor_REV_Attribute(struct zxmd_md_IDPSSODescriptor_s* x)
{
  struct zxmd_sa_Attribute_s* nxt;
  struct zxmd_sa_Attribute_s* y;
  if (!x) return;
  y = x->Attribute;
  if (!y) return;
  x->Attribute = 0;
  while (y) {
    nxt = (struct zxmd_sa_Attribute_s*)y->gg.g.n;
    y->gg.g.n = &x->Attribute->gg.g;
    x->Attribute = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_PUT_Attribute) */

void zxmd_md_IDPSSODescriptor_PUT_Attribute(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_sa_Attribute_s* z)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x || !z) return;
  y = x->Attribute;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Attribute = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_IDPSSODescriptor_ADD_Attribute) */

void zxmd_md_IDPSSODescriptor_ADD_Attribute(struct zxmd_md_IDPSSODescriptor_s* x, int n, struct zxmd_sa_Attribute_s* z)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Attribute->gg.g;
    x->Attribute = z;
    return;
  case -1:
    y = x->Attribute;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Attribute; n > 1 && y; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_IDPSSODescriptor_DEL_Attribute) */

void zxmd_md_IDPSSODescriptor_DEL_Attribute(struct zxmd_md_IDPSSODescriptor_s* x, int n)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Attribute = (struct zxmd_sa_Attribute_s*)x->Attribute->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_Attribute_s*)x->Attribute;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Attribute; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_md_IDPSSODescriptor_GET_WantAuthnRequestsSigned) */
struct zx_str_s* zxmd_md_IDPSSODescriptor_GET_WantAuthnRequestsSigned(struct zxmd_md_IDPSSODescriptor_s* x) { return x->WantAuthnRequestsSigned; }
/* FUNC(zxmd_md_IDPSSODescriptor_PUT_WantAuthnRequestsSigned) */
void zxmd_md_IDPSSODescriptor_PUT_WantAuthnRequestsSigned(struct zxmd_md_IDPSSODescriptor_s* x, struct zx_str_s* y) { x->WantAuthnRequestsSigned = y; }







/* FUNC(zxmd_md_KeyDescriptor_NUM_KeyInfo) */

int zxmd_md_KeyDescriptor_NUM_KeyInfo(struct zxmd_md_KeyDescriptor_s* x)
{
  struct zxmd_ds_KeyInfo_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KeyInfo; y; ++n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_KeyDescriptor_GET_KeyInfo) */

struct zxmd_ds_KeyInfo_s* zxmd_md_KeyDescriptor_GET_KeyInfo(struct zxmd_md_KeyDescriptor_s* x, int n)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return 0;
  for (y = x->KeyInfo; n>=0 && y; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_KeyDescriptor_POP_KeyInfo) */

struct zxmd_ds_KeyInfo_s* zxmd_md_KeyDescriptor_POP_KeyInfo(struct zxmd_md_KeyDescriptor_s* x)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return 0;
  y = x->KeyInfo;
  if (y)
    x->KeyInfo = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_KeyDescriptor_PUSH_KeyInfo) */

void zxmd_md_KeyDescriptor_PUSH_KeyInfo(struct zxmd_md_KeyDescriptor_s* x, struct zxmd_ds_KeyInfo_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->KeyInfo->gg.g;
  x->KeyInfo = z;
}

/* FUNC(zxmd_md_KeyDescriptor_REV_KeyInfo) */

void zxmd_md_KeyDescriptor_REV_KeyInfo(struct zxmd_md_KeyDescriptor_s* x)
{
  struct zxmd_ds_KeyInfo_s* nxt;
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return;
  y = x->KeyInfo;
  if (!y) return;
  x->KeyInfo = 0;
  while (y) {
    nxt = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n;
    y->gg.g.n = &x->KeyInfo->gg.g;
    x->KeyInfo = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_KeyDescriptor_PUT_KeyInfo) */

void zxmd_md_KeyDescriptor_PUT_KeyInfo(struct zxmd_md_KeyDescriptor_s* x, int n, struct zxmd_ds_KeyInfo_s* z)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x || !z) return;
  y = x->KeyInfo;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->KeyInfo = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_KeyDescriptor_ADD_KeyInfo) */

void zxmd_md_KeyDescriptor_ADD_KeyInfo(struct zxmd_md_KeyDescriptor_s* x, int n, struct zxmd_ds_KeyInfo_s* z)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->KeyInfo->gg.g;
    x->KeyInfo = z;
    return;
  case -1:
    y = x->KeyInfo;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyInfo; n > 1 && y; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_KeyDescriptor_DEL_KeyInfo) */

