gitpan/zxid/c/saml2md-getput.c
void zxmd_md_KeyDescriptor_DEL_KeyInfo(struct zxmd_md_KeyDescriptor_s* x, int n)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyInfo = (struct zxmd_ds_KeyInfo_s*)x->KeyInfo->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_KeyInfo_s*)x->KeyInfo;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyInfo; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_KeyDescriptor_NUM_EncryptionMethod) */

int zxmd_md_KeyDescriptor_NUM_EncryptionMethod(struct zxmd_md_KeyDescriptor_s* x)
{
  struct zxmd_md_EncryptionMethod_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EncryptionMethod; y; ++n, y = (struct zxmd_md_EncryptionMethod_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_KeyDescriptor_GET_EncryptionMethod) */

struct zxmd_md_EncryptionMethod_s* zxmd_md_KeyDescriptor_GET_EncryptionMethod(struct zxmd_md_KeyDescriptor_s* x, int n)
{
  struct zxmd_md_EncryptionMethod_s* y;
  if (!x) return 0;
  for (y = x->EncryptionMethod; n>=0 && y; --n, y = (struct zxmd_md_EncryptionMethod_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_KeyDescriptor_POP_EncryptionMethod) */

struct zxmd_md_EncryptionMethod_s* zxmd_md_KeyDescriptor_POP_EncryptionMethod(struct zxmd_md_KeyDescriptor_s* x)
{
  struct zxmd_md_EncryptionMethod_s* y;
  if (!x) return 0;
  y = x->EncryptionMethod;
  if (y)
    x->EncryptionMethod = (struct zxmd_md_EncryptionMethod_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_KeyDescriptor_PUSH_EncryptionMethod) */

void zxmd_md_KeyDescriptor_PUSH_EncryptionMethod(struct zxmd_md_KeyDescriptor_s* x, struct zxmd_md_EncryptionMethod_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptionMethod->gg.g;
  x->EncryptionMethod = z;
}

/* FUNC(zxmd_md_KeyDescriptor_REV_EncryptionMethod) */

void zxmd_md_KeyDescriptor_REV_EncryptionMethod(struct zxmd_md_KeyDescriptor_s* x)
{
  struct zxmd_md_EncryptionMethod_s* nxt;
  struct zxmd_md_EncryptionMethod_s* y;
  if (!x) return;
  y = x->EncryptionMethod;
  if (!y) return;
  x->EncryptionMethod = 0;
  while (y) {
    nxt = (struct zxmd_md_EncryptionMethod_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptionMethod->gg.g;
    x->EncryptionMethod = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_KeyDescriptor_PUT_EncryptionMethod) */

void zxmd_md_KeyDescriptor_PUT_EncryptionMethod(struct zxmd_md_KeyDescriptor_s* x, int n, struct zxmd_md_EncryptionMethod_s* z)
{
  struct zxmd_md_EncryptionMethod_s* y;
  if (!x || !z) return;
  y = x->EncryptionMethod;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptionMethod = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_EncryptionMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_KeyDescriptor_ADD_EncryptionMethod) */

void zxmd_md_KeyDescriptor_ADD_EncryptionMethod(struct zxmd_md_KeyDescriptor_s* x, int n, struct zxmd_md_EncryptionMethod_s* z)
{
  struct zxmd_md_EncryptionMethod_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EncryptionMethod->gg.g;
    x->EncryptionMethod = z;
    return;
  case -1:
    y = x->EncryptionMethod;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_EncryptionMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptionMethod; n > 1 && y; --n, y = (struct zxmd_md_EncryptionMethod_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_KeyDescriptor_DEL_EncryptionMethod) */

void zxmd_md_KeyDescriptor_DEL_EncryptionMethod(struct zxmd_md_KeyDescriptor_s* x, int n)
{
  struct zxmd_md_EncryptionMethod_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptionMethod = (struct zxmd_md_EncryptionMethod_s*)x->EncryptionMethod->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_EncryptionMethod_s*)x->EncryptionMethod;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_EncryptionMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptionMethod; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_EncryptionMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_md_KeyDescriptor_GET_use) */
struct zx_str_s* zxmd_md_KeyDescriptor_GET_use(struct zxmd_md_KeyDescriptor_s* x) { return x->use; }
/* FUNC(zxmd_md_KeyDescriptor_PUT_use) */
void zxmd_md_KeyDescriptor_PUT_use(struct zxmd_md_KeyDescriptor_s* x, struct zx_str_s* y) { x->use = y; }





/* FUNC(zxmd_md_ManageNameIDService_GET_Binding) */
struct zx_str_s* zxmd_md_ManageNameIDService_GET_Binding(struct zxmd_md_ManageNameIDService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_ManageNameIDService_PUT_Binding) */
void zxmd_md_ManageNameIDService_PUT_Binding(struct zxmd_md_ManageNameIDService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_ManageNameIDService_GET_Location) */
struct zx_str_s* zxmd_md_ManageNameIDService_GET_Location(struct zxmd_md_ManageNameIDService_s* x) { return x->Location; }
/* FUNC(zxmd_md_ManageNameIDService_PUT_Location) */
void zxmd_md_ManageNameIDService_PUT_Location(struct zxmd_md_ManageNameIDService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_ManageNameIDService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_ManageNameIDService_GET_ResponseLocation(struct zxmd_md_ManageNameIDService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_ManageNameIDService_PUT_ResponseLocation) */
void zxmd_md_ManageNameIDService_PUT_ResponseLocation(struct zxmd_md_ManageNameIDService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }





/* FUNC(zxmd_md_NameIDMappingService_GET_Binding) */
struct zx_str_s* zxmd_md_NameIDMappingService_GET_Binding(struct zxmd_md_NameIDMappingService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_NameIDMappingService_PUT_Binding) */
void zxmd_md_NameIDMappingService_PUT_Binding(struct zxmd_md_NameIDMappingService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_NameIDMappingService_GET_Location) */
struct zx_str_s* zxmd_md_NameIDMappingService_GET_Location(struct zxmd_md_NameIDMappingService_s* x) { return x->Location; }
/* FUNC(zxmd_md_NameIDMappingService_PUT_Location) */
void zxmd_md_NameIDMappingService_PUT_Location(struct zxmd_md_NameIDMappingService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_NameIDMappingService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_NameIDMappingService_GET_ResponseLocation(struct zxmd_md_NameIDMappingService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_NameIDMappingService_PUT_ResponseLocation) */
void zxmd_md_NameIDMappingService_PUT_ResponseLocation(struct zxmd_md_NameIDMappingService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }







/* FUNC(zxmd_md_Organization_NUM_Extensions) */

int zxmd_md_Organization_NUM_Extensions(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_Extensions_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Extensions; y; ++n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_Organization_GET_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_Organization_GET_Extensions(struct zxmd_md_Organization_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  for (y = x->Extensions; n>=0 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_Organization_POP_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_Organization_POP_Extensions(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  y = x->Extensions;
  if (y)
    x->Extensions = (struct zxmd_md_Extensions_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_Organization_PUSH_Extensions) */

