gitpan/zxid/c/saml2md-getput.c
void zxmd_md_Organization_PUSH_Extensions(struct zxmd_md_Organization_s* x, struct zxmd_md_Extensions_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Extensions->gg.g;
  x->Extensions = z;
}

/* FUNC(zxmd_md_Organization_REV_Extensions) */

void zxmd_md_Organization_REV_Extensions(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_Extensions_s* nxt;
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  y = x->Extensions;
  if (!y) return;
  x->Extensions = 0;
  while (y) {
    nxt = (struct zxmd_md_Extensions_s*)y->gg.g.n;
    y->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_Organization_PUT_Extensions) */

void zxmd_md_Organization_PUT_Extensions(struct zxmd_md_Organization_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  y = x->Extensions;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Extensions = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_Organization_ADD_Extensions) */

void zxmd_md_Organization_ADD_Extensions(struct zxmd_md_Organization_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = z;
    return;
  case -1:
    y = x->Extensions;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_Organization_DEL_Extensions) */

void zxmd_md_Organization_DEL_Extensions(struct zxmd_md_Organization_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Extensions = (struct zxmd_md_Extensions_s*)x->Extensions->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_Extensions_s*)x->Extensions;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_Organization_NUM_OrganizationName) */

int zxmd_md_Organization_NUM_OrganizationName(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_OrganizationName_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->OrganizationName; y; ++n, y = (struct zxmd_md_OrganizationName_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_Organization_GET_OrganizationName) */

struct zxmd_md_OrganizationName_s* zxmd_md_Organization_GET_OrganizationName(struct zxmd_md_Organization_s* x, int n)
{
  struct zxmd_md_OrganizationName_s* y;
  if (!x) return 0;
  for (y = x->OrganizationName; n>=0 && y; --n, y = (struct zxmd_md_OrganizationName_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_Organization_POP_OrganizationName) */

struct zxmd_md_OrganizationName_s* zxmd_md_Organization_POP_OrganizationName(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_OrganizationName_s* y;
  if (!x) return 0;
  y = x->OrganizationName;
  if (y)
    x->OrganizationName = (struct zxmd_md_OrganizationName_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_Organization_PUSH_OrganizationName) */

void zxmd_md_Organization_PUSH_OrganizationName(struct zxmd_md_Organization_s* x, struct zxmd_md_OrganizationName_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->OrganizationName->gg.g;
  x->OrganizationName = z;
}

/* FUNC(zxmd_md_Organization_REV_OrganizationName) */

void zxmd_md_Organization_REV_OrganizationName(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_OrganizationName_s* nxt;
  struct zxmd_md_OrganizationName_s* y;
  if (!x) return;
  y = x->OrganizationName;
  if (!y) return;
  x->OrganizationName = 0;
  while (y) {
    nxt = (struct zxmd_md_OrganizationName_s*)y->gg.g.n;
    y->gg.g.n = &x->OrganizationName->gg.g;
    x->OrganizationName = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_Organization_PUT_OrganizationName) */

void zxmd_md_Organization_PUT_OrganizationName(struct zxmd_md_Organization_s* x, int n, struct zxmd_md_OrganizationName_s* z)
{
  struct zxmd_md_OrganizationName_s* y;
  if (!x || !z) return;
  y = x->OrganizationName;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->OrganizationName = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_OrganizationName_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_Organization_ADD_OrganizationName) */

void zxmd_md_Organization_ADD_OrganizationName(struct zxmd_md_Organization_s* x, int n, struct zxmd_md_OrganizationName_s* z)
{
  struct zxmd_md_OrganizationName_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->OrganizationName->gg.g;
    x->OrganizationName = z;
    return;
  case -1:
    y = x->OrganizationName;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_OrganizationName_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OrganizationName; n > 1 && y; --n, y = (struct zxmd_md_OrganizationName_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_Organization_DEL_OrganizationName) */

void zxmd_md_Organization_DEL_OrganizationName(struct zxmd_md_Organization_s* x, int n)
{
  struct zxmd_md_OrganizationName_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->OrganizationName = (struct zxmd_md_OrganizationName_s*)x->OrganizationName->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_OrganizationName_s*)x->OrganizationName;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_OrganizationName_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OrganizationName; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_OrganizationName_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_Organization_NUM_OrganizationDisplayName) */

int zxmd_md_Organization_NUM_OrganizationDisplayName(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_OrganizationDisplayName_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->OrganizationDisplayName; y; ++n, y = (struct zxmd_md_OrganizationDisplayName_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_Organization_GET_OrganizationDisplayName) */

