gitpan/zxid/c/saml2md-getput.c
struct zxmd_md_OrganizationDisplayName_s* zxmd_md_Organization_GET_OrganizationDisplayName(struct zxmd_md_Organization_s* x, int n)
{
  struct zxmd_md_OrganizationDisplayName_s* y;
  if (!x) return 0;
  for (y = x->OrganizationDisplayName; n>=0 && y; --n, y = (struct zxmd_md_OrganizationDisplayName_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_Organization_POP_OrganizationDisplayName) */

struct zxmd_md_OrganizationDisplayName_s* zxmd_md_Organization_POP_OrganizationDisplayName(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_OrganizationDisplayName_s* y;
  if (!x) return 0;
  y = x->OrganizationDisplayName;
  if (y)
    x->OrganizationDisplayName = (struct zxmd_md_OrganizationDisplayName_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_Organization_PUSH_OrganizationDisplayName) */

void zxmd_md_Organization_PUSH_OrganizationDisplayName(struct zxmd_md_Organization_s* x, struct zxmd_md_OrganizationDisplayName_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->OrganizationDisplayName->gg.g;
  x->OrganizationDisplayName = z;
}

/* FUNC(zxmd_md_Organization_REV_OrganizationDisplayName) */

void zxmd_md_Organization_REV_OrganizationDisplayName(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_OrganizationDisplayName_s* nxt;
  struct zxmd_md_OrganizationDisplayName_s* y;
  if (!x) return;
  y = x->OrganizationDisplayName;
  if (!y) return;
  x->OrganizationDisplayName = 0;
  while (y) {
    nxt = (struct zxmd_md_OrganizationDisplayName_s*)y->gg.g.n;
    y->gg.g.n = &x->OrganizationDisplayName->gg.g;
    x->OrganizationDisplayName = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_Organization_PUT_OrganizationDisplayName) */

void zxmd_md_Organization_PUT_OrganizationDisplayName(struct zxmd_md_Organization_s* x, int n, struct zxmd_md_OrganizationDisplayName_s* z)
{
  struct zxmd_md_OrganizationDisplayName_s* y;
  if (!x || !z) return;
  y = x->OrganizationDisplayName;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->OrganizationDisplayName = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_OrganizationDisplayName_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_Organization_ADD_OrganizationDisplayName) */

void zxmd_md_Organization_ADD_OrganizationDisplayName(struct zxmd_md_Organization_s* x, int n, struct zxmd_md_OrganizationDisplayName_s* z)
{
  struct zxmd_md_OrganizationDisplayName_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->OrganizationDisplayName->gg.g;
    x->OrganizationDisplayName = z;
    return;
  case -1:
    y = x->OrganizationDisplayName;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_OrganizationDisplayName_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OrganizationDisplayName; n > 1 && y; --n, y = (struct zxmd_md_OrganizationDisplayName_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_Organization_DEL_OrganizationDisplayName) */

void zxmd_md_Organization_DEL_OrganizationDisplayName(struct zxmd_md_Organization_s* x, int n)
{
  struct zxmd_md_OrganizationDisplayName_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->OrganizationDisplayName = (struct zxmd_md_OrganizationDisplayName_s*)x->OrganizationDisplayName->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_OrganizationDisplayName_s*)x->OrganizationDisplayName;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_OrganizationDisplayName_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OrganizationDisplayName; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_OrganizationDisplayName_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_Organization_NUM_OrganizationURL) */

int zxmd_md_Organization_NUM_OrganizationURL(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_OrganizationURL_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->OrganizationURL; y; ++n, y = (struct zxmd_md_OrganizationURL_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_Organization_GET_OrganizationURL) */

struct zxmd_md_OrganizationURL_s* zxmd_md_Organization_GET_OrganizationURL(struct zxmd_md_Organization_s* x, int n)
{
  struct zxmd_md_OrganizationURL_s* y;
  if (!x) return 0;
  for (y = x->OrganizationURL; n>=0 && y; --n, y = (struct zxmd_md_OrganizationURL_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_Organization_POP_OrganizationURL) */

struct zxmd_md_OrganizationURL_s* zxmd_md_Organization_POP_OrganizationURL(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_OrganizationURL_s* y;
  if (!x) return 0;
  y = x->OrganizationURL;
  if (y)
    x->OrganizationURL = (struct zxmd_md_OrganizationURL_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_Organization_PUSH_OrganizationURL) */

void zxmd_md_Organization_PUSH_OrganizationURL(struct zxmd_md_Organization_s* x, struct zxmd_md_OrganizationURL_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->OrganizationURL->gg.g;
  x->OrganizationURL = z;
}

/* FUNC(zxmd_md_Organization_REV_OrganizationURL) */

void zxmd_md_Organization_REV_OrganizationURL(struct zxmd_md_Organization_s* x)
{
  struct zxmd_md_OrganizationURL_s* nxt;
  struct zxmd_md_OrganizationURL_s* y;
  if (!x) return;
  y = x->OrganizationURL;
  if (!y) return;
  x->OrganizationURL = 0;
  while (y) {
    nxt = (struct zxmd_md_OrganizationURL_s*)y->gg.g.n;
    y->gg.g.n = &x->OrganizationURL->gg.g;
    x->OrganizationURL = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_Organization_PUT_OrganizationURL) */

void zxmd_md_Organization_PUT_OrganizationURL(struct zxmd_md_Organization_s* x, int n, struct zxmd_md_OrganizationURL_s* z)
{
  struct zxmd_md_OrganizationURL_s* y;
  if (!x || !z) return;
  y = x->OrganizationURL;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->OrganizationURL = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_OrganizationURL_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_Organization_ADD_OrganizationURL) */

