gitpan/zxid/c/saml2md-getput.c
int zxmd_md_PDPDescriptor_NUM_Organization(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_Organization_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Organization; y; ++n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_PDPDescriptor_GET_Organization) */

struct zxmd_md_Organization_s* zxmd_md_PDPDescriptor_GET_Organization(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zxmd_md_Organization_s* y;
  if (!x) return 0;
  for (y = x->Organization; n>=0 && y; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_POP_Organization) */

struct zxmd_md_Organization_s* zxmd_md_PDPDescriptor_POP_Organization(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_Organization_s* y;
  if (!x) return 0;
  y = x->Organization;
  if (y)
    x->Organization = (struct zxmd_md_Organization_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_PUSH_Organization) */

void zxmd_md_PDPDescriptor_PUSH_Organization(struct zxmd_md_PDPDescriptor_s* x, struct zxmd_md_Organization_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Organization->gg.g;
  x->Organization = z;
}

/* FUNC(zxmd_md_PDPDescriptor_REV_Organization) */

void zxmd_md_PDPDescriptor_REV_Organization(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_Organization_s* nxt;
  struct zxmd_md_Organization_s* y;
  if (!x) return;
  y = x->Organization;
  if (!y) return;
  x->Organization = 0;
  while (y) {
    nxt = (struct zxmd_md_Organization_s*)y->gg.g.n;
    y->gg.g.n = &x->Organization->gg.g;
    x->Organization = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_PUT_Organization) */

void zxmd_md_PDPDescriptor_PUT_Organization(struct zxmd_md_PDPDescriptor_s* x, int n, struct zxmd_md_Organization_s* z)
{
  struct zxmd_md_Organization_s* y;
  if (!x || !z) return;
  y = x->Organization;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Organization = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_ADD_Organization) */

void zxmd_md_PDPDescriptor_ADD_Organization(struct zxmd_md_PDPDescriptor_s* x, int n, struct zxmd_md_Organization_s* z)
{
  struct zxmd_md_Organization_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Organization->gg.g;
    x->Organization = z;
    return;
  case -1:
    y = x->Organization;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Organization; n > 1 && y; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_PDPDescriptor_DEL_Organization) */

void zxmd_md_PDPDescriptor_DEL_Organization(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zxmd_md_Organization_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Organization = (struct zxmd_md_Organization_s*)x->Organization->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_Organization_s*)x->Organization;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Organization; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Organization_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_PDPDescriptor_NUM_ContactPerson) */

int zxmd_md_PDPDescriptor_NUM_ContactPerson(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_ContactPerson_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ContactPerson; y; ++n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_PDPDescriptor_GET_ContactPerson) */

struct zxmd_md_ContactPerson_s* zxmd_md_PDPDescriptor_GET_ContactPerson(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return 0;
  for (y = x->ContactPerson; n>=0 && y; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_POP_ContactPerson) */

struct zxmd_md_ContactPerson_s* zxmd_md_PDPDescriptor_POP_ContactPerson(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return 0;
  y = x->ContactPerson;
  if (y)
    x->ContactPerson = (struct zxmd_md_ContactPerson_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_PUSH_ContactPerson) */

void zxmd_md_PDPDescriptor_PUSH_ContactPerson(struct zxmd_md_PDPDescriptor_s* x, struct zxmd_md_ContactPerson_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ContactPerson->gg.g;
  x->ContactPerson = z;
}

/* FUNC(zxmd_md_PDPDescriptor_REV_ContactPerson) */

void zxmd_md_PDPDescriptor_REV_ContactPerson(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_ContactPerson_s* nxt;
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return;
  y = x->ContactPerson;
  if (!y) return;
  x->ContactPerson = 0;
  while (y) {
    nxt = (struct zxmd_md_ContactPerson_s*)y->gg.g.n;
    y->gg.g.n = &x->ContactPerson->gg.g;
    x->ContactPerson = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_PUT_ContactPerson) */

void zxmd_md_PDPDescriptor_PUT_ContactPerson(struct zxmd_md_PDPDescriptor_s* x, int n, struct zxmd_md_ContactPerson_s* z)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x || !z) return;
  y = x->ContactPerson;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ContactPerson = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_ADD_ContactPerson) */

void zxmd_md_PDPDescriptor_ADD_ContactPerson(struct zxmd_md_PDPDescriptor_s* x, int n, struct zxmd_md_ContactPerson_s* z)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ContactPerson->gg.g;
    x->ContactPerson = z;
    return;
  case -1:
    y = x->ContactPerson;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ContactPerson; n > 1 && y; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

