gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_PDPDescriptor_DEL_ContactPerson) */

void zxmd_md_PDPDescriptor_DEL_ContactPerson(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zxmd_md_ContactPerson_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ContactPerson = (struct zxmd_md_ContactPerson_s*)x->ContactPerson->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_ContactPerson_s*)x->ContactPerson;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ContactPerson; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ContactPerson_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_md_PDPDescriptor_GET_ID) */
struct zx_str_s* zxmd_md_PDPDescriptor_GET_ID(struct zxmd_md_PDPDescriptor_s* x) { return x->ID; }
/* FUNC(zxmd_md_PDPDescriptor_PUT_ID) */
void zxmd_md_PDPDescriptor_PUT_ID(struct zxmd_md_PDPDescriptor_s* x, struct zx_str_s* y) { x->ID = y; }
/* FUNC(zxmd_md_PDPDescriptor_GET_validUntil) */
struct zx_str_s* zxmd_md_PDPDescriptor_GET_validUntil(struct zxmd_md_PDPDescriptor_s* x) { return x->validUntil; }
/* FUNC(zxmd_md_PDPDescriptor_PUT_validUntil) */
void zxmd_md_PDPDescriptor_PUT_validUntil(struct zxmd_md_PDPDescriptor_s* x, struct zx_str_s* y) { x->validUntil = y; }
/* FUNC(zxmd_md_PDPDescriptor_GET_cacheDuration) */
struct zx_str_s* zxmd_md_PDPDescriptor_GET_cacheDuration(struct zxmd_md_PDPDescriptor_s* x) { return x->cacheDuration; }
/* FUNC(zxmd_md_PDPDescriptor_PUT_cacheDuration) */
void zxmd_md_PDPDescriptor_PUT_cacheDuration(struct zxmd_md_PDPDescriptor_s* x, struct zx_str_s* y) { x->cacheDuration = y; }
/* FUNC(zxmd_md_PDPDescriptor_GET_protocolSupportEnumeration) */
struct zx_str_s* zxmd_md_PDPDescriptor_GET_protocolSupportEnumeration(struct zxmd_md_PDPDescriptor_s* x) { return x->protocolSupportEnumeration; }
/* FUNC(zxmd_md_PDPDescriptor_PUT_protocolSupportEnumeration) */
void zxmd_md_PDPDescriptor_PUT_protocolSupportEnumeration(struct zxmd_md_PDPDescriptor_s* x, struct zx_str_s* y) { x->protocolSupportEnumeration = y; }
/* FUNC(zxmd_md_PDPDescriptor_GET_errorURL) */
struct zx_str_s* zxmd_md_PDPDescriptor_GET_errorURL(struct zxmd_md_PDPDescriptor_s* x) { return x->errorURL; }
/* FUNC(zxmd_md_PDPDescriptor_PUT_errorURL) */
void zxmd_md_PDPDescriptor_PUT_errorURL(struct zxmd_md_PDPDescriptor_s* x, struct zx_str_s* y) { x->errorURL = y; }


/* FUNC(zxmd_md_PDPDescriptor_NUM_AuthzService) */

int zxmd_md_PDPDescriptor_NUM_AuthzService(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_AuthzService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AuthzService; y; ++n, y = (struct zxmd_md_AuthzService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_PDPDescriptor_GET_AuthzService) */

struct zxmd_md_AuthzService_s* zxmd_md_PDPDescriptor_GET_AuthzService(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zxmd_md_AuthzService_s* y;
  if (!x) return 0;
  for (y = x->AuthzService; n>=0 && y; --n, y = (struct zxmd_md_AuthzService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_POP_AuthzService) */

struct zxmd_md_AuthzService_s* zxmd_md_PDPDescriptor_POP_AuthzService(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_AuthzService_s* y;
  if (!x) return 0;
  y = x->AuthzService;
  if (y)
    x->AuthzService = (struct zxmd_md_AuthzService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_PUSH_AuthzService) */

void zxmd_md_PDPDescriptor_PUSH_AuthzService(struct zxmd_md_PDPDescriptor_s* x, struct zxmd_md_AuthzService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AuthzService->gg.g;
  x->AuthzService = z;
}

/* FUNC(zxmd_md_PDPDescriptor_REV_AuthzService) */

void zxmd_md_PDPDescriptor_REV_AuthzService(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_AuthzService_s* nxt;
  struct zxmd_md_AuthzService_s* y;
  if (!x) return;
  y = x->AuthzService;
  if (!y) return;
  x->AuthzService = 0;
  while (y) {
    nxt = (struct zxmd_md_AuthzService_s*)y->gg.g.n;
    y->gg.g.n = &x->AuthzService->gg.g;
    x->AuthzService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_PUT_AuthzService) */

void zxmd_md_PDPDescriptor_PUT_AuthzService(struct zxmd_md_PDPDescriptor_s* x, int n, struct zxmd_md_AuthzService_s* z)
{
  struct zxmd_md_AuthzService_s* y;
  if (!x || !z) return;
  y = x->AuthzService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AuthzService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AuthzService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_ADD_AuthzService) */

void zxmd_md_PDPDescriptor_ADD_AuthzService(struct zxmd_md_PDPDescriptor_s* x, int n, struct zxmd_md_AuthzService_s* z)
{
  struct zxmd_md_AuthzService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AuthzService->gg.g;
    x->AuthzService = z;
    return;
  case -1:
    y = x->AuthzService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AuthzService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthzService; n > 1 && y; --n, y = (struct zxmd_md_AuthzService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_PDPDescriptor_DEL_AuthzService) */

void zxmd_md_PDPDescriptor_DEL_AuthzService(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zxmd_md_AuthzService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AuthzService = (struct zxmd_md_AuthzService_s*)x->AuthzService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AuthzService_s*)x->AuthzService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AuthzService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthzService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AuthzService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_PDPDescriptor_NUM_AssertionIDRequestService) */

int zxmd_md_PDPDescriptor_NUM_AssertionIDRequestService(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AssertionIDRequestService; y; ++n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_PDPDescriptor_GET_AssertionIDRequestService) */

