gitpan/zxid/c/saml2md-getput.c
struct zxmd_md_AssertionIDRequestService_s* zxmd_md_PDPDescriptor_GET_AssertionIDRequestService(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return 0;
  for (y = x->AssertionIDRequestService; n>=0 && y; --n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_POP_AssertionIDRequestService) */

struct zxmd_md_AssertionIDRequestService_s* zxmd_md_PDPDescriptor_POP_AssertionIDRequestService(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return 0;
  y = x->AssertionIDRequestService;
  if (y)
    x->AssertionIDRequestService = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_PUSH_AssertionIDRequestService) */

void zxmd_md_PDPDescriptor_PUSH_AssertionIDRequestService(struct zxmd_md_PDPDescriptor_s* x, struct zxmd_md_AssertionIDRequestService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AssertionIDRequestService->gg.g;
  x->AssertionIDRequestService = z;
}

/* FUNC(zxmd_md_PDPDescriptor_REV_AssertionIDRequestService) */

void zxmd_md_PDPDescriptor_REV_AssertionIDRequestService(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zxmd_md_AssertionIDRequestService_s* nxt;
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return;
  y = x->AssertionIDRequestService;
  if (!y) return;
  x->AssertionIDRequestService = 0;
  while (y) {
    nxt = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n;
    y->gg.g.n = &x->AssertionIDRequestService->gg.g;
    x->AssertionIDRequestService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_PUT_AssertionIDRequestService) */

void zxmd_md_PDPDescriptor_PUT_AssertionIDRequestService(struct zxmd_md_PDPDescriptor_s* x, int n, struct zxmd_md_AssertionIDRequestService_s* z)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x || !z) return;
  y = x->AssertionIDRequestService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AssertionIDRequestService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_ADD_AssertionIDRequestService) */

void zxmd_md_PDPDescriptor_ADD_AssertionIDRequestService(struct zxmd_md_PDPDescriptor_s* x, int n, struct zxmd_md_AssertionIDRequestService_s* z)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AssertionIDRequestService->gg.g;
    x->AssertionIDRequestService = z;
    return;
  case -1:
    y = x->AssertionIDRequestService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AssertionIDRequestService; n > 1 && y; --n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_PDPDescriptor_DEL_AssertionIDRequestService) */

void zxmd_md_PDPDescriptor_DEL_AssertionIDRequestService(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zxmd_md_AssertionIDRequestService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AssertionIDRequestService = (struct zxmd_md_AssertionIDRequestService_s*)x->AssertionIDRequestService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AssertionIDRequestService_s*)x->AssertionIDRequestService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AssertionIDRequestService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AssertionIDRequestService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_PDPDescriptor_NUM_NameIDFormat) */

int zxmd_md_PDPDescriptor_NUM_NameIDFormat(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->NameIDFormat; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_md_PDPDescriptor_GET_NameIDFormat) */

struct zx_elem_s* zxmd_md_PDPDescriptor_GET_NameIDFormat(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->NameIDFormat; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_POP_NameIDFormat) */

struct zx_elem_s* zxmd_md_PDPDescriptor_POP_NameIDFormat(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->NameIDFormat;
  if (y)
    x->NameIDFormat = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_PDPDescriptor_PUSH_NameIDFormat) */

void zxmd_md_PDPDescriptor_PUSH_NameIDFormat(struct zxmd_md_PDPDescriptor_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->NameIDFormat->g;
  x->NameIDFormat = z;
}

/* FUNC(zxmd_md_PDPDescriptor_REV_NameIDFormat) */

void zxmd_md_PDPDescriptor_REV_NameIDFormat(struct zxmd_md_PDPDescriptor_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->NameIDFormat;
  if (!y) return;
  x->NameIDFormat = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_PUT_NameIDFormat) */

void zxmd_md_PDPDescriptor_PUT_NameIDFormat(struct zxmd_md_PDPDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->NameIDFormat;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->NameIDFormat = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_PDPDescriptor_ADD_NameIDFormat) */

void zxmd_md_PDPDescriptor_ADD_NameIDFormat(struct zxmd_md_PDPDescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = z;
    return;
  case -1:
    y = x->NameIDFormat;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

