gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_PDPDescriptor_DEL_NameIDFormat) */

void zxmd_md_PDPDescriptor_DEL_NameIDFormat(struct zxmd_md_PDPDescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->NameIDFormat = (struct zx_elem_s*)x->NameIDFormat->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->NameIDFormat;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}








/* FUNC(zxmd_md_RequestedAttribute_NUM_AttributeValue) */

int zxmd_md_RequestedAttribute_NUM_AttributeValue(struct zxmd_md_RequestedAttribute_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AttributeValue; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_md_RequestedAttribute_GET_AttributeValue) */

struct zx_elem_s* zxmd_md_RequestedAttribute_GET_AttributeValue(struct zxmd_md_RequestedAttribute_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->AttributeValue; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_RequestedAttribute_POP_AttributeValue) */

struct zx_elem_s* zxmd_md_RequestedAttribute_POP_AttributeValue(struct zxmd_md_RequestedAttribute_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->AttributeValue;
  if (y)
    x->AttributeValue = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_RequestedAttribute_PUSH_AttributeValue) */

void zxmd_md_RequestedAttribute_PUSH_AttributeValue(struct zxmd_md_RequestedAttribute_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->AttributeValue->g;
  x->AttributeValue = z;
}

/* FUNC(zxmd_md_RequestedAttribute_REV_AttributeValue) */

void zxmd_md_RequestedAttribute_REV_AttributeValue(struct zxmd_md_RequestedAttribute_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->AttributeValue;
  if (!y) return;
  x->AttributeValue = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->AttributeValue->g;
    x->AttributeValue = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_RequestedAttribute_PUT_AttributeValue) */

void zxmd_md_RequestedAttribute_PUT_AttributeValue(struct zxmd_md_RequestedAttribute_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->AttributeValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->AttributeValue = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_RequestedAttribute_ADD_AttributeValue) */

void zxmd_md_RequestedAttribute_ADD_AttributeValue(struct zxmd_md_RequestedAttribute_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->AttributeValue->g;
    x->AttributeValue = z;
    return;
  case -1:
    y = x->AttributeValue;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AttributeValue; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_RequestedAttribute_DEL_AttributeValue) */

void zxmd_md_RequestedAttribute_DEL_AttributeValue(struct zxmd_md_RequestedAttribute_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AttributeValue = (struct zx_elem_s*)x->AttributeValue->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->AttributeValue;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AttributeValue; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}

/* FUNC(zxmd_md_RequestedAttribute_GET_Name) */
struct zx_str_s* zxmd_md_RequestedAttribute_GET_Name(struct zxmd_md_RequestedAttribute_s* x) { return x->Name; }
/* FUNC(zxmd_md_RequestedAttribute_PUT_Name) */
void zxmd_md_RequestedAttribute_PUT_Name(struct zxmd_md_RequestedAttribute_s* x, struct zx_str_s* y) { x->Name = y; }
/* FUNC(zxmd_md_RequestedAttribute_GET_NameFormat) */
struct zx_str_s* zxmd_md_RequestedAttribute_GET_NameFormat(struct zxmd_md_RequestedAttribute_s* x) { return x->NameFormat; }
/* FUNC(zxmd_md_RequestedAttribute_PUT_NameFormat) */
void zxmd_md_RequestedAttribute_PUT_NameFormat(struct zxmd_md_RequestedAttribute_s* x, struct zx_str_s* y) { x->NameFormat = y; }
/* FUNC(zxmd_md_RequestedAttribute_GET_FriendlyName) */
struct zx_str_s* zxmd_md_RequestedAttribute_GET_FriendlyName(struct zxmd_md_RequestedAttribute_s* x) { return x->FriendlyName; }
/* FUNC(zxmd_md_RequestedAttribute_PUT_FriendlyName) */
void zxmd_md_RequestedAttribute_PUT_FriendlyName(struct zxmd_md_RequestedAttribute_s* x, struct zx_str_s* y) { x->FriendlyName = y; }
/* FUNC(zxmd_md_RequestedAttribute_GET_isRequired) */
struct zx_str_s* zxmd_md_RequestedAttribute_GET_isRequired(struct zxmd_md_RequestedAttribute_s* x) { return x->isRequired; }
/* FUNC(zxmd_md_RequestedAttribute_PUT_isRequired) */
void zxmd_md_RequestedAttribute_PUT_isRequired(struct zxmd_md_RequestedAttribute_s* x, struct zx_str_s* y) { x->isRequired = y; }







/* FUNC(zxmd_md_RoleDescriptor_NUM_Signature) */

int zxmd_md_RoleDescriptor_NUM_Signature(struct zxmd_md_RoleDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Signature; y; ++n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_RoleDescriptor_GET_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_RoleDescriptor_GET_Signature(struct zxmd_md_RoleDescriptor_s* x, int n)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  for (y = x->Signature; n>=0 && y; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_RoleDescriptor_POP_Signature) */

struct zxmd_ds_Signature_s* zxmd_md_RoleDescriptor_POP_Signature(struct zxmd_md_RoleDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return 0;
  y = x->Signature;
  if (y)
    x->Signature = (struct zxmd_ds_Signature_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_RoleDescriptor_PUSH_Signature) */

void zxmd_md_RoleDescriptor_PUSH_Signature(struct zxmd_md_RoleDescriptor_s* x, struct zxmd_ds_Signature_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Signature->gg.g;
  x->Signature = z;
}

/* FUNC(zxmd_md_RoleDescriptor_REV_Signature) */

void zxmd_md_RoleDescriptor_REV_Signature(struct zxmd_md_RoleDescriptor_s* x)
{
  struct zxmd_ds_Signature_s* nxt;
  struct zxmd_ds_Signature_s* y;
  if (!x) return;
  y = x->Signature;
  if (!y) return;
  x->Signature = 0;
  while (y) {
    nxt = (struct zxmd_ds_Signature_s*)y->gg.g.n;
    y->gg.g.n = &x->Signature->gg.g;
    x->Signature = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_RoleDescriptor_PUT_Signature) */

void zxmd_md_RoleDescriptor_PUT_Signature(struct zxmd_md_RoleDescriptor_s* x, int n, struct zxmd_ds_Signature_s* z)
{
  struct zxmd_ds_Signature_s* y;
  if (!x || !z) return;
  y = x->Signature;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Signature = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_RoleDescriptor_ADD_Signature) */

void zxmd_md_RoleDescriptor_ADD_Signature(struct zxmd_md_RoleDescriptor_s* x, int n, struct zxmd_ds_Signature_s* z)
{
  struct zxmd_ds_Signature_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Signature->gg.g;
    x->Signature = z;
    return;
  case -1:
    y = x->Signature;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Signature; n > 1 && y; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_RoleDescriptor_DEL_Signature) */

void zxmd_md_RoleDescriptor_DEL_Signature(struct zxmd_md_RoleDescriptor_s* x, int n)
{
  struct zxmd_ds_Signature_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Signature = (struct zxmd_ds_Signature_s*)x->Signature->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_Signature_s*)x->Signature;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Signature; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Signature_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_RoleDescriptor_NUM_Extensions) */

