gitpan/zxid/c/saml2md-getput.c
int zxmd_md_RoleDescriptor_NUM_Extensions(struct zxmd_md_RoleDescriptor_s* x)
{
  struct zxmd_md_Extensions_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Extensions; y; ++n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_RoleDescriptor_GET_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_RoleDescriptor_GET_Extensions(struct zxmd_md_RoleDescriptor_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  for (y = x->Extensions; n>=0 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_RoleDescriptor_POP_Extensions) */

struct zxmd_md_Extensions_s* zxmd_md_RoleDescriptor_POP_Extensions(struct zxmd_md_RoleDescriptor_s* x)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return 0;
  y = x->Extensions;
  if (y)
    x->Extensions = (struct zxmd_md_Extensions_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_RoleDescriptor_PUSH_Extensions) */

void zxmd_md_RoleDescriptor_PUSH_Extensions(struct zxmd_md_RoleDescriptor_s* x, struct zxmd_md_Extensions_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Extensions->gg.g;
  x->Extensions = z;
}

/* FUNC(zxmd_md_RoleDescriptor_REV_Extensions) */

void zxmd_md_RoleDescriptor_REV_Extensions(struct zxmd_md_RoleDescriptor_s* x)
{
  struct zxmd_md_Extensions_s* nxt;
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  y = x->Extensions;
  if (!y) return;
  x->Extensions = 0;
  while (y) {
    nxt = (struct zxmd_md_Extensions_s*)y->gg.g.n;
    y->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_RoleDescriptor_PUT_Extensions) */

void zxmd_md_RoleDescriptor_PUT_Extensions(struct zxmd_md_RoleDescriptor_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  y = x->Extensions;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Extensions = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_RoleDescriptor_ADD_Extensions) */

void zxmd_md_RoleDescriptor_ADD_Extensions(struct zxmd_md_RoleDescriptor_s* x, int n, struct zxmd_md_Extensions_s* z)
{
  struct zxmd_md_Extensions_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Extensions->gg.g;
    x->Extensions = z;
    return;
  case -1:
    y = x->Extensions;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_RoleDescriptor_DEL_Extensions) */

void zxmd_md_RoleDescriptor_DEL_Extensions(struct zxmd_md_RoleDescriptor_s* x, int n)
{
  struct zxmd_md_Extensions_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Extensions = (struct zxmd_md_Extensions_s*)x->Extensions->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_Extensions_s*)x->Extensions;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Extensions; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_Extensions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_RoleDescriptor_NUM_KeyDescriptor) */

int zxmd_md_RoleDescriptor_NUM_KeyDescriptor(struct zxmd_md_RoleDescriptor_s* x)
{
  struct zxmd_md_KeyDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KeyDescriptor; y; ++n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_RoleDescriptor_GET_KeyDescriptor) */

struct zxmd_md_KeyDescriptor_s* zxmd_md_RoleDescriptor_GET_KeyDescriptor(struct zxmd_md_RoleDescriptor_s* x, int n)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x) return 0;
  for (y = x->KeyDescriptor; n>=0 && y; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_RoleDescriptor_POP_KeyDescriptor) */

struct zxmd_md_KeyDescriptor_s* zxmd_md_RoleDescriptor_POP_KeyDescriptor(struct zxmd_md_RoleDescriptor_s* x)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x) return 0;
  y = x->KeyDescriptor;
  if (y)
    x->KeyDescriptor = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_RoleDescriptor_PUSH_KeyDescriptor) */

void zxmd_md_RoleDescriptor_PUSH_KeyDescriptor(struct zxmd_md_RoleDescriptor_s* x, struct zxmd_md_KeyDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->KeyDescriptor->gg.g;
  x->KeyDescriptor = z;
}

/* FUNC(zxmd_md_RoleDescriptor_REV_KeyDescriptor) */

void zxmd_md_RoleDescriptor_REV_KeyDescriptor(struct zxmd_md_RoleDescriptor_s* x)
{
  struct zxmd_md_KeyDescriptor_s* nxt;
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x) return;
  y = x->KeyDescriptor;
  if (!y) return;
  x->KeyDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->KeyDescriptor->gg.g;
    x->KeyDescriptor = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_RoleDescriptor_PUT_KeyDescriptor) */

void zxmd_md_RoleDescriptor_PUT_KeyDescriptor(struct zxmd_md_RoleDescriptor_s* x, int n, struct zxmd_md_KeyDescriptor_s* z)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x || !z) return;
  y = x->KeyDescriptor;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->KeyDescriptor = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_RoleDescriptor_ADD_KeyDescriptor) */

void zxmd_md_RoleDescriptor_ADD_KeyDescriptor(struct zxmd_md_RoleDescriptor_s* x, int n, struct zxmd_md_KeyDescriptor_s* z)
{
  struct zxmd_md_KeyDescriptor_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->KeyDescriptor->gg.g;
    x->KeyDescriptor = z;
    return;
  case -1:
    y = x->KeyDescriptor;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyDescriptor; n > 1 && y; --n, y = (struct zxmd_md_KeyDescriptor_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

