gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_SPSSODescriptor_NUM_ArtifactResolutionService) */

int zxmd_md_SPSSODescriptor_NUM_ArtifactResolutionService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_ArtifactResolutionService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ArtifactResolutionService; y; ++n, y = (struct zxmd_md_ArtifactResolutionService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_SPSSODescriptor_GET_ArtifactResolutionService) */

struct zxmd_md_ArtifactResolutionService_s* zxmd_md_SPSSODescriptor_GET_ArtifactResolutionService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_ArtifactResolutionService_s* y;
  if (!x) return 0;
  for (y = x->ArtifactResolutionService; n>=0 && y; --n, y = (struct zxmd_md_ArtifactResolutionService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_POP_ArtifactResolutionService) */

struct zxmd_md_ArtifactResolutionService_s* zxmd_md_SPSSODescriptor_POP_ArtifactResolutionService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_ArtifactResolutionService_s* y;
  if (!x) return 0;
  y = x->ArtifactResolutionService;
  if (y)
    x->ArtifactResolutionService = (struct zxmd_md_ArtifactResolutionService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_PUSH_ArtifactResolutionService) */

void zxmd_md_SPSSODescriptor_PUSH_ArtifactResolutionService(struct zxmd_md_SPSSODescriptor_s* x, struct zxmd_md_ArtifactResolutionService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ArtifactResolutionService->gg.g;
  x->ArtifactResolutionService = z;
}

/* FUNC(zxmd_md_SPSSODescriptor_REV_ArtifactResolutionService) */

void zxmd_md_SPSSODescriptor_REV_ArtifactResolutionService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_ArtifactResolutionService_s* nxt;
  struct zxmd_md_ArtifactResolutionService_s* y;
  if (!x) return;
  y = x->ArtifactResolutionService;
  if (!y) return;
  x->ArtifactResolutionService = 0;
  while (y) {
    nxt = (struct zxmd_md_ArtifactResolutionService_s*)y->gg.g.n;
    y->gg.g.n = &x->ArtifactResolutionService->gg.g;
    x->ArtifactResolutionService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_PUT_ArtifactResolutionService) */

void zxmd_md_SPSSODescriptor_PUT_ArtifactResolutionService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_ArtifactResolutionService_s* z)
{
  struct zxmd_md_ArtifactResolutionService_s* y;
  if (!x || !z) return;
  y = x->ArtifactResolutionService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ArtifactResolutionService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ArtifactResolutionService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_ADD_ArtifactResolutionService) */

void zxmd_md_SPSSODescriptor_ADD_ArtifactResolutionService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_ArtifactResolutionService_s* z)
{
  struct zxmd_md_ArtifactResolutionService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ArtifactResolutionService->gg.g;
    x->ArtifactResolutionService = z;
    return;
  case -1:
    y = x->ArtifactResolutionService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_ArtifactResolutionService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ArtifactResolutionService; n > 1 && y; --n, y = (struct zxmd_md_ArtifactResolutionService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_SPSSODescriptor_DEL_ArtifactResolutionService) */

void zxmd_md_SPSSODescriptor_DEL_ArtifactResolutionService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_ArtifactResolutionService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ArtifactResolutionService = (struct zxmd_md_ArtifactResolutionService_s*)x->ArtifactResolutionService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_ArtifactResolutionService_s*)x->ArtifactResolutionService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_ArtifactResolutionService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ArtifactResolutionService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ArtifactResolutionService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_SPSSODescriptor_NUM_SingleLogoutService) */

int zxmd_md_SPSSODescriptor_NUM_SingleLogoutService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_SingleLogoutService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SingleLogoutService; y; ++n, y = (struct zxmd_md_SingleLogoutService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_SPSSODescriptor_GET_SingleLogoutService) */

struct zxmd_md_SingleLogoutService_s* zxmd_md_SPSSODescriptor_GET_SingleLogoutService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_SingleLogoutService_s* y;
  if (!x) return 0;
  for (y = x->SingleLogoutService; n>=0 && y; --n, y = (struct zxmd_md_SingleLogoutService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_POP_SingleLogoutService) */

struct zxmd_md_SingleLogoutService_s* zxmd_md_SPSSODescriptor_POP_SingleLogoutService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_SingleLogoutService_s* y;
  if (!x) return 0;
  y = x->SingleLogoutService;
  if (y)
    x->SingleLogoutService = (struct zxmd_md_SingleLogoutService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_PUSH_SingleLogoutService) */

void zxmd_md_SPSSODescriptor_PUSH_SingleLogoutService(struct zxmd_md_SPSSODescriptor_s* x, struct zxmd_md_SingleLogoutService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SingleLogoutService->gg.g;
  x->SingleLogoutService = z;
}

/* FUNC(zxmd_md_SPSSODescriptor_REV_SingleLogoutService) */

void zxmd_md_SPSSODescriptor_REV_SingleLogoutService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_SingleLogoutService_s* nxt;
  struct zxmd_md_SingleLogoutService_s* y;
  if (!x) return;
  y = x->SingleLogoutService;
  if (!y) return;
  x->SingleLogoutService = 0;
  while (y) {
    nxt = (struct zxmd_md_SingleLogoutService_s*)y->gg.g.n;
    y->gg.g.n = &x->SingleLogoutService->gg.g;
    x->SingleLogoutService = y;
    y = nxt;
  }
}

