gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_SPSSODescriptor_PUT_SingleLogoutService) */

void zxmd_md_SPSSODescriptor_PUT_SingleLogoutService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_SingleLogoutService_s* z)
{
  struct zxmd_md_SingleLogoutService_s* y;
  if (!x || !z) return;
  y = x->SingleLogoutService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SingleLogoutService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_SingleLogoutService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_ADD_SingleLogoutService) */

void zxmd_md_SPSSODescriptor_ADD_SingleLogoutService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_SingleLogoutService_s* z)
{
  struct zxmd_md_SingleLogoutService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SingleLogoutService->gg.g;
    x->SingleLogoutService = z;
    return;
  case -1:
    y = x->SingleLogoutService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_SingleLogoutService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SingleLogoutService; n > 1 && y; --n, y = (struct zxmd_md_SingleLogoutService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_SPSSODescriptor_DEL_SingleLogoutService) */

void zxmd_md_SPSSODescriptor_DEL_SingleLogoutService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_SingleLogoutService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SingleLogoutService = (struct zxmd_md_SingleLogoutService_s*)x->SingleLogoutService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_SingleLogoutService_s*)x->SingleLogoutService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_SingleLogoutService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SingleLogoutService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_SingleLogoutService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_SPSSODescriptor_NUM_ManageNameIDService) */

int zxmd_md_SPSSODescriptor_NUM_ManageNameIDService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_ManageNameIDService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ManageNameIDService; y; ++n, y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_SPSSODescriptor_GET_ManageNameIDService) */

struct zxmd_md_ManageNameIDService_s* zxmd_md_SPSSODescriptor_GET_ManageNameIDService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x) return 0;
  for (y = x->ManageNameIDService; n>=0 && y; --n, y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_POP_ManageNameIDService) */

struct zxmd_md_ManageNameIDService_s* zxmd_md_SPSSODescriptor_POP_ManageNameIDService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x) return 0;
  y = x->ManageNameIDService;
  if (y)
    x->ManageNameIDService = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_PUSH_ManageNameIDService) */

void zxmd_md_SPSSODescriptor_PUSH_ManageNameIDService(struct zxmd_md_SPSSODescriptor_s* x, struct zxmd_md_ManageNameIDService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ManageNameIDService->gg.g;
  x->ManageNameIDService = z;
}

/* FUNC(zxmd_md_SPSSODescriptor_REV_ManageNameIDService) */

void zxmd_md_SPSSODescriptor_REV_ManageNameIDService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_ManageNameIDService_s* nxt;
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x) return;
  y = x->ManageNameIDService;
  if (!y) return;
  x->ManageNameIDService = 0;
  while (y) {
    nxt = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n;
    y->gg.g.n = &x->ManageNameIDService->gg.g;
    x->ManageNameIDService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_PUT_ManageNameIDService) */

void zxmd_md_SPSSODescriptor_PUT_ManageNameIDService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_ManageNameIDService_s* z)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x || !z) return;
  y = x->ManageNameIDService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ManageNameIDService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_ADD_ManageNameIDService) */

void zxmd_md_SPSSODescriptor_ADD_ManageNameIDService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_ManageNameIDService_s* z)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ManageNameIDService->gg.g;
    x->ManageNameIDService = z;
    return;
  case -1:
    y = x->ManageNameIDService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ManageNameIDService; n > 1 && y; --n, y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_SPSSODescriptor_DEL_ManageNameIDService) */

void zxmd_md_SPSSODescriptor_DEL_ManageNameIDService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_ManageNameIDService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ManageNameIDService = (struct zxmd_md_ManageNameIDService_s*)x->ManageNameIDService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_ManageNameIDService_s*)x->ManageNameIDService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ManageNameIDService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_ManageNameIDService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_SPSSODescriptor_NUM_NameIDFormat) */

int zxmd_md_SPSSODescriptor_NUM_NameIDFormat(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->NameIDFormat; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

