gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_md_SPSSODescriptor_GET_NameIDFormat) */

struct zx_elem_s* zxmd_md_SPSSODescriptor_GET_NameIDFormat(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->NameIDFormat; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_POP_NameIDFormat) */

struct zx_elem_s* zxmd_md_SPSSODescriptor_POP_NameIDFormat(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->NameIDFormat;
  if (y)
    x->NameIDFormat = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_PUSH_NameIDFormat) */

void zxmd_md_SPSSODescriptor_PUSH_NameIDFormat(struct zxmd_md_SPSSODescriptor_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->NameIDFormat->g;
  x->NameIDFormat = z;
}

/* FUNC(zxmd_md_SPSSODescriptor_REV_NameIDFormat) */

void zxmd_md_SPSSODescriptor_REV_NameIDFormat(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->NameIDFormat;
  if (!y) return;
  x->NameIDFormat = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_PUT_NameIDFormat) */

void zxmd_md_SPSSODescriptor_PUT_NameIDFormat(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->NameIDFormat;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->NameIDFormat = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_ADD_NameIDFormat) */

void zxmd_md_SPSSODescriptor_ADD_NameIDFormat(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->NameIDFormat->g;
    x->NameIDFormat = z;
    return;
  case -1:
    y = x->NameIDFormat;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_md_SPSSODescriptor_DEL_NameIDFormat) */

void zxmd_md_SPSSODescriptor_DEL_NameIDFormat(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->NameIDFormat = (struct zx_elem_s*)x->NameIDFormat->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->NameIDFormat;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->NameIDFormat; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_md_SPSSODescriptor_NUM_AssertionConsumerService) */

int zxmd_md_SPSSODescriptor_NUM_AssertionConsumerService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_AssertionConsumerService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AssertionConsumerService; y; ++n, y = (struct zxmd_md_AssertionConsumerService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_SPSSODescriptor_GET_AssertionConsumerService) */

struct zxmd_md_AssertionConsumerService_s* zxmd_md_SPSSODescriptor_GET_AssertionConsumerService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_AssertionConsumerService_s* y;
  if (!x) return 0;
  for (y = x->AssertionConsumerService; n>=0 && y; --n, y = (struct zxmd_md_AssertionConsumerService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_POP_AssertionConsumerService) */

struct zxmd_md_AssertionConsumerService_s* zxmd_md_SPSSODescriptor_POP_AssertionConsumerService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_AssertionConsumerService_s* y;
  if (!x) return 0;
  y = x->AssertionConsumerService;
  if (y)
    x->AssertionConsumerService = (struct zxmd_md_AssertionConsumerService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_PUSH_AssertionConsumerService) */

void zxmd_md_SPSSODescriptor_PUSH_AssertionConsumerService(struct zxmd_md_SPSSODescriptor_s* x, struct zxmd_md_AssertionConsumerService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AssertionConsumerService->gg.g;
  x->AssertionConsumerService = z;
}

/* FUNC(zxmd_md_SPSSODescriptor_REV_AssertionConsumerService) */

void zxmd_md_SPSSODescriptor_REV_AssertionConsumerService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_AssertionConsumerService_s* nxt;
  struct zxmd_md_AssertionConsumerService_s* y;
  if (!x) return;
  y = x->AssertionConsumerService;
  if (!y) return;
  x->AssertionConsumerService = 0;
  while (y) {
    nxt = (struct zxmd_md_AssertionConsumerService_s*)y->gg.g.n;
    y->gg.g.n = &x->AssertionConsumerService->gg.g;
    x->AssertionConsumerService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_PUT_AssertionConsumerService) */

void zxmd_md_SPSSODescriptor_PUT_AssertionConsumerService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_AssertionConsumerService_s* z)
{
  struct zxmd_md_AssertionConsumerService_s* y;
  if (!x || !z) return;
  y = x->AssertionConsumerService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AssertionConsumerService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AssertionConsumerService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_ADD_AssertionConsumerService) */

void zxmd_md_SPSSODescriptor_ADD_AssertionConsumerService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_AssertionConsumerService_s* z)
{
  struct zxmd_md_AssertionConsumerService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AssertionConsumerService->gg.g;
    x->AssertionConsumerService = z;
    return;
  case -1:
    y = x->AssertionConsumerService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AssertionConsumerService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AssertionConsumerService; n > 1 && y; --n, y = (struct zxmd_md_AssertionConsumerService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_SPSSODescriptor_DEL_AssertionConsumerService) */

void zxmd_md_SPSSODescriptor_DEL_AssertionConsumerService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_AssertionConsumerService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AssertionConsumerService = (struct zxmd_md_AssertionConsumerService_s*)x->AssertionConsumerService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AssertionConsumerService_s*)x->AssertionConsumerService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AssertionConsumerService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AssertionConsumerService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AssertionConsumerService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_md_SPSSODescriptor_NUM_AttributeConsumingService) */

