gitpan/zxid/c/saml2md-getput.c
int zxmd_md_SPSSODescriptor_NUM_AttributeConsumingService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_AttributeConsumingService_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AttributeConsumingService; y; ++n, y = (struct zxmd_md_AttributeConsumingService_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_md_SPSSODescriptor_GET_AttributeConsumingService) */

struct zxmd_md_AttributeConsumingService_s* zxmd_md_SPSSODescriptor_GET_AttributeConsumingService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_AttributeConsumingService_s* y;
  if (!x) return 0;
  for (y = x->AttributeConsumingService; n>=0 && y; --n, y = (struct zxmd_md_AttributeConsumingService_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_POP_AttributeConsumingService) */

struct zxmd_md_AttributeConsumingService_s* zxmd_md_SPSSODescriptor_POP_AttributeConsumingService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_AttributeConsumingService_s* y;
  if (!x) return 0;
  y = x->AttributeConsumingService;
  if (y)
    x->AttributeConsumingService = (struct zxmd_md_AttributeConsumingService_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_md_SPSSODescriptor_PUSH_AttributeConsumingService) */

void zxmd_md_SPSSODescriptor_PUSH_AttributeConsumingService(struct zxmd_md_SPSSODescriptor_s* x, struct zxmd_md_AttributeConsumingService_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AttributeConsumingService->gg.g;
  x->AttributeConsumingService = z;
}

/* FUNC(zxmd_md_SPSSODescriptor_REV_AttributeConsumingService) */

void zxmd_md_SPSSODescriptor_REV_AttributeConsumingService(struct zxmd_md_SPSSODescriptor_s* x)
{
  struct zxmd_md_AttributeConsumingService_s* nxt;
  struct zxmd_md_AttributeConsumingService_s* y;
  if (!x) return;
  y = x->AttributeConsumingService;
  if (!y) return;
  x->AttributeConsumingService = 0;
  while (y) {
    nxt = (struct zxmd_md_AttributeConsumingService_s*)y->gg.g.n;
    y->gg.g.n = &x->AttributeConsumingService->gg.g;
    x->AttributeConsumingService = y;
    y = nxt;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_PUT_AttributeConsumingService) */

void zxmd_md_SPSSODescriptor_PUT_AttributeConsumingService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_AttributeConsumingService_s* z)
{
  struct zxmd_md_AttributeConsumingService_s* y;
  if (!x || !z) return;
  y = x->AttributeConsumingService;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AttributeConsumingService = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AttributeConsumingService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_md_SPSSODescriptor_ADD_AttributeConsumingService) */

void zxmd_md_SPSSODescriptor_ADD_AttributeConsumingService(struct zxmd_md_SPSSODescriptor_s* x, int n, struct zxmd_md_AttributeConsumingService_s* z)
{
  struct zxmd_md_AttributeConsumingService_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AttributeConsumingService->gg.g;
    x->AttributeConsumingService = z;
    return;
  case -1:
    y = x->AttributeConsumingService;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_md_AttributeConsumingService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AttributeConsumingService; n > 1 && y; --n, y = (struct zxmd_md_AttributeConsumingService_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_md_SPSSODescriptor_DEL_AttributeConsumingService) */

void zxmd_md_SPSSODescriptor_DEL_AttributeConsumingService(struct zxmd_md_SPSSODescriptor_s* x, int n)
{
  struct zxmd_md_AttributeConsumingService_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AttributeConsumingService = (struct zxmd_md_AttributeConsumingService_s*)x->AttributeConsumingService->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_md_AttributeConsumingService_s*)x->AttributeConsumingService;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_md_AttributeConsumingService_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AttributeConsumingService; n > 1 && y->gg.g.n; --n, y = (struct zxmd_md_AttributeConsumingService_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_md_SPSSODescriptor_GET_AuthnRequestsSigned) */
struct zx_str_s* zxmd_md_SPSSODescriptor_GET_AuthnRequestsSigned(struct zxmd_md_SPSSODescriptor_s* x) { return x->AuthnRequestsSigned; }
/* FUNC(zxmd_md_SPSSODescriptor_PUT_AuthnRequestsSigned) */
void zxmd_md_SPSSODescriptor_PUT_AuthnRequestsSigned(struct zxmd_md_SPSSODescriptor_s* x, struct zx_str_s* y) { x->AuthnRequestsSigned = y; }
/* FUNC(zxmd_md_SPSSODescriptor_GET_WantAssertionsSigned) */
struct zx_str_s* zxmd_md_SPSSODescriptor_GET_WantAssertionsSigned(struct zxmd_md_SPSSODescriptor_s* x) { return x->WantAssertionsSigned; }
/* FUNC(zxmd_md_SPSSODescriptor_PUT_WantAssertionsSigned) */
void zxmd_md_SPSSODescriptor_PUT_WantAssertionsSigned(struct zxmd_md_SPSSODescriptor_s* x, struct zx_str_s* y) { x->WantAssertionsSigned = y; }





/* FUNC(zxmd_md_ServiceDescription_GET_lang) */
struct zx_str_s* zxmd_md_ServiceDescription_GET_lang(struct zxmd_md_ServiceDescription_s* x) { return x->lang; }
/* FUNC(zxmd_md_ServiceDescription_PUT_lang) */
void zxmd_md_ServiceDescription_PUT_lang(struct zxmd_md_ServiceDescription_s* x, struct zx_str_s* y) { x->lang = y; }





/* FUNC(zxmd_md_ServiceName_GET_lang) */
struct zx_str_s* zxmd_md_ServiceName_GET_lang(struct zxmd_md_ServiceName_s* x) { return x->lang; }
/* FUNC(zxmd_md_ServiceName_PUT_lang) */
void zxmd_md_ServiceName_PUT_lang(struct zxmd_md_ServiceName_s* x, struct zx_str_s* y) { x->lang = y; }





/* FUNC(zxmd_md_SingleLogoutService_GET_Binding) */
struct zx_str_s* zxmd_md_SingleLogoutService_GET_Binding(struct zxmd_md_SingleLogoutService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_SingleLogoutService_PUT_Binding) */
void zxmd_md_SingleLogoutService_PUT_Binding(struct zxmd_md_SingleLogoutService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_SingleLogoutService_GET_Location) */
struct zx_str_s* zxmd_md_SingleLogoutService_GET_Location(struct zxmd_md_SingleLogoutService_s* x) { return x->Location; }
/* FUNC(zxmd_md_SingleLogoutService_PUT_Location) */
void zxmd_md_SingleLogoutService_PUT_Location(struct zxmd_md_SingleLogoutService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_SingleLogoutService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_SingleLogoutService_GET_ResponseLocation(struct zxmd_md_SingleLogoutService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_SingleLogoutService_PUT_ResponseLocation) */
void zxmd_md_SingleLogoutService_PUT_ResponseLocation(struct zxmd_md_SingleLogoutService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }





/* FUNC(zxmd_md_SingleSignOnService_GET_Binding) */
struct zx_str_s* zxmd_md_SingleSignOnService_GET_Binding(struct zxmd_md_SingleSignOnService_s* x) { return x->Binding; }
/* FUNC(zxmd_md_SingleSignOnService_PUT_Binding) */
void zxmd_md_SingleSignOnService_PUT_Binding(struct zxmd_md_SingleSignOnService_s* x, struct zx_str_s* y) { x->Binding = y; }
/* FUNC(zxmd_md_SingleSignOnService_GET_Location) */
struct zx_str_s* zxmd_md_SingleSignOnService_GET_Location(struct zxmd_md_SingleSignOnService_s* x) { return x->Location; }
/* FUNC(zxmd_md_SingleSignOnService_PUT_Location) */
void zxmd_md_SingleSignOnService_PUT_Location(struct zxmd_md_SingleSignOnService_s* x, struct zx_str_s* y) { x->Location = y; }
/* FUNC(zxmd_md_SingleSignOnService_GET_ResponseLocation) */
struct zx_str_s* zxmd_md_SingleSignOnService_GET_ResponseLocation(struct zxmd_md_SingleSignOnService_s* x) { return x->ResponseLocation; }
/* FUNC(zxmd_md_SingleSignOnService_PUT_ResponseLocation) */
void zxmd_md_SingleSignOnService_PUT_ResponseLocation(struct zxmd_md_SingleSignOnService_s* x, struct zx_str_s* y) { x->ResponseLocation = y; }





/* FUNC(zxmd_sa_Action_GET_Namespace) */
struct zx_str_s* zxmd_sa_Action_GET_Namespace(struct zxmd_sa_Action_s* x) { return x->Namespace; }
/* FUNC(zxmd_sa_Action_PUT_Namespace) */
void zxmd_sa_Action_PUT_Namespace(struct zxmd_sa_Action_s* x, struct zx_str_s* y) { x->Namespace = y; }







