gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_sa_Advice_POP_Assertion) */

struct zxmd_sa_Assertion_s* zxmd_sa_Advice_POP_Assertion(struct zxmd_sa_Advice_s* x)
{
  struct zxmd_sa_Assertion_s* y;
  if (!x) return 0;
  y = x->Assertion;
  if (y)
    x->Assertion = (struct zxmd_sa_Assertion_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_Advice_PUSH_Assertion) */

void zxmd_sa_Advice_PUSH_Assertion(struct zxmd_sa_Advice_s* x, struct zxmd_sa_Assertion_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Assertion->gg.g;
  x->Assertion = z;
}

/* FUNC(zxmd_sa_Advice_REV_Assertion) */

void zxmd_sa_Advice_REV_Assertion(struct zxmd_sa_Advice_s* x)
{
  struct zxmd_sa_Assertion_s* nxt;
  struct zxmd_sa_Assertion_s* y;
  if (!x) return;
  y = x->Assertion;
  if (!y) return;
  x->Assertion = 0;
  while (y) {
    nxt = (struct zxmd_sa_Assertion_s*)y->gg.g.n;
    y->gg.g.n = &x->Assertion->gg.g;
    x->Assertion = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_Advice_PUT_Assertion) */

void zxmd_sa_Advice_PUT_Assertion(struct zxmd_sa_Advice_s* x, int n, struct zxmd_sa_Assertion_s* z)
{
  struct zxmd_sa_Assertion_s* y;
  if (!x || !z) return;
  y = x->Assertion;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Assertion = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Assertion_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_Advice_ADD_Assertion) */

void zxmd_sa_Advice_ADD_Assertion(struct zxmd_sa_Advice_s* x, int n, struct zxmd_sa_Assertion_s* z)
{
  struct zxmd_sa_Assertion_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Assertion->gg.g;
    x->Assertion = z;
    return;
  case -1:
    y = x->Assertion;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_Assertion_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Assertion; n > 1 && y; --n, y = (struct zxmd_sa_Assertion_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_Advice_DEL_Assertion) */

void zxmd_sa_Advice_DEL_Assertion(struct zxmd_sa_Advice_s* x, int n)
{
  struct zxmd_sa_Assertion_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Assertion = (struct zxmd_sa_Assertion_s*)x->Assertion->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_Assertion_s*)x->Assertion;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_Assertion_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Assertion; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Assertion_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_Advice_NUM_EncryptedAssertion) */

int zxmd_sa_Advice_NUM_EncryptedAssertion(struct zxmd_sa_Advice_s* x)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EncryptedAssertion; y; ++n, y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_Advice_GET_EncryptedAssertion) */

struct zxmd_sa_EncryptedAssertion_s* zxmd_sa_Advice_GET_EncryptedAssertion(struct zxmd_sa_Advice_s* x, int n)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x) return 0;
  for (y = x->EncryptedAssertion; n>=0 && y; --n, y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_Advice_POP_EncryptedAssertion) */

struct zxmd_sa_EncryptedAssertion_s* zxmd_sa_Advice_POP_EncryptedAssertion(struct zxmd_sa_Advice_s* x)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x) return 0;
  y = x->EncryptedAssertion;
  if (y)
    x->EncryptedAssertion = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_Advice_PUSH_EncryptedAssertion) */

void zxmd_sa_Advice_PUSH_EncryptedAssertion(struct zxmd_sa_Advice_s* x, struct zxmd_sa_EncryptedAssertion_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptedAssertion->gg.g;
  x->EncryptedAssertion = z;
}

/* FUNC(zxmd_sa_Advice_REV_EncryptedAssertion) */

void zxmd_sa_Advice_REV_EncryptedAssertion(struct zxmd_sa_Advice_s* x)
{
  struct zxmd_sa_EncryptedAssertion_s* nxt;
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x) return;
  y = x->EncryptedAssertion;
  if (!y) return;
  x->EncryptedAssertion = 0;
  while (y) {
    nxt = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptedAssertion->gg.g;
    x->EncryptedAssertion = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_Advice_PUT_EncryptedAssertion) */

void zxmd_sa_Advice_PUT_EncryptedAssertion(struct zxmd_sa_Advice_s* x, int n, struct zxmd_sa_EncryptedAssertion_s* z)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x || !z) return;
  y = x->EncryptedAssertion;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptedAssertion = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_Advice_ADD_EncryptedAssertion) */

void zxmd_sa_Advice_ADD_EncryptedAssertion(struct zxmd_sa_Advice_s* x, int n, struct zxmd_sa_EncryptedAssertion_s* z)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EncryptedAssertion->gg.g;
    x->EncryptedAssertion = z;
    return;
  case -1:
    y = x->EncryptedAssertion;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedAssertion; n > 1 && y; --n, y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_Advice_DEL_EncryptedAssertion) */

void zxmd_sa_Advice_DEL_EncryptedAssertion(struct zxmd_sa_Advice_s* x, int n)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptedAssertion = (struct zxmd_sa_EncryptedAssertion_s*)x->EncryptedAssertion->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_EncryptedAssertion_s*)x->EncryptedAssertion;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedAssertion; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zxmd_sa_Assertion_NUM_Issuer) */

int zxmd_sa_Assertion_NUM_Issuer(struct zxmd_sa_Assertion_s* x)
{
  struct zxmd_sa_Issuer_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Issuer; y; ++n, y = (struct zxmd_sa_Issuer_s*)y->gg.g.n) ;
  return n;
}

