gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_sa_Assertion_NUM_Subject) */

int zxmd_sa_Assertion_NUM_Subject(struct zxmd_sa_Assertion_s* x)
{
  struct zxmd_sa_Subject_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Subject; y; ++n, y = (struct zxmd_sa_Subject_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_Assertion_GET_Subject) */

struct zxmd_sa_Subject_s* zxmd_sa_Assertion_GET_Subject(struct zxmd_sa_Assertion_s* x, int n)
{
  struct zxmd_sa_Subject_s* y;
  if (!x) return 0;
  for (y = x->Subject; n>=0 && y; --n, y = (struct zxmd_sa_Subject_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_Assertion_POP_Subject) */

struct zxmd_sa_Subject_s* zxmd_sa_Assertion_POP_Subject(struct zxmd_sa_Assertion_s* x)
{
  struct zxmd_sa_Subject_s* y;
  if (!x) return 0;
  y = x->Subject;
  if (y)
    x->Subject = (struct zxmd_sa_Subject_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_Assertion_PUSH_Subject) */

void zxmd_sa_Assertion_PUSH_Subject(struct zxmd_sa_Assertion_s* x, struct zxmd_sa_Subject_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Subject->gg.g;
  x->Subject = z;
}

/* FUNC(zxmd_sa_Assertion_REV_Subject) */

void zxmd_sa_Assertion_REV_Subject(struct zxmd_sa_Assertion_s* x)
{
  struct zxmd_sa_Subject_s* nxt;
  struct zxmd_sa_Subject_s* y;
  if (!x) return;
  y = x->Subject;
  if (!y) return;
  x->Subject = 0;
  while (y) {
    nxt = (struct zxmd_sa_Subject_s*)y->gg.g.n;
    y->gg.g.n = &x->Subject->gg.g;
    x->Subject = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_Assertion_PUT_Subject) */

void zxmd_sa_Assertion_PUT_Subject(struct zxmd_sa_Assertion_s* x, int n, struct zxmd_sa_Subject_s* z)
{
  struct zxmd_sa_Subject_s* y;
  if (!x || !z) return;
  y = x->Subject;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Subject = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Subject_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_Assertion_ADD_Subject) */

void zxmd_sa_Assertion_ADD_Subject(struct zxmd_sa_Assertion_s* x, int n, struct zxmd_sa_Subject_s* z)
{
  struct zxmd_sa_Subject_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Subject->gg.g;
    x->Subject = z;
    return;
  case -1:
    y = x->Subject;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_Subject_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Subject; n > 1 && y; --n, y = (struct zxmd_sa_Subject_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_Assertion_DEL_Subject) */

void zxmd_sa_Assertion_DEL_Subject(struct zxmd_sa_Assertion_s* x, int n)
{
  struct zxmd_sa_Subject_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Subject = (struct zxmd_sa_Subject_s*)x->Subject->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_Subject_s*)x->Subject;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_Subject_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Subject; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Subject_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_Assertion_NUM_Conditions) */

int zxmd_sa_Assertion_NUM_Conditions(struct zxmd_sa_Assertion_s* x)
{
  struct zxmd_sa_Conditions_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Conditions; y; ++n, y = (struct zxmd_sa_Conditions_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_Assertion_GET_Conditions) */

struct zxmd_sa_Conditions_s* zxmd_sa_Assertion_GET_Conditions(struct zxmd_sa_Assertion_s* x, int n)
{
  struct zxmd_sa_Conditions_s* y;
  if (!x) return 0;
  for (y = x->Conditions; n>=0 && y; --n, y = (struct zxmd_sa_Conditions_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_Assertion_POP_Conditions) */

struct zxmd_sa_Conditions_s* zxmd_sa_Assertion_POP_Conditions(struct zxmd_sa_Assertion_s* x)
{
  struct zxmd_sa_Conditions_s* y;
  if (!x) return 0;
  y = x->Conditions;
  if (y)
    x->Conditions = (struct zxmd_sa_Conditions_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_Assertion_PUSH_Conditions) */

void zxmd_sa_Assertion_PUSH_Conditions(struct zxmd_sa_Assertion_s* x, struct zxmd_sa_Conditions_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Conditions->gg.g;
  x->Conditions = z;
}

/* FUNC(zxmd_sa_Assertion_REV_Conditions) */

void zxmd_sa_Assertion_REV_Conditions(struct zxmd_sa_Assertion_s* x)
{
  struct zxmd_sa_Conditions_s* nxt;
  struct zxmd_sa_Conditions_s* y;
  if (!x) return;
  y = x->Conditions;
  if (!y) return;
  x->Conditions = 0;
  while (y) {
    nxt = (struct zxmd_sa_Conditions_s*)y->gg.g.n;
    y->gg.g.n = &x->Conditions->gg.g;
    x->Conditions = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_Assertion_PUT_Conditions) */

void zxmd_sa_Assertion_PUT_Conditions(struct zxmd_sa_Assertion_s* x, int n, struct zxmd_sa_Conditions_s* z)
{
  struct zxmd_sa_Conditions_s* y;
  if (!x || !z) return;
  y = x->Conditions;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Conditions = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Conditions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_Assertion_ADD_Conditions) */

void zxmd_sa_Assertion_ADD_Conditions(struct zxmd_sa_Assertion_s* x, int n, struct zxmd_sa_Conditions_s* z)
{
  struct zxmd_sa_Conditions_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Conditions->gg.g;
    x->Conditions = z;
    return;
  case -1:
    y = x->Conditions;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_Conditions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Conditions; n > 1 && y; --n, y = (struct zxmd_sa_Conditions_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_Assertion_DEL_Conditions) */

void zxmd_sa_Assertion_DEL_Conditions(struct zxmd_sa_Assertion_s* x, int n)
{
  struct zxmd_sa_Conditions_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Conditions = (struct zxmd_sa_Conditions_s*)x->Conditions->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_Conditions_s*)x->Conditions;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_Conditions_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Conditions; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Conditions_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_Assertion_NUM_Advice) */

int zxmd_sa_Assertion_NUM_Advice(struct zxmd_sa_Assertion_s* x)
{
  struct zxmd_sa_Advice_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Advice; y; ++n, y = (struct zxmd_sa_Advice_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_Assertion_GET_Advice) */

