gitpan/zxid/c/saml2md-getput.c
int zxmd_sa_AttributeStatement_NUM_Attribute(struct zxmd_sa_AttributeStatement_s* x)
{
  struct zxmd_sa_Attribute_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Attribute; y; ++n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_AttributeStatement_GET_Attribute) */

struct zxmd_sa_Attribute_s* zxmd_sa_AttributeStatement_GET_Attribute(struct zxmd_sa_AttributeStatement_s* x, int n)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x) return 0;
  for (y = x->Attribute; n>=0 && y; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_AttributeStatement_POP_Attribute) */

struct zxmd_sa_Attribute_s* zxmd_sa_AttributeStatement_POP_Attribute(struct zxmd_sa_AttributeStatement_s* x)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x) return 0;
  y = x->Attribute;
  if (y)
    x->Attribute = (struct zxmd_sa_Attribute_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_AttributeStatement_PUSH_Attribute) */

void zxmd_sa_AttributeStatement_PUSH_Attribute(struct zxmd_sa_AttributeStatement_s* x, struct zxmd_sa_Attribute_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Attribute->gg.g;
  x->Attribute = z;
}

/* FUNC(zxmd_sa_AttributeStatement_REV_Attribute) */

void zxmd_sa_AttributeStatement_REV_Attribute(struct zxmd_sa_AttributeStatement_s* x)
{
  struct zxmd_sa_Attribute_s* nxt;
  struct zxmd_sa_Attribute_s* y;
  if (!x) return;
  y = x->Attribute;
  if (!y) return;
  x->Attribute = 0;
  while (y) {
    nxt = (struct zxmd_sa_Attribute_s*)y->gg.g.n;
    y->gg.g.n = &x->Attribute->gg.g;
    x->Attribute = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_AttributeStatement_PUT_Attribute) */

void zxmd_sa_AttributeStatement_PUT_Attribute(struct zxmd_sa_AttributeStatement_s* x, int n, struct zxmd_sa_Attribute_s* z)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x || !z) return;
  y = x->Attribute;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Attribute = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_AttributeStatement_ADD_Attribute) */

void zxmd_sa_AttributeStatement_ADD_Attribute(struct zxmd_sa_AttributeStatement_s* x, int n, struct zxmd_sa_Attribute_s* z)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Attribute->gg.g;
    x->Attribute = z;
    return;
  case -1:
    y = x->Attribute;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Attribute; n > 1 && y; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_AttributeStatement_DEL_Attribute) */

void zxmd_sa_AttributeStatement_DEL_Attribute(struct zxmd_sa_AttributeStatement_s* x, int n)
{
  struct zxmd_sa_Attribute_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Attribute = (struct zxmd_sa_Attribute_s*)x->Attribute->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_Attribute_s*)x->Attribute;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Attribute; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Attribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_AttributeStatement_NUM_EncryptedAttribute) */

int zxmd_sa_AttributeStatement_NUM_EncryptedAttribute(struct zxmd_sa_AttributeStatement_s* x)
{
  struct zxmd_sa_EncryptedAttribute_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EncryptedAttribute; y; ++n, y = (struct zxmd_sa_EncryptedAttribute_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_AttributeStatement_GET_EncryptedAttribute) */

struct zxmd_sa_EncryptedAttribute_s* zxmd_sa_AttributeStatement_GET_EncryptedAttribute(struct zxmd_sa_AttributeStatement_s* x, int n)
{
  struct zxmd_sa_EncryptedAttribute_s* y;
  if (!x) return 0;
  for (y = x->EncryptedAttribute; n>=0 && y; --n, y = (struct zxmd_sa_EncryptedAttribute_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_AttributeStatement_POP_EncryptedAttribute) */

struct zxmd_sa_EncryptedAttribute_s* zxmd_sa_AttributeStatement_POP_EncryptedAttribute(struct zxmd_sa_AttributeStatement_s* x)
{
  struct zxmd_sa_EncryptedAttribute_s* y;
  if (!x) return 0;
  y = x->EncryptedAttribute;
  if (y)
    x->EncryptedAttribute = (struct zxmd_sa_EncryptedAttribute_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_AttributeStatement_PUSH_EncryptedAttribute) */

void zxmd_sa_AttributeStatement_PUSH_EncryptedAttribute(struct zxmd_sa_AttributeStatement_s* x, struct zxmd_sa_EncryptedAttribute_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptedAttribute->gg.g;
  x->EncryptedAttribute = z;
}

/* FUNC(zxmd_sa_AttributeStatement_REV_EncryptedAttribute) */

void zxmd_sa_AttributeStatement_REV_EncryptedAttribute(struct zxmd_sa_AttributeStatement_s* x)
{
  struct zxmd_sa_EncryptedAttribute_s* nxt;
  struct zxmd_sa_EncryptedAttribute_s* y;
  if (!x) return;
  y = x->EncryptedAttribute;
  if (!y) return;
  x->EncryptedAttribute = 0;
  while (y) {
    nxt = (struct zxmd_sa_EncryptedAttribute_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptedAttribute->gg.g;
    x->EncryptedAttribute = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_AttributeStatement_PUT_EncryptedAttribute) */

void zxmd_sa_AttributeStatement_PUT_EncryptedAttribute(struct zxmd_sa_AttributeStatement_s* x, int n, struct zxmd_sa_EncryptedAttribute_s* z)
{
  struct zxmd_sa_EncryptedAttribute_s* y;
  if (!x || !z) return;
  y = x->EncryptedAttribute;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptedAttribute = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_EncryptedAttribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_AttributeStatement_ADD_EncryptedAttribute) */

void zxmd_sa_AttributeStatement_ADD_EncryptedAttribute(struct zxmd_sa_AttributeStatement_s* x, int n, struct zxmd_sa_EncryptedAttribute_s* z)
{
  struct zxmd_sa_EncryptedAttribute_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EncryptedAttribute->gg.g;
    x->EncryptedAttribute = z;
    return;
  case -1:
    y = x->EncryptedAttribute;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_EncryptedAttribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedAttribute; n > 1 && y; --n, y = (struct zxmd_sa_EncryptedAttribute_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

