gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_sa_AttributeStatement_DEL_EncryptedAttribute) */

void zxmd_sa_AttributeStatement_DEL_EncryptedAttribute(struct zxmd_sa_AttributeStatement_s* x, int n)
{
  struct zxmd_sa_EncryptedAttribute_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptedAttribute = (struct zxmd_sa_EncryptedAttribute_s*)x->EncryptedAttribute->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_EncryptedAttribute_s*)x->EncryptedAttribute;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_EncryptedAttribute_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedAttribute; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_EncryptedAttribute_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zxmd_sa_AudienceRestriction_NUM_Audience) */

int zxmd_sa_AudienceRestriction_NUM_Audience(struct zxmd_sa_AudienceRestriction_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Audience; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_sa_AudienceRestriction_GET_Audience) */

struct zx_elem_s* zxmd_sa_AudienceRestriction_GET_Audience(struct zxmd_sa_AudienceRestriction_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Audience; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_sa_AudienceRestriction_POP_Audience) */

struct zx_elem_s* zxmd_sa_AudienceRestriction_POP_Audience(struct zxmd_sa_AudienceRestriction_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Audience;
  if (y)
    x->Audience = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_sa_AudienceRestriction_PUSH_Audience) */

void zxmd_sa_AudienceRestriction_PUSH_Audience(struct zxmd_sa_AudienceRestriction_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->Audience->g;
  x->Audience = z;
}

/* FUNC(zxmd_sa_AudienceRestriction_REV_Audience) */

void zxmd_sa_AudienceRestriction_REV_Audience(struct zxmd_sa_AudienceRestriction_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->Audience;
  if (!y) return;
  x->Audience = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->Audience->g;
    x->Audience = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_AudienceRestriction_PUT_Audience) */

void zxmd_sa_AudienceRestriction_PUT_Audience(struct zxmd_sa_AudienceRestriction_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->Audience;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->Audience = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_sa_AudienceRestriction_ADD_Audience) */

void zxmd_sa_AudienceRestriction_ADD_Audience(struct zxmd_sa_AudienceRestriction_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Audience->g;
    x->Audience = z;
    return;
  case -1:
    y = x->Audience;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Audience; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_sa_AudienceRestriction_DEL_Audience) */

void zxmd_sa_AudienceRestriction_DEL_Audience(struct zxmd_sa_AudienceRestriction_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Audience = (struct zx_elem_s*)x->Audience->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->Audience;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Audience; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}








/* FUNC(zxmd_sa_AuthnContext_NUM_AuthnContextClassRef) */

int zxmd_sa_AuthnContext_NUM_AuthnContextClassRef(struct zxmd_sa_AuthnContext_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AuthnContextClassRef; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_sa_AuthnContext_GET_AuthnContextClassRef) */

struct zx_elem_s* zxmd_sa_AuthnContext_GET_AuthnContextClassRef(struct zxmd_sa_AuthnContext_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->AuthnContextClassRef; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_sa_AuthnContext_POP_AuthnContextClassRef) */

struct zx_elem_s* zxmd_sa_AuthnContext_POP_AuthnContextClassRef(struct zxmd_sa_AuthnContext_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->AuthnContextClassRef;
  if (y)
    x->AuthnContextClassRef = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_sa_AuthnContext_PUSH_AuthnContextClassRef) */

void zxmd_sa_AuthnContext_PUSH_AuthnContextClassRef(struct zxmd_sa_AuthnContext_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->AuthnContextClassRef->g;
  x->AuthnContextClassRef = z;
}

/* FUNC(zxmd_sa_AuthnContext_REV_AuthnContextClassRef) */

void zxmd_sa_AuthnContext_REV_AuthnContextClassRef(struct zxmd_sa_AuthnContext_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->AuthnContextClassRef;
  if (!y) return;
  x->AuthnContextClassRef = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->AuthnContextClassRef->g;
    x->AuthnContextClassRef = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_AuthnContext_PUT_AuthnContextClassRef) */

void zxmd_sa_AuthnContext_PUT_AuthnContextClassRef(struct zxmd_sa_AuthnContext_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->AuthnContextClassRef;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->AuthnContextClassRef = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_sa_AuthnContext_ADD_AuthnContextClassRef) */

void zxmd_sa_AuthnContext_ADD_AuthnContextClassRef(struct zxmd_sa_AuthnContext_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->AuthnContextClassRef->g;
    x->AuthnContextClassRef = z;
    return;
  case -1:
    y = x->AuthnContextClassRef;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AuthnContextClassRef; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_sa_AuthnContext_DEL_AuthnContextClassRef) */

