gitpan/zxid/c/saml2md-getput.c
int zxmd_sa_AuthnStatement_NUM_AuthnContext(struct zxmd_sa_AuthnStatement_s* x)
{
  struct zxmd_sa_AuthnContext_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AuthnContext; y; ++n, y = (struct zxmd_sa_AuthnContext_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_AuthnStatement_GET_AuthnContext) */

struct zxmd_sa_AuthnContext_s* zxmd_sa_AuthnStatement_GET_AuthnContext(struct zxmd_sa_AuthnStatement_s* x, int n)
{
  struct zxmd_sa_AuthnContext_s* y;
  if (!x) return 0;
  for (y = x->AuthnContext; n>=0 && y; --n, y = (struct zxmd_sa_AuthnContext_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_AuthnStatement_POP_AuthnContext) */

struct zxmd_sa_AuthnContext_s* zxmd_sa_AuthnStatement_POP_AuthnContext(struct zxmd_sa_AuthnStatement_s* x)
{
  struct zxmd_sa_AuthnContext_s* y;
  if (!x) return 0;
  y = x->AuthnContext;
  if (y)
    x->AuthnContext = (struct zxmd_sa_AuthnContext_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_AuthnStatement_PUSH_AuthnContext) */

void zxmd_sa_AuthnStatement_PUSH_AuthnContext(struct zxmd_sa_AuthnStatement_s* x, struct zxmd_sa_AuthnContext_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AuthnContext->gg.g;
  x->AuthnContext = z;
}

/* FUNC(zxmd_sa_AuthnStatement_REV_AuthnContext) */

void zxmd_sa_AuthnStatement_REV_AuthnContext(struct zxmd_sa_AuthnStatement_s* x)
{
  struct zxmd_sa_AuthnContext_s* nxt;
  struct zxmd_sa_AuthnContext_s* y;
  if (!x) return;
  y = x->AuthnContext;
  if (!y) return;
  x->AuthnContext = 0;
  while (y) {
    nxt = (struct zxmd_sa_AuthnContext_s*)y->gg.g.n;
    y->gg.g.n = &x->AuthnContext->gg.g;
    x->AuthnContext = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_AuthnStatement_PUT_AuthnContext) */

void zxmd_sa_AuthnStatement_PUT_AuthnContext(struct zxmd_sa_AuthnStatement_s* x, int n, struct zxmd_sa_AuthnContext_s* z)
{
  struct zxmd_sa_AuthnContext_s* y;
  if (!x || !z) return;
  y = x->AuthnContext;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AuthnContext = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_AuthnContext_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_AuthnStatement_ADD_AuthnContext) */

void zxmd_sa_AuthnStatement_ADD_AuthnContext(struct zxmd_sa_AuthnStatement_s* x, int n, struct zxmd_sa_AuthnContext_s* z)
{
  struct zxmd_sa_AuthnContext_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AuthnContext->gg.g;
    x->AuthnContext = z;
    return;
  case -1:
    y = x->AuthnContext;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_AuthnContext_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthnContext; n > 1 && y; --n, y = (struct zxmd_sa_AuthnContext_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_AuthnStatement_DEL_AuthnContext) */

void zxmd_sa_AuthnStatement_DEL_AuthnContext(struct zxmd_sa_AuthnStatement_s* x, int n)
{
  struct zxmd_sa_AuthnContext_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AuthnContext = (struct zxmd_sa_AuthnContext_s*)x->AuthnContext->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_AuthnContext_s*)x->AuthnContext;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_AuthnContext_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthnContext; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_AuthnContext_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_sa_AuthnStatement_GET_AuthnInstant) */
struct zx_str_s* zxmd_sa_AuthnStatement_GET_AuthnInstant(struct zxmd_sa_AuthnStatement_s* x) { return x->AuthnInstant; }
/* FUNC(zxmd_sa_AuthnStatement_PUT_AuthnInstant) */
void zxmd_sa_AuthnStatement_PUT_AuthnInstant(struct zxmd_sa_AuthnStatement_s* x, struct zx_str_s* y) { x->AuthnInstant = y; }
/* FUNC(zxmd_sa_AuthnStatement_GET_SessionIndex) */
struct zx_str_s* zxmd_sa_AuthnStatement_GET_SessionIndex(struct zxmd_sa_AuthnStatement_s* x) { return x->SessionIndex; }
/* FUNC(zxmd_sa_AuthnStatement_PUT_SessionIndex) */
void zxmd_sa_AuthnStatement_PUT_SessionIndex(struct zxmd_sa_AuthnStatement_s* x, struct zx_str_s* y) { x->SessionIndex = y; }
/* FUNC(zxmd_sa_AuthnStatement_GET_SessionNotOnOrAfter) */
struct zx_str_s* zxmd_sa_AuthnStatement_GET_SessionNotOnOrAfter(struct zxmd_sa_AuthnStatement_s* x) { return x->SessionNotOnOrAfter; }
/* FUNC(zxmd_sa_AuthnStatement_PUT_SessionNotOnOrAfter) */
void zxmd_sa_AuthnStatement_PUT_SessionNotOnOrAfter(struct zxmd_sa_AuthnStatement_s* x, struct zx_str_s* y) { x->SessionNotOnOrAfter = y; }







/* FUNC(zxmd_sa_AuthzDecisionStatement_NUM_Action) */

int zxmd_sa_AuthzDecisionStatement_NUM_Action(struct zxmd_sa_AuthzDecisionStatement_s* x)
{
  struct zxmd_sa_Action_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Action; y; ++n, y = (struct zxmd_sa_Action_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_GET_Action) */

struct zxmd_sa_Action_s* zxmd_sa_AuthzDecisionStatement_GET_Action(struct zxmd_sa_AuthzDecisionStatement_s* x, int n)
{
  struct zxmd_sa_Action_s* y;
  if (!x) return 0;
  for (y = x->Action; n>=0 && y; --n, y = (struct zxmd_sa_Action_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_POP_Action) */

struct zxmd_sa_Action_s* zxmd_sa_AuthzDecisionStatement_POP_Action(struct zxmd_sa_AuthzDecisionStatement_s* x)
{
  struct zxmd_sa_Action_s* y;
  if (!x) return 0;
  y = x->Action;
  if (y)
    x->Action = (struct zxmd_sa_Action_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_PUSH_Action) */

void zxmd_sa_AuthzDecisionStatement_PUSH_Action(struct zxmd_sa_AuthzDecisionStatement_s* x, struct zxmd_sa_Action_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Action->gg.g;
  x->Action = z;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_REV_Action) */

void zxmd_sa_AuthzDecisionStatement_REV_Action(struct zxmd_sa_AuthzDecisionStatement_s* x)
{
  struct zxmd_sa_Action_s* nxt;
  struct zxmd_sa_Action_s* y;
  if (!x) return;
  y = x->Action;
  if (!y) return;
  x->Action = 0;
  while (y) {
    nxt = (struct zxmd_sa_Action_s*)y->gg.g.n;
    y->gg.g.n = &x->Action->gg.g;
    x->Action = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_PUT_Action) */

void zxmd_sa_AuthzDecisionStatement_PUT_Action(struct zxmd_sa_AuthzDecisionStatement_s* x, int n, struct zxmd_sa_Action_s* z)
{
  struct zxmd_sa_Action_s* y;
  if (!x || !z) return;
  y = x->Action;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Action = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Action_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_ADD_Action) */

void zxmd_sa_AuthzDecisionStatement_ADD_Action(struct zxmd_sa_AuthzDecisionStatement_s* x, int n, struct zxmd_sa_Action_s* z)
{
  struct zxmd_sa_Action_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Action->gg.g;
    x->Action = z;
    return;
  case -1:
    y = x->Action;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_Action_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Action; n > 1 && y; --n, y = (struct zxmd_sa_Action_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_DEL_Action) */

void zxmd_sa_AuthzDecisionStatement_DEL_Action(struct zxmd_sa_AuthzDecisionStatement_s* x, int n)
{
  struct zxmd_sa_Action_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Action = (struct zxmd_sa_Action_s*)x->Action->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_Action_s*)x->Action;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_Action_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Action; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Action_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_AuthzDecisionStatement_NUM_Evidence) */

int zxmd_sa_AuthzDecisionStatement_NUM_Evidence(struct zxmd_sa_AuthzDecisionStatement_s* x)
{
  struct zxmd_sa_Evidence_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Evidence; y; ++n, y = (struct zxmd_sa_Evidence_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_GET_Evidence) */

