gitpan/zxid/c/saml2md-getput.c
struct zxmd_sa_Evidence_s* zxmd_sa_AuthzDecisionStatement_GET_Evidence(struct zxmd_sa_AuthzDecisionStatement_s* x, int n)
{
  struct zxmd_sa_Evidence_s* y;
  if (!x) return 0;
  for (y = x->Evidence; n>=0 && y; --n, y = (struct zxmd_sa_Evidence_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_POP_Evidence) */

struct zxmd_sa_Evidence_s* zxmd_sa_AuthzDecisionStatement_POP_Evidence(struct zxmd_sa_AuthzDecisionStatement_s* x)
{
  struct zxmd_sa_Evidence_s* y;
  if (!x) return 0;
  y = x->Evidence;
  if (y)
    x->Evidence = (struct zxmd_sa_Evidence_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_PUSH_Evidence) */

void zxmd_sa_AuthzDecisionStatement_PUSH_Evidence(struct zxmd_sa_AuthzDecisionStatement_s* x, struct zxmd_sa_Evidence_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Evidence->gg.g;
  x->Evidence = z;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_REV_Evidence) */

void zxmd_sa_AuthzDecisionStatement_REV_Evidence(struct zxmd_sa_AuthzDecisionStatement_s* x)
{
  struct zxmd_sa_Evidence_s* nxt;
  struct zxmd_sa_Evidence_s* y;
  if (!x) return;
  y = x->Evidence;
  if (!y) return;
  x->Evidence = 0;
  while (y) {
    nxt = (struct zxmd_sa_Evidence_s*)y->gg.g.n;
    y->gg.g.n = &x->Evidence->gg.g;
    x->Evidence = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_PUT_Evidence) */

void zxmd_sa_AuthzDecisionStatement_PUT_Evidence(struct zxmd_sa_AuthzDecisionStatement_s* x, int n, struct zxmd_sa_Evidence_s* z)
{
  struct zxmd_sa_Evidence_s* y;
  if (!x || !z) return;
  y = x->Evidence;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Evidence = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Evidence_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_ADD_Evidence) */

void zxmd_sa_AuthzDecisionStatement_ADD_Evidence(struct zxmd_sa_AuthzDecisionStatement_s* x, int n, struct zxmd_sa_Evidence_s* z)
{
  struct zxmd_sa_Evidence_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Evidence->gg.g;
    x->Evidence = z;
    return;
  case -1:
    y = x->Evidence;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_Evidence_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Evidence; n > 1 && y; --n, y = (struct zxmd_sa_Evidence_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_DEL_Evidence) */

void zxmd_sa_AuthzDecisionStatement_DEL_Evidence(struct zxmd_sa_AuthzDecisionStatement_s* x, int n)
{
  struct zxmd_sa_Evidence_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Evidence = (struct zxmd_sa_Evidence_s*)x->Evidence->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_Evidence_s*)x->Evidence;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_Evidence_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Evidence; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_Evidence_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_sa_AuthzDecisionStatement_GET_Resource) */
struct zx_str_s* zxmd_sa_AuthzDecisionStatement_GET_Resource(struct zxmd_sa_AuthzDecisionStatement_s* x) { return x->Resource; }
/* FUNC(zxmd_sa_AuthzDecisionStatement_PUT_Resource) */
void zxmd_sa_AuthzDecisionStatement_PUT_Resource(struct zxmd_sa_AuthzDecisionStatement_s* x, struct zx_str_s* y) { x->Resource = y; }
/* FUNC(zxmd_sa_AuthzDecisionStatement_GET_Decision) */
struct zx_str_s* zxmd_sa_AuthzDecisionStatement_GET_Decision(struct zxmd_sa_AuthzDecisionStatement_s* x) { return x->Decision; }
/* FUNC(zxmd_sa_AuthzDecisionStatement_PUT_Decision) */
void zxmd_sa_AuthzDecisionStatement_PUT_Decision(struct zxmd_sa_AuthzDecisionStatement_s* x, struct zx_str_s* y) { x->Decision = y; }





/* FUNC(zxmd_sa_BaseID_GET_NameQualifier) */
struct zx_str_s* zxmd_sa_BaseID_GET_NameQualifier(struct zxmd_sa_BaseID_s* x) { return x->NameQualifier; }
/* FUNC(zxmd_sa_BaseID_PUT_NameQualifier) */
void zxmd_sa_BaseID_PUT_NameQualifier(struct zxmd_sa_BaseID_s* x, struct zx_str_s* y) { x->NameQualifier = y; }
/* FUNC(zxmd_sa_BaseID_GET_SPNameQualifier) */
struct zx_str_s* zxmd_sa_BaseID_GET_SPNameQualifier(struct zxmd_sa_BaseID_s* x) { return x->SPNameQualifier; }
/* FUNC(zxmd_sa_BaseID_PUT_SPNameQualifier) */
void zxmd_sa_BaseID_PUT_SPNameQualifier(struct zxmd_sa_BaseID_s* x, struct zx_str_s* y) { x->SPNameQualifier = y; }







/* FUNC(zxmd_sa_Conditions_NUM_Condition) */

int zxmd_sa_Conditions_NUM_Condition(struct zxmd_sa_Conditions_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Condition; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_sa_Conditions_GET_Condition) */

struct zx_elem_s* zxmd_sa_Conditions_GET_Condition(struct zxmd_sa_Conditions_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Condition; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_sa_Conditions_POP_Condition) */

struct zx_elem_s* zxmd_sa_Conditions_POP_Condition(struct zxmd_sa_Conditions_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Condition;
  if (y)
    x->Condition = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_sa_Conditions_PUSH_Condition) */

void zxmd_sa_Conditions_PUSH_Condition(struct zxmd_sa_Conditions_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->Condition->g;
  x->Condition = z;
}

/* FUNC(zxmd_sa_Conditions_REV_Condition) */

void zxmd_sa_Conditions_REV_Condition(struct zxmd_sa_Conditions_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->Condition;
  if (!y) return;
  x->Condition = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->Condition->g;
    x->Condition = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_Conditions_PUT_Condition) */

void zxmd_sa_Conditions_PUT_Condition(struct zxmd_sa_Conditions_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->Condition;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->Condition = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_sa_Conditions_ADD_Condition) */

void zxmd_sa_Conditions_ADD_Condition(struct zxmd_sa_Conditions_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Condition->g;
    x->Condition = z;
    return;
  case -1:
    y = x->Condition;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Condition; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_sa_Conditions_DEL_Condition) */

void zxmd_sa_Conditions_DEL_Condition(struct zxmd_sa_Conditions_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Condition = (struct zx_elem_s*)x->Condition->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->Condition;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Condition; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_sa_Conditions_NUM_AudienceRestriction) */

int zxmd_sa_Conditions_NUM_AudienceRestriction(struct zxmd_sa_Conditions_s* x)
{
  struct zxmd_sa_AudienceRestriction_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AudienceRestriction; y; ++n, y = (struct zxmd_sa_AudienceRestriction_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_Conditions_GET_AudienceRestriction) */

struct zxmd_sa_AudienceRestriction_s* zxmd_sa_Conditions_GET_AudienceRestriction(struct zxmd_sa_Conditions_s* x, int n)
{
  struct zxmd_sa_AudienceRestriction_s* y;
  if (!x) return 0;
  for (y = x->AudienceRestriction; n>=0 && y; --n, y = (struct zxmd_sa_AudienceRestriction_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_Conditions_POP_AudienceRestriction) */

struct zxmd_sa_AudienceRestriction_s* zxmd_sa_Conditions_POP_AudienceRestriction(struct zxmd_sa_Conditions_s* x)
{
  struct zxmd_sa_AudienceRestriction_s* y;
  if (!x) return 0;
  y = x->AudienceRestriction;
  if (y)
    x->AudienceRestriction = (struct zxmd_sa_AudienceRestriction_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_Conditions_PUSH_AudienceRestriction) */

void zxmd_sa_Conditions_PUSH_AudienceRestriction(struct zxmd_sa_Conditions_s* x, struct zxmd_sa_AudienceRestriction_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AudienceRestriction->gg.g;
  x->AudienceRestriction = z;
}

/* FUNC(zxmd_sa_Conditions_REV_AudienceRestriction) */

