gitpan/zxid/c/saml2md-getput.c
void zxmd_sa_Conditions_REV_AudienceRestriction(struct zxmd_sa_Conditions_s* x)
{
  struct zxmd_sa_AudienceRestriction_s* nxt;
  struct zxmd_sa_AudienceRestriction_s* y;
  if (!x) return;
  y = x->AudienceRestriction;
  if (!y) return;
  x->AudienceRestriction = 0;
  while (y) {
    nxt = (struct zxmd_sa_AudienceRestriction_s*)y->gg.g.n;
    y->gg.g.n = &x->AudienceRestriction->gg.g;
    x->AudienceRestriction = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_Conditions_PUT_AudienceRestriction) */

void zxmd_sa_Conditions_PUT_AudienceRestriction(struct zxmd_sa_Conditions_s* x, int n, struct zxmd_sa_AudienceRestriction_s* z)
{
  struct zxmd_sa_AudienceRestriction_s* y;
  if (!x || !z) return;
  y = x->AudienceRestriction;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AudienceRestriction = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_AudienceRestriction_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_Conditions_ADD_AudienceRestriction) */

void zxmd_sa_Conditions_ADD_AudienceRestriction(struct zxmd_sa_Conditions_s* x, int n, struct zxmd_sa_AudienceRestriction_s* z)
{
  struct zxmd_sa_AudienceRestriction_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AudienceRestriction->gg.g;
    x->AudienceRestriction = z;
    return;
  case -1:
    y = x->AudienceRestriction;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_AudienceRestriction_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AudienceRestriction; n > 1 && y; --n, y = (struct zxmd_sa_AudienceRestriction_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_Conditions_DEL_AudienceRestriction) */

void zxmd_sa_Conditions_DEL_AudienceRestriction(struct zxmd_sa_Conditions_s* x, int n)
{
  struct zxmd_sa_AudienceRestriction_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AudienceRestriction = (struct zxmd_sa_AudienceRestriction_s*)x->AudienceRestriction->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_AudienceRestriction_s*)x->AudienceRestriction;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_AudienceRestriction_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AudienceRestriction; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_AudienceRestriction_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_Conditions_NUM_OneTimeUse) */

int zxmd_sa_Conditions_NUM_OneTimeUse(struct zxmd_sa_Conditions_s* x)
{
  struct zxmd_sa_OneTimeUse_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->OneTimeUse; y; ++n, y = (struct zxmd_sa_OneTimeUse_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_Conditions_GET_OneTimeUse) */

struct zxmd_sa_OneTimeUse_s* zxmd_sa_Conditions_GET_OneTimeUse(struct zxmd_sa_Conditions_s* x, int n)
{
  struct zxmd_sa_OneTimeUse_s* y;
  if (!x) return 0;
  for (y = x->OneTimeUse; n>=0 && y; --n, y = (struct zxmd_sa_OneTimeUse_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_Conditions_POP_OneTimeUse) */

struct zxmd_sa_OneTimeUse_s* zxmd_sa_Conditions_POP_OneTimeUse(struct zxmd_sa_Conditions_s* x)
{
  struct zxmd_sa_OneTimeUse_s* y;
  if (!x) return 0;
  y = x->OneTimeUse;
  if (y)
    x->OneTimeUse = (struct zxmd_sa_OneTimeUse_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_Conditions_PUSH_OneTimeUse) */

void zxmd_sa_Conditions_PUSH_OneTimeUse(struct zxmd_sa_Conditions_s* x, struct zxmd_sa_OneTimeUse_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->OneTimeUse->gg.g;
  x->OneTimeUse = z;
}

/* FUNC(zxmd_sa_Conditions_REV_OneTimeUse) */

void zxmd_sa_Conditions_REV_OneTimeUse(struct zxmd_sa_Conditions_s* x)
{
  struct zxmd_sa_OneTimeUse_s* nxt;
  struct zxmd_sa_OneTimeUse_s* y;
  if (!x) return;
  y = x->OneTimeUse;
  if (!y) return;
  x->OneTimeUse = 0;
  while (y) {
    nxt = (struct zxmd_sa_OneTimeUse_s*)y->gg.g.n;
    y->gg.g.n = &x->OneTimeUse->gg.g;
    x->OneTimeUse = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_Conditions_PUT_OneTimeUse) */

void zxmd_sa_Conditions_PUT_OneTimeUse(struct zxmd_sa_Conditions_s* x, int n, struct zxmd_sa_OneTimeUse_s* z)
{
  struct zxmd_sa_OneTimeUse_s* y;
  if (!x || !z) return;
  y = x->OneTimeUse;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->OneTimeUse = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_OneTimeUse_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_Conditions_ADD_OneTimeUse) */

void zxmd_sa_Conditions_ADD_OneTimeUse(struct zxmd_sa_Conditions_s* x, int n, struct zxmd_sa_OneTimeUse_s* z)
{
  struct zxmd_sa_OneTimeUse_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->OneTimeUse->gg.g;
    x->OneTimeUse = z;
    return;
  case -1:
    y = x->OneTimeUse;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_OneTimeUse_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OneTimeUse; n > 1 && y; --n, y = (struct zxmd_sa_OneTimeUse_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_Conditions_DEL_OneTimeUse) */

void zxmd_sa_Conditions_DEL_OneTimeUse(struct zxmd_sa_Conditions_s* x, int n)
{
  struct zxmd_sa_OneTimeUse_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->OneTimeUse = (struct zxmd_sa_OneTimeUse_s*)x->OneTimeUse->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_OneTimeUse_s*)x->OneTimeUse;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_OneTimeUse_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OneTimeUse; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_OneTimeUse_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_Conditions_NUM_ProxyRestriction) */

int zxmd_sa_Conditions_NUM_ProxyRestriction(struct zxmd_sa_Conditions_s* x)
{
  struct zxmd_sa_ProxyRestriction_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ProxyRestriction; y; ++n, y = (struct zxmd_sa_ProxyRestriction_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_Conditions_GET_ProxyRestriction) */

struct zxmd_sa_ProxyRestriction_s* zxmd_sa_Conditions_GET_ProxyRestriction(struct zxmd_sa_Conditions_s* x, int n)
{
  struct zxmd_sa_ProxyRestriction_s* y;
  if (!x) return 0;
  for (y = x->ProxyRestriction; n>=0 && y; --n, y = (struct zxmd_sa_ProxyRestriction_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_Conditions_POP_ProxyRestriction) */

struct zxmd_sa_ProxyRestriction_s* zxmd_sa_Conditions_POP_ProxyRestriction(struct zxmd_sa_Conditions_s* x)
{
  struct zxmd_sa_ProxyRestriction_s* y;
  if (!x) return 0;
  y = x->ProxyRestriction;
  if (y)
    x->ProxyRestriction = (struct zxmd_sa_ProxyRestriction_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_Conditions_PUSH_ProxyRestriction) */

