gitpan/zxid/c/saml2md-getput.c
void zxmd_sa_EncryptedAssertion_PUSH_EncryptedKey(struct zxmd_sa_EncryptedAssertion_s* x, struct zxmd_xenc_EncryptedKey_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptedKey->gg.g;
  x->EncryptedKey = z;
}

/* FUNC(zxmd_sa_EncryptedAssertion_REV_EncryptedKey) */

void zxmd_sa_EncryptedAssertion_REV_EncryptedKey(struct zxmd_sa_EncryptedAssertion_s* x)
{
  struct zxmd_xenc_EncryptedKey_s* nxt;
  struct zxmd_xenc_EncryptedKey_s* y;
  if (!x) return;
  y = x->EncryptedKey;
  if (!y) return;
  x->EncryptedKey = 0;
  while (y) {
    nxt = (struct zxmd_xenc_EncryptedKey_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptedKey->gg.g;
    x->EncryptedKey = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_EncryptedAssertion_PUT_EncryptedKey) */

void zxmd_sa_EncryptedAssertion_PUT_EncryptedKey(struct zxmd_sa_EncryptedAssertion_s* x, int n, struct zxmd_xenc_EncryptedKey_s* z)
{
  struct zxmd_xenc_EncryptedKey_s* y;
  if (!x || !z) return;
  y = x->EncryptedKey;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptedKey = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_EncryptedKey_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_EncryptedAssertion_ADD_EncryptedKey) */

void zxmd_sa_EncryptedAssertion_ADD_EncryptedKey(struct zxmd_sa_EncryptedAssertion_s* x, int n, struct zxmd_xenc_EncryptedKey_s* z)
{
  struct zxmd_xenc_EncryptedKey_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EncryptedKey->gg.g;
    x->EncryptedKey = z;
    return;
  case -1:
    y = x->EncryptedKey;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_EncryptedKey_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedKey; n > 1 && y; --n, y = (struct zxmd_xenc_EncryptedKey_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_EncryptedAssertion_DEL_EncryptedKey) */

void zxmd_sa_EncryptedAssertion_DEL_EncryptedKey(struct zxmd_sa_EncryptedAssertion_s* x, int n)
{
  struct zxmd_xenc_EncryptedKey_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptedKey = (struct zxmd_xenc_EncryptedKey_s*)x->EncryptedKey->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_EncryptedKey_s*)x->EncryptedKey;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_EncryptedKey_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedKey; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_EncryptedKey_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zxmd_sa_EncryptedAttribute_NUM_EncryptedData) */

int zxmd_sa_EncryptedAttribute_NUM_EncryptedData(struct zxmd_sa_EncryptedAttribute_s* x)
{
  struct zxmd_xenc_EncryptedData_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EncryptedData; y; ++n, y = (struct zxmd_xenc_EncryptedData_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_EncryptedAttribute_GET_EncryptedData) */

struct zxmd_xenc_EncryptedData_s* zxmd_sa_EncryptedAttribute_GET_EncryptedData(struct zxmd_sa_EncryptedAttribute_s* x, int n)
{
  struct zxmd_xenc_EncryptedData_s* y;
  if (!x) return 0;
  for (y = x->EncryptedData; n>=0 && y; --n, y = (struct zxmd_xenc_EncryptedData_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_EncryptedAttribute_POP_EncryptedData) */

struct zxmd_xenc_EncryptedData_s* zxmd_sa_EncryptedAttribute_POP_EncryptedData(struct zxmd_sa_EncryptedAttribute_s* x)
{
  struct zxmd_xenc_EncryptedData_s* y;
  if (!x) return 0;
  y = x->EncryptedData;
  if (y)
    x->EncryptedData = (struct zxmd_xenc_EncryptedData_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_EncryptedAttribute_PUSH_EncryptedData) */

void zxmd_sa_EncryptedAttribute_PUSH_EncryptedData(struct zxmd_sa_EncryptedAttribute_s* x, struct zxmd_xenc_EncryptedData_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptedData->gg.g;
  x->EncryptedData = z;
}

/* FUNC(zxmd_sa_EncryptedAttribute_REV_EncryptedData) */

void zxmd_sa_EncryptedAttribute_REV_EncryptedData(struct zxmd_sa_EncryptedAttribute_s* x)
{
  struct zxmd_xenc_EncryptedData_s* nxt;
  struct zxmd_xenc_EncryptedData_s* y;
  if (!x) return;
  y = x->EncryptedData;
  if (!y) return;
  x->EncryptedData = 0;
  while (y) {
    nxt = (struct zxmd_xenc_EncryptedData_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptedData->gg.g;
    x->EncryptedData = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_EncryptedAttribute_PUT_EncryptedData) */

void zxmd_sa_EncryptedAttribute_PUT_EncryptedData(struct zxmd_sa_EncryptedAttribute_s* x, int n, struct zxmd_xenc_EncryptedData_s* z)
{
  struct zxmd_xenc_EncryptedData_s* y;
  if (!x || !z) return;
  y = x->EncryptedData;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptedData = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_EncryptedData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_EncryptedAttribute_ADD_EncryptedData) */

void zxmd_sa_EncryptedAttribute_ADD_EncryptedData(struct zxmd_sa_EncryptedAttribute_s* x, int n, struct zxmd_xenc_EncryptedData_s* z)
{
  struct zxmd_xenc_EncryptedData_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EncryptedData->gg.g;
    x->EncryptedData = z;
    return;
  case -1:
    y = x->EncryptedData;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_EncryptedData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedData; n > 1 && y; --n, y = (struct zxmd_xenc_EncryptedData_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_EncryptedAttribute_DEL_EncryptedData) */

void zxmd_sa_EncryptedAttribute_DEL_EncryptedData(struct zxmd_sa_EncryptedAttribute_s* x, int n)
{
  struct zxmd_xenc_EncryptedData_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptedData = (struct zxmd_xenc_EncryptedData_s*)x->EncryptedData->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_EncryptedData_s*)x->EncryptedData;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_EncryptedData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedData; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_EncryptedData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



