gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_sa_Evidence_POP_EncryptedAssertion) */

struct zxmd_sa_EncryptedAssertion_s* zxmd_sa_Evidence_POP_EncryptedAssertion(struct zxmd_sa_Evidence_s* x)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x) return 0;
  y = x->EncryptedAssertion;
  if (y)
    x->EncryptedAssertion = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_Evidence_PUSH_EncryptedAssertion) */

void zxmd_sa_Evidence_PUSH_EncryptedAssertion(struct zxmd_sa_Evidence_s* x, struct zxmd_sa_EncryptedAssertion_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptedAssertion->gg.g;
  x->EncryptedAssertion = z;
}

/* FUNC(zxmd_sa_Evidence_REV_EncryptedAssertion) */

void zxmd_sa_Evidence_REV_EncryptedAssertion(struct zxmd_sa_Evidence_s* x)
{
  struct zxmd_sa_EncryptedAssertion_s* nxt;
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x) return;
  y = x->EncryptedAssertion;
  if (!y) return;
  x->EncryptedAssertion = 0;
  while (y) {
    nxt = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptedAssertion->gg.g;
    x->EncryptedAssertion = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_Evidence_PUT_EncryptedAssertion) */

void zxmd_sa_Evidence_PUT_EncryptedAssertion(struct zxmd_sa_Evidence_s* x, int n, struct zxmd_sa_EncryptedAssertion_s* z)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x || !z) return;
  y = x->EncryptedAssertion;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptedAssertion = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_Evidence_ADD_EncryptedAssertion) */

void zxmd_sa_Evidence_ADD_EncryptedAssertion(struct zxmd_sa_Evidence_s* x, int n, struct zxmd_sa_EncryptedAssertion_s* z)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EncryptedAssertion->gg.g;
    x->EncryptedAssertion = z;
    return;
  case -1:
    y = x->EncryptedAssertion;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedAssertion; n > 1 && y; --n, y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_Evidence_DEL_EncryptedAssertion) */

void zxmd_sa_Evidence_DEL_EncryptedAssertion(struct zxmd_sa_Evidence_s* x, int n)
{
  struct zxmd_sa_EncryptedAssertion_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptedAssertion = (struct zxmd_sa_EncryptedAssertion_s*)x->EncryptedAssertion->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_EncryptedAssertion_s*)x->EncryptedAssertion;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedAssertion; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_EncryptedAssertion_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}






/* FUNC(zxmd_sa_Issuer_GET_NameQualifier) */
struct zx_str_s* zxmd_sa_Issuer_GET_NameQualifier(struct zxmd_sa_Issuer_s* x) { return x->NameQualifier; }
/* FUNC(zxmd_sa_Issuer_PUT_NameQualifier) */
void zxmd_sa_Issuer_PUT_NameQualifier(struct zxmd_sa_Issuer_s* x, struct zx_str_s* y) { x->NameQualifier = y; }
/* FUNC(zxmd_sa_Issuer_GET_SPNameQualifier) */
struct zx_str_s* zxmd_sa_Issuer_GET_SPNameQualifier(struct zxmd_sa_Issuer_s* x) { return x->SPNameQualifier; }
/* FUNC(zxmd_sa_Issuer_PUT_SPNameQualifier) */
void zxmd_sa_Issuer_PUT_SPNameQualifier(struct zxmd_sa_Issuer_s* x, struct zx_str_s* y) { x->SPNameQualifier = y; }
/* FUNC(zxmd_sa_Issuer_GET_Format) */
struct zx_str_s* zxmd_sa_Issuer_GET_Format(struct zxmd_sa_Issuer_s* x) { return x->Format; }
/* FUNC(zxmd_sa_Issuer_PUT_Format) */
void zxmd_sa_Issuer_PUT_Format(struct zxmd_sa_Issuer_s* x, struct zx_str_s* y) { x->Format = y; }
/* FUNC(zxmd_sa_Issuer_GET_SPProvidedID) */
struct zx_str_s* zxmd_sa_Issuer_GET_SPProvidedID(struct zxmd_sa_Issuer_s* x) { return x->SPProvidedID; }
/* FUNC(zxmd_sa_Issuer_PUT_SPProvidedID) */
void zxmd_sa_Issuer_PUT_SPProvidedID(struct zxmd_sa_Issuer_s* x, struct zx_str_s* y) { x->SPProvidedID = y; }





/* FUNC(zxmd_sa_NameID_GET_NameQualifier) */
struct zx_str_s* zxmd_sa_NameID_GET_NameQualifier(struct zxmd_sa_NameID_s* x) { return x->NameQualifier; }
/* FUNC(zxmd_sa_NameID_PUT_NameQualifier) */
void zxmd_sa_NameID_PUT_NameQualifier(struct zxmd_sa_NameID_s* x, struct zx_str_s* y) { x->NameQualifier = y; }
/* FUNC(zxmd_sa_NameID_GET_SPNameQualifier) */
struct zx_str_s* zxmd_sa_NameID_GET_SPNameQualifier(struct zxmd_sa_NameID_s* x) { return x->SPNameQualifier; }
/* FUNC(zxmd_sa_NameID_PUT_SPNameQualifier) */
void zxmd_sa_NameID_PUT_SPNameQualifier(struct zxmd_sa_NameID_s* x, struct zx_str_s* y) { x->SPNameQualifier = y; }
/* FUNC(zxmd_sa_NameID_GET_Format) */
struct zx_str_s* zxmd_sa_NameID_GET_Format(struct zxmd_sa_NameID_s* x) { return x->Format; }
/* FUNC(zxmd_sa_NameID_PUT_Format) */
void zxmd_sa_NameID_PUT_Format(struct zxmd_sa_NameID_s* x, struct zx_str_s* y) { x->Format = y; }
/* FUNC(zxmd_sa_NameID_GET_SPProvidedID) */
struct zx_str_s* zxmd_sa_NameID_GET_SPProvidedID(struct zxmd_sa_NameID_s* x) { return x->SPProvidedID; }
/* FUNC(zxmd_sa_NameID_PUT_SPProvidedID) */
void zxmd_sa_NameID_PUT_SPProvidedID(struct zxmd_sa_NameID_s* x, struct zx_str_s* y) { x->SPProvidedID = y; }












/* FUNC(zxmd_sa_ProxyRestriction_NUM_Audience) */

int zxmd_sa_ProxyRestriction_NUM_Audience(struct zxmd_sa_ProxyRestriction_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Audience; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_sa_ProxyRestriction_GET_Audience) */

struct zx_elem_s* zxmd_sa_ProxyRestriction_GET_Audience(struct zxmd_sa_ProxyRestriction_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Audience; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_sa_ProxyRestriction_POP_Audience) */

struct zx_elem_s* zxmd_sa_ProxyRestriction_POP_Audience(struct zxmd_sa_ProxyRestriction_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Audience;
  if (y)
    x->Audience = (struct zx_elem_s*)y->g.n;
  return y;
}

