gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_sa_Subject_POP_SubjectConfirmation) */

struct zxmd_sa_SubjectConfirmation_s* zxmd_sa_Subject_POP_SubjectConfirmation(struct zxmd_sa_Subject_s* x)
{
  struct zxmd_sa_SubjectConfirmation_s* y;
  if (!x) return 0;
  y = x->SubjectConfirmation;
  if (y)
    x->SubjectConfirmation = (struct zxmd_sa_SubjectConfirmation_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_Subject_PUSH_SubjectConfirmation) */

void zxmd_sa_Subject_PUSH_SubjectConfirmation(struct zxmd_sa_Subject_s* x, struct zxmd_sa_SubjectConfirmation_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SubjectConfirmation->gg.g;
  x->SubjectConfirmation = z;
}

/* FUNC(zxmd_sa_Subject_REV_SubjectConfirmation) */

void zxmd_sa_Subject_REV_SubjectConfirmation(struct zxmd_sa_Subject_s* x)
{
  struct zxmd_sa_SubjectConfirmation_s* nxt;
  struct zxmd_sa_SubjectConfirmation_s* y;
  if (!x) return;
  y = x->SubjectConfirmation;
  if (!y) return;
  x->SubjectConfirmation = 0;
  while (y) {
    nxt = (struct zxmd_sa_SubjectConfirmation_s*)y->gg.g.n;
    y->gg.g.n = &x->SubjectConfirmation->gg.g;
    x->SubjectConfirmation = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_Subject_PUT_SubjectConfirmation) */

void zxmd_sa_Subject_PUT_SubjectConfirmation(struct zxmd_sa_Subject_s* x, int n, struct zxmd_sa_SubjectConfirmation_s* z)
{
  struct zxmd_sa_SubjectConfirmation_s* y;
  if (!x || !z) return;
  y = x->SubjectConfirmation;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SubjectConfirmation = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_SubjectConfirmation_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_Subject_ADD_SubjectConfirmation) */

void zxmd_sa_Subject_ADD_SubjectConfirmation(struct zxmd_sa_Subject_s* x, int n, struct zxmd_sa_SubjectConfirmation_s* z)
{
  struct zxmd_sa_SubjectConfirmation_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SubjectConfirmation->gg.g;
    x->SubjectConfirmation = z;
    return;
  case -1:
    y = x->SubjectConfirmation;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_SubjectConfirmation_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SubjectConfirmation; n > 1 && y; --n, y = (struct zxmd_sa_SubjectConfirmation_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_Subject_DEL_SubjectConfirmation) */

void zxmd_sa_Subject_DEL_SubjectConfirmation(struct zxmd_sa_Subject_s* x, int n)
{
  struct zxmd_sa_SubjectConfirmation_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SubjectConfirmation = (struct zxmd_sa_SubjectConfirmation_s*)x->SubjectConfirmation->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_SubjectConfirmation_s*)x->SubjectConfirmation;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_SubjectConfirmation_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SubjectConfirmation; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_SubjectConfirmation_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zxmd_sa_SubjectConfirmation_NUM_BaseID) */

int zxmd_sa_SubjectConfirmation_NUM_BaseID(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_BaseID_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->BaseID; y; ++n, y = (struct zxmd_sa_BaseID_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_SubjectConfirmation_GET_BaseID) */

struct zxmd_sa_BaseID_s* zxmd_sa_SubjectConfirmation_GET_BaseID(struct zxmd_sa_SubjectConfirmation_s* x, int n)
{
  struct zxmd_sa_BaseID_s* y;
  if (!x) return 0;
  for (y = x->BaseID; n>=0 && y; --n, y = (struct zxmd_sa_BaseID_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_SubjectConfirmation_POP_BaseID) */

struct zxmd_sa_BaseID_s* zxmd_sa_SubjectConfirmation_POP_BaseID(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_BaseID_s* y;
  if (!x) return 0;
  y = x->BaseID;
  if (y)
    x->BaseID = (struct zxmd_sa_BaseID_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_SubjectConfirmation_PUSH_BaseID) */

void zxmd_sa_SubjectConfirmation_PUSH_BaseID(struct zxmd_sa_SubjectConfirmation_s* x, struct zxmd_sa_BaseID_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->BaseID->gg.g;
  x->BaseID = z;
}

/* FUNC(zxmd_sa_SubjectConfirmation_REV_BaseID) */

void zxmd_sa_SubjectConfirmation_REV_BaseID(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_BaseID_s* nxt;
  struct zxmd_sa_BaseID_s* y;
  if (!x) return;
  y = x->BaseID;
  if (!y) return;
  x->BaseID = 0;
  while (y) {
    nxt = (struct zxmd_sa_BaseID_s*)y->gg.g.n;
    y->gg.g.n = &x->BaseID->gg.g;
    x->BaseID = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_SubjectConfirmation_PUT_BaseID) */

void zxmd_sa_SubjectConfirmation_PUT_BaseID(struct zxmd_sa_SubjectConfirmation_s* x, int n, struct zxmd_sa_BaseID_s* z)
{
  struct zxmd_sa_BaseID_s* y;
  if (!x || !z) return;
  y = x->BaseID;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->BaseID = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_BaseID_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_SubjectConfirmation_ADD_BaseID) */

void zxmd_sa_SubjectConfirmation_ADD_BaseID(struct zxmd_sa_SubjectConfirmation_s* x, int n, struct zxmd_sa_BaseID_s* z)
{
  struct zxmd_sa_BaseID_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->BaseID->gg.g;
    x->BaseID = z;
    return;
  case -1:
    y = x->BaseID;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_BaseID_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->BaseID; n > 1 && y; --n, y = (struct zxmd_sa_BaseID_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_SubjectConfirmation_DEL_BaseID) */

void zxmd_sa_SubjectConfirmation_DEL_BaseID(struct zxmd_sa_SubjectConfirmation_s* x, int n)
{
  struct zxmd_sa_BaseID_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->BaseID = (struct zxmd_sa_BaseID_s*)x->BaseID->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_BaseID_s*)x->BaseID;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_BaseID_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->BaseID; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_BaseID_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_SubjectConfirmation_NUM_NameID) */

