gitpan/zxid/c/saml2md-getput.c
int zxmd_sa_SubjectConfirmation_NUM_NameID(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_NameID_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->NameID; y; ++n, y = (struct zxmd_sa_NameID_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_SubjectConfirmation_GET_NameID) */

struct zxmd_sa_NameID_s* zxmd_sa_SubjectConfirmation_GET_NameID(struct zxmd_sa_SubjectConfirmation_s* x, int n)
{
  struct zxmd_sa_NameID_s* y;
  if (!x) return 0;
  for (y = x->NameID; n>=0 && y; --n, y = (struct zxmd_sa_NameID_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_SubjectConfirmation_POP_NameID) */

struct zxmd_sa_NameID_s* zxmd_sa_SubjectConfirmation_POP_NameID(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_NameID_s* y;
  if (!x) return 0;
  y = x->NameID;
  if (y)
    x->NameID = (struct zxmd_sa_NameID_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_SubjectConfirmation_PUSH_NameID) */

void zxmd_sa_SubjectConfirmation_PUSH_NameID(struct zxmd_sa_SubjectConfirmation_s* x, struct zxmd_sa_NameID_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->NameID->gg.g;
  x->NameID = z;
}

/* FUNC(zxmd_sa_SubjectConfirmation_REV_NameID) */

void zxmd_sa_SubjectConfirmation_REV_NameID(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_NameID_s* nxt;
  struct zxmd_sa_NameID_s* y;
  if (!x) return;
  y = x->NameID;
  if (!y) return;
  x->NameID = 0;
  while (y) {
    nxt = (struct zxmd_sa_NameID_s*)y->gg.g.n;
    y->gg.g.n = &x->NameID->gg.g;
    x->NameID = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_SubjectConfirmation_PUT_NameID) */

void zxmd_sa_SubjectConfirmation_PUT_NameID(struct zxmd_sa_SubjectConfirmation_s* x, int n, struct zxmd_sa_NameID_s* z)
{
  struct zxmd_sa_NameID_s* y;
  if (!x || !z) return;
  y = x->NameID;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->NameID = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_NameID_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_SubjectConfirmation_ADD_NameID) */

void zxmd_sa_SubjectConfirmation_ADD_NameID(struct zxmd_sa_SubjectConfirmation_s* x, int n, struct zxmd_sa_NameID_s* z)
{
  struct zxmd_sa_NameID_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->NameID->gg.g;
    x->NameID = z;
    return;
  case -1:
    y = x->NameID;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_NameID_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->NameID; n > 1 && y; --n, y = (struct zxmd_sa_NameID_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_SubjectConfirmation_DEL_NameID) */

void zxmd_sa_SubjectConfirmation_DEL_NameID(struct zxmd_sa_SubjectConfirmation_s* x, int n)
{
  struct zxmd_sa_NameID_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->NameID = (struct zxmd_sa_NameID_s*)x->NameID->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_NameID_s*)x->NameID;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_NameID_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->NameID; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_NameID_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_SubjectConfirmation_NUM_EncryptedID) */

int zxmd_sa_SubjectConfirmation_NUM_EncryptedID(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_EncryptedID_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EncryptedID; y; ++n, y = (struct zxmd_sa_EncryptedID_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_SubjectConfirmation_GET_EncryptedID) */

struct zxmd_sa_EncryptedID_s* zxmd_sa_SubjectConfirmation_GET_EncryptedID(struct zxmd_sa_SubjectConfirmation_s* x, int n)
{
  struct zxmd_sa_EncryptedID_s* y;
  if (!x) return 0;
  for (y = x->EncryptedID; n>=0 && y; --n, y = (struct zxmd_sa_EncryptedID_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_SubjectConfirmation_POP_EncryptedID) */

struct zxmd_sa_EncryptedID_s* zxmd_sa_SubjectConfirmation_POP_EncryptedID(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_EncryptedID_s* y;
  if (!x) return 0;
  y = x->EncryptedID;
  if (y)
    x->EncryptedID = (struct zxmd_sa_EncryptedID_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_SubjectConfirmation_PUSH_EncryptedID) */

void zxmd_sa_SubjectConfirmation_PUSH_EncryptedID(struct zxmd_sa_SubjectConfirmation_s* x, struct zxmd_sa_EncryptedID_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptedID->gg.g;
  x->EncryptedID = z;
}

/* FUNC(zxmd_sa_SubjectConfirmation_REV_EncryptedID) */

void zxmd_sa_SubjectConfirmation_REV_EncryptedID(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_EncryptedID_s* nxt;
  struct zxmd_sa_EncryptedID_s* y;
  if (!x) return;
  y = x->EncryptedID;
  if (!y) return;
  x->EncryptedID = 0;
  while (y) {
    nxt = (struct zxmd_sa_EncryptedID_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptedID->gg.g;
    x->EncryptedID = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_SubjectConfirmation_PUT_EncryptedID) */

void zxmd_sa_SubjectConfirmation_PUT_EncryptedID(struct zxmd_sa_SubjectConfirmation_s* x, int n, struct zxmd_sa_EncryptedID_s* z)
{
  struct zxmd_sa_EncryptedID_s* y;
  if (!x || !z) return;
  y = x->EncryptedID;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptedID = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_EncryptedID_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_SubjectConfirmation_ADD_EncryptedID) */

void zxmd_sa_SubjectConfirmation_ADD_EncryptedID(struct zxmd_sa_SubjectConfirmation_s* x, int n, struct zxmd_sa_EncryptedID_s* z)
{
  struct zxmd_sa_EncryptedID_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EncryptedID->gg.g;
    x->EncryptedID = z;
    return;
  case -1:
    y = x->EncryptedID;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_EncryptedID_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedID; n > 1 && y; --n, y = (struct zxmd_sa_EncryptedID_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_SubjectConfirmation_DEL_EncryptedID) */

void zxmd_sa_SubjectConfirmation_DEL_EncryptedID(struct zxmd_sa_SubjectConfirmation_s* x, int n)
{
  struct zxmd_sa_EncryptedID_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptedID = (struct zxmd_sa_EncryptedID_s*)x->EncryptedID->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_EncryptedID_s*)x->EncryptedID;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_EncryptedID_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptedID; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_EncryptedID_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_sa_SubjectConfirmation_NUM_SubjectConfirmationData) */

int zxmd_sa_SubjectConfirmation_NUM_SubjectConfirmationData(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_SubjectConfirmationData_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SubjectConfirmationData; y; ++n, y = (struct zxmd_sa_SubjectConfirmationData_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_sa_SubjectConfirmation_GET_SubjectConfirmationData) */

