gitpan/zxid/c/saml2md-getput.c
struct zxmd_sa_SubjectConfirmationData_s* zxmd_sa_SubjectConfirmation_GET_SubjectConfirmationData(struct zxmd_sa_SubjectConfirmation_s* x, int n)
{
  struct zxmd_sa_SubjectConfirmationData_s* y;
  if (!x) return 0;
  for (y = x->SubjectConfirmationData; n>=0 && y; --n, y = (struct zxmd_sa_SubjectConfirmationData_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_sa_SubjectConfirmation_POP_SubjectConfirmationData) */

struct zxmd_sa_SubjectConfirmationData_s* zxmd_sa_SubjectConfirmation_POP_SubjectConfirmationData(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_SubjectConfirmationData_s* y;
  if (!x) return 0;
  y = x->SubjectConfirmationData;
  if (y)
    x->SubjectConfirmationData = (struct zxmd_sa_SubjectConfirmationData_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_sa_SubjectConfirmation_PUSH_SubjectConfirmationData) */

void zxmd_sa_SubjectConfirmation_PUSH_SubjectConfirmationData(struct zxmd_sa_SubjectConfirmation_s* x, struct zxmd_sa_SubjectConfirmationData_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SubjectConfirmationData->gg.g;
  x->SubjectConfirmationData = z;
}

/* FUNC(zxmd_sa_SubjectConfirmation_REV_SubjectConfirmationData) */

void zxmd_sa_SubjectConfirmation_REV_SubjectConfirmationData(struct zxmd_sa_SubjectConfirmation_s* x)
{
  struct zxmd_sa_SubjectConfirmationData_s* nxt;
  struct zxmd_sa_SubjectConfirmationData_s* y;
  if (!x) return;
  y = x->SubjectConfirmationData;
  if (!y) return;
  x->SubjectConfirmationData = 0;
  while (y) {
    nxt = (struct zxmd_sa_SubjectConfirmationData_s*)y->gg.g.n;
    y->gg.g.n = &x->SubjectConfirmationData->gg.g;
    x->SubjectConfirmationData = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_SubjectConfirmation_PUT_SubjectConfirmationData) */

void zxmd_sa_SubjectConfirmation_PUT_SubjectConfirmationData(struct zxmd_sa_SubjectConfirmation_s* x, int n, struct zxmd_sa_SubjectConfirmationData_s* z)
{
  struct zxmd_sa_SubjectConfirmationData_s* y;
  if (!x || !z) return;
  y = x->SubjectConfirmationData;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SubjectConfirmationData = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_SubjectConfirmationData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_sa_SubjectConfirmation_ADD_SubjectConfirmationData) */

void zxmd_sa_SubjectConfirmation_ADD_SubjectConfirmationData(struct zxmd_sa_SubjectConfirmation_s* x, int n, struct zxmd_sa_SubjectConfirmationData_s* z)
{
  struct zxmd_sa_SubjectConfirmationData_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SubjectConfirmationData->gg.g;
    x->SubjectConfirmationData = z;
    return;
  case -1:
    y = x->SubjectConfirmationData;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_sa_SubjectConfirmationData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SubjectConfirmationData; n > 1 && y; --n, y = (struct zxmd_sa_SubjectConfirmationData_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_sa_SubjectConfirmation_DEL_SubjectConfirmationData) */

void zxmd_sa_SubjectConfirmation_DEL_SubjectConfirmationData(struct zxmd_sa_SubjectConfirmation_s* x, int n)
{
  struct zxmd_sa_SubjectConfirmationData_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SubjectConfirmationData = (struct zxmd_sa_SubjectConfirmationData_s*)x->SubjectConfirmationData->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_sa_SubjectConfirmationData_s*)x->SubjectConfirmationData;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_sa_SubjectConfirmationData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SubjectConfirmationData; n > 1 && y->gg.g.n; --n, y = (struct zxmd_sa_SubjectConfirmationData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_sa_SubjectConfirmation_GET_Method) */
struct zx_str_s* zxmd_sa_SubjectConfirmation_GET_Method(struct zxmd_sa_SubjectConfirmation_s* x) { return x->Method; }
/* FUNC(zxmd_sa_SubjectConfirmation_PUT_Method) */
void zxmd_sa_SubjectConfirmation_PUT_Method(struct zxmd_sa_SubjectConfirmation_s* x, struct zx_str_s* y) { x->Method = y; }





/* FUNC(zxmd_sa_SubjectConfirmationData_GET_NotBefore) */
struct zx_str_s* zxmd_sa_SubjectConfirmationData_GET_NotBefore(struct zxmd_sa_SubjectConfirmationData_s* x) { return x->NotBefore; }
/* FUNC(zxmd_sa_SubjectConfirmationData_PUT_NotBefore) */
void zxmd_sa_SubjectConfirmationData_PUT_NotBefore(struct zxmd_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->NotBefore = y; }
/* FUNC(zxmd_sa_SubjectConfirmationData_GET_NotOnOrAfter) */
struct zx_str_s* zxmd_sa_SubjectConfirmationData_GET_NotOnOrAfter(struct zxmd_sa_SubjectConfirmationData_s* x) { return x->NotOnOrAfter; }
/* FUNC(zxmd_sa_SubjectConfirmationData_PUT_NotOnOrAfter) */
void zxmd_sa_SubjectConfirmationData_PUT_NotOnOrAfter(struct zxmd_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->NotOnOrAfter = y; }
/* FUNC(zxmd_sa_SubjectConfirmationData_GET_Recipient) */
struct zx_str_s* zxmd_sa_SubjectConfirmationData_GET_Recipient(struct zxmd_sa_SubjectConfirmationData_s* x) { return x->Recipient; }
/* FUNC(zxmd_sa_SubjectConfirmationData_PUT_Recipient) */
void zxmd_sa_SubjectConfirmationData_PUT_Recipient(struct zxmd_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->Recipient = y; }
/* FUNC(zxmd_sa_SubjectConfirmationData_GET_InResponseTo) */
struct zx_str_s* zxmd_sa_SubjectConfirmationData_GET_InResponseTo(struct zxmd_sa_SubjectConfirmationData_s* x) { return x->InResponseTo; }
/* FUNC(zxmd_sa_SubjectConfirmationData_PUT_InResponseTo) */
void zxmd_sa_SubjectConfirmationData_PUT_InResponseTo(struct zxmd_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->InResponseTo = y; }
/* FUNC(zxmd_sa_SubjectConfirmationData_GET_Address) */
struct zx_str_s* zxmd_sa_SubjectConfirmationData_GET_Address(struct zxmd_sa_SubjectConfirmationData_s* x) { return x->Address; }
/* FUNC(zxmd_sa_SubjectConfirmationData_PUT_Address) */
void zxmd_sa_SubjectConfirmationData_PUT_Address(struct zxmd_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->Address = y; }





