gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_sa_SubjectLocality_GET_Address) */
struct zx_str_s* zxmd_sa_SubjectLocality_GET_Address(struct zxmd_sa_SubjectLocality_s* x) { return x->Address; }
/* FUNC(zxmd_sa_SubjectLocality_PUT_Address) */
void zxmd_sa_SubjectLocality_PUT_Address(struct zxmd_sa_SubjectLocality_s* x, struct zx_str_s* y) { x->Address = y; }
/* FUNC(zxmd_sa_SubjectLocality_GET_DNSName) */
struct zx_str_s* zxmd_sa_SubjectLocality_GET_DNSName(struct zxmd_sa_SubjectLocality_s* x) { return x->DNSName; }
/* FUNC(zxmd_sa_SubjectLocality_PUT_DNSName) */
void zxmd_sa_SubjectLocality_PUT_DNSName(struct zxmd_sa_SubjectLocality_s* x, struct zx_str_s* y) { x->DNSName = y; }







/* FUNC(zxmd_sa_TestElem_NUM_AttributeValue) */

int zxmd_sa_TestElem_NUM_AttributeValue(struct zxmd_sa_TestElem_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AttributeValue; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_sa_TestElem_GET_AttributeValue) */

struct zx_elem_s* zxmd_sa_TestElem_GET_AttributeValue(struct zxmd_sa_TestElem_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->AttributeValue; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_sa_TestElem_POP_AttributeValue) */

struct zx_elem_s* zxmd_sa_TestElem_POP_AttributeValue(struct zxmd_sa_TestElem_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->AttributeValue;
  if (y)
    x->AttributeValue = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_sa_TestElem_PUSH_AttributeValue) */

void zxmd_sa_TestElem_PUSH_AttributeValue(struct zxmd_sa_TestElem_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->AttributeValue->g;
  x->AttributeValue = z;
}

/* FUNC(zxmd_sa_TestElem_REV_AttributeValue) */

void zxmd_sa_TestElem_REV_AttributeValue(struct zxmd_sa_TestElem_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->AttributeValue;
  if (!y) return;
  x->AttributeValue = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->AttributeValue->g;
    x->AttributeValue = y;
    y = nxt;
  }
}

/* FUNC(zxmd_sa_TestElem_PUT_AttributeValue) */

void zxmd_sa_TestElem_PUT_AttributeValue(struct zxmd_sa_TestElem_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->AttributeValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->AttributeValue = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_sa_TestElem_ADD_AttributeValue) */

void zxmd_sa_TestElem_ADD_AttributeValue(struct zxmd_sa_TestElem_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->AttributeValue->g;
    x->AttributeValue = z;
    return;
  case -1:
    y = x->AttributeValue;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AttributeValue; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_sa_TestElem_DEL_AttributeValue) */

void zxmd_sa_TestElem_DEL_AttributeValue(struct zxmd_sa_TestElem_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AttributeValue = (struct zx_elem_s*)x->AttributeValue->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->AttributeValue;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AttributeValue; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}








/* FUNC(zxmd_xenc_AgreementMethod_NUM_KA_Nonce) */

int zxmd_xenc_AgreementMethod_NUM_KA_Nonce(struct zxmd_xenc_AgreementMethod_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KA_Nonce; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_AgreementMethod_GET_KA_Nonce) */

struct zx_elem_s* zxmd_xenc_AgreementMethod_GET_KA_Nonce(struct zxmd_xenc_AgreementMethod_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->KA_Nonce; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_AgreementMethod_POP_KA_Nonce) */

struct zx_elem_s* zxmd_xenc_AgreementMethod_POP_KA_Nonce(struct zxmd_xenc_AgreementMethod_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->KA_Nonce;
  if (y)
    x->KA_Nonce = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_xenc_AgreementMethod_PUSH_KA_Nonce) */

void zxmd_xenc_AgreementMethod_PUSH_KA_Nonce(struct zxmd_xenc_AgreementMethod_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->KA_Nonce->g;
  x->KA_Nonce = z;
}

/* FUNC(zxmd_xenc_AgreementMethod_REV_KA_Nonce) */

void zxmd_xenc_AgreementMethod_REV_KA_Nonce(struct zxmd_xenc_AgreementMethod_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->KA_Nonce;
  if (!y) return;
  x->KA_Nonce = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->KA_Nonce->g;
    x->KA_Nonce = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_AgreementMethod_PUT_KA_Nonce) */

void zxmd_xenc_AgreementMethod_PUT_KA_Nonce(struct zxmd_xenc_AgreementMethod_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->KA_Nonce;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->KA_Nonce = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_xenc_AgreementMethod_ADD_KA_Nonce) */

void zxmd_xenc_AgreementMethod_ADD_KA_Nonce(struct zxmd_xenc_AgreementMethod_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->KA_Nonce->g;
    x->KA_Nonce = z;
    return;
  case -1:
    y = x->KA_Nonce;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->KA_Nonce; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_xenc_AgreementMethod_DEL_KA_Nonce) */

