gitpan/zxid/c/saml2md-getput.c
void zxmd_xenc_AgreementMethod_DEL_KA_Nonce(struct zxmd_xenc_AgreementMethod_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KA_Nonce = (struct zx_elem_s*)x->KA_Nonce->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->KA_Nonce;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->KA_Nonce; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_xenc_AgreementMethod_NUM_OriginatorKeyInfo) */

int zxmd_xenc_AgreementMethod_NUM_OriginatorKeyInfo(struct zxmd_xenc_AgreementMethod_s* x)
{
  struct zxmd_xenc_OriginatorKeyInfo_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->OriginatorKeyInfo; y; ++n, y = (struct zxmd_xenc_OriginatorKeyInfo_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_AgreementMethod_GET_OriginatorKeyInfo) */

struct zxmd_xenc_OriginatorKeyInfo_s* zxmd_xenc_AgreementMethod_GET_OriginatorKeyInfo(struct zxmd_xenc_AgreementMethod_s* x, int n)
{
  struct zxmd_xenc_OriginatorKeyInfo_s* y;
  if (!x) return 0;
  for (y = x->OriginatorKeyInfo; n>=0 && y; --n, y = (struct zxmd_xenc_OriginatorKeyInfo_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_AgreementMethod_POP_OriginatorKeyInfo) */

struct zxmd_xenc_OriginatorKeyInfo_s* zxmd_xenc_AgreementMethod_POP_OriginatorKeyInfo(struct zxmd_xenc_AgreementMethod_s* x)
{
  struct zxmd_xenc_OriginatorKeyInfo_s* y;
  if (!x) return 0;
  y = x->OriginatorKeyInfo;
  if (y)
    x->OriginatorKeyInfo = (struct zxmd_xenc_OriginatorKeyInfo_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_AgreementMethod_PUSH_OriginatorKeyInfo) */

void zxmd_xenc_AgreementMethod_PUSH_OriginatorKeyInfo(struct zxmd_xenc_AgreementMethod_s* x, struct zxmd_xenc_OriginatorKeyInfo_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->OriginatorKeyInfo->gg.g;
  x->OriginatorKeyInfo = z;
}

/* FUNC(zxmd_xenc_AgreementMethod_REV_OriginatorKeyInfo) */

void zxmd_xenc_AgreementMethod_REV_OriginatorKeyInfo(struct zxmd_xenc_AgreementMethod_s* x)
{
  struct zxmd_xenc_OriginatorKeyInfo_s* nxt;
  struct zxmd_xenc_OriginatorKeyInfo_s* y;
  if (!x) return;
  y = x->OriginatorKeyInfo;
  if (!y) return;
  x->OriginatorKeyInfo = 0;
  while (y) {
    nxt = (struct zxmd_xenc_OriginatorKeyInfo_s*)y->gg.g.n;
    y->gg.g.n = &x->OriginatorKeyInfo->gg.g;
    x->OriginatorKeyInfo = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_AgreementMethod_PUT_OriginatorKeyInfo) */

void zxmd_xenc_AgreementMethod_PUT_OriginatorKeyInfo(struct zxmd_xenc_AgreementMethod_s* x, int n, struct zxmd_xenc_OriginatorKeyInfo_s* z)
{
  struct zxmd_xenc_OriginatorKeyInfo_s* y;
  if (!x || !z) return;
  y = x->OriginatorKeyInfo;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->OriginatorKeyInfo = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_OriginatorKeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_AgreementMethod_ADD_OriginatorKeyInfo) */

void zxmd_xenc_AgreementMethod_ADD_OriginatorKeyInfo(struct zxmd_xenc_AgreementMethod_s* x, int n, struct zxmd_xenc_OriginatorKeyInfo_s* z)
{
  struct zxmd_xenc_OriginatorKeyInfo_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->OriginatorKeyInfo->gg.g;
    x->OriginatorKeyInfo = z;
    return;
  case -1:
    y = x->OriginatorKeyInfo;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_OriginatorKeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OriginatorKeyInfo; n > 1 && y; --n, y = (struct zxmd_xenc_OriginatorKeyInfo_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_AgreementMethod_DEL_OriginatorKeyInfo) */

void zxmd_xenc_AgreementMethod_DEL_OriginatorKeyInfo(struct zxmd_xenc_AgreementMethod_s* x, int n)
{
  struct zxmd_xenc_OriginatorKeyInfo_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->OriginatorKeyInfo = (struct zxmd_xenc_OriginatorKeyInfo_s*)x->OriginatorKeyInfo->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_OriginatorKeyInfo_s*)x->OriginatorKeyInfo;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_OriginatorKeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OriginatorKeyInfo; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_OriginatorKeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_xenc_AgreementMethod_NUM_RecipientKeyInfo) */

int zxmd_xenc_AgreementMethod_NUM_RecipientKeyInfo(struct zxmd_xenc_AgreementMethod_s* x)
{
  struct zxmd_xenc_RecipientKeyInfo_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->RecipientKeyInfo; y; ++n, y = (struct zxmd_xenc_RecipientKeyInfo_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_AgreementMethod_GET_RecipientKeyInfo) */

struct zxmd_xenc_RecipientKeyInfo_s* zxmd_xenc_AgreementMethod_GET_RecipientKeyInfo(struct zxmd_xenc_AgreementMethod_s* x, int n)
{
  struct zxmd_xenc_RecipientKeyInfo_s* y;
  if (!x) return 0;
  for (y = x->RecipientKeyInfo; n>=0 && y; --n, y = (struct zxmd_xenc_RecipientKeyInfo_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_AgreementMethod_POP_RecipientKeyInfo) */

struct zxmd_xenc_RecipientKeyInfo_s* zxmd_xenc_AgreementMethod_POP_RecipientKeyInfo(struct zxmd_xenc_AgreementMethod_s* x)
{
  struct zxmd_xenc_RecipientKeyInfo_s* y;
  if (!x) return 0;
  y = x->RecipientKeyInfo;
  if (y)
    x->RecipientKeyInfo = (struct zxmd_xenc_RecipientKeyInfo_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_AgreementMethod_PUSH_RecipientKeyInfo) */

void zxmd_xenc_AgreementMethod_PUSH_RecipientKeyInfo(struct zxmd_xenc_AgreementMethod_s* x, struct zxmd_xenc_RecipientKeyInfo_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->RecipientKeyInfo->gg.g;
  x->RecipientKeyInfo = z;
}

/* FUNC(zxmd_xenc_AgreementMethod_REV_RecipientKeyInfo) */

void zxmd_xenc_AgreementMethod_REV_RecipientKeyInfo(struct zxmd_xenc_AgreementMethod_s* x)
{
  struct zxmd_xenc_RecipientKeyInfo_s* nxt;
  struct zxmd_xenc_RecipientKeyInfo_s* y;
  if (!x) return;
  y = x->RecipientKeyInfo;
  if (!y) return;
  x->RecipientKeyInfo = 0;
  while (y) {
    nxt = (struct zxmd_xenc_RecipientKeyInfo_s*)y->gg.g.n;
    y->gg.g.n = &x->RecipientKeyInfo->gg.g;
    x->RecipientKeyInfo = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_AgreementMethod_PUT_RecipientKeyInfo) */

void zxmd_xenc_AgreementMethod_PUT_RecipientKeyInfo(struct zxmd_xenc_AgreementMethod_s* x, int n, struct zxmd_xenc_RecipientKeyInfo_s* z)
{
  struct zxmd_xenc_RecipientKeyInfo_s* y;
  if (!x || !z) return;
  y = x->RecipientKeyInfo;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->RecipientKeyInfo = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_RecipientKeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_AgreementMethod_ADD_RecipientKeyInfo) */

void zxmd_xenc_AgreementMethod_ADD_RecipientKeyInfo(struct zxmd_xenc_AgreementMethod_s* x, int n, struct zxmd_xenc_RecipientKeyInfo_s* z)
{
  struct zxmd_xenc_RecipientKeyInfo_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->RecipientKeyInfo->gg.g;
    x->RecipientKeyInfo = z;
    return;
  case -1:
    y = x->RecipientKeyInfo;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_RecipientKeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->RecipientKeyInfo; n > 1 && y; --n, y = (struct zxmd_xenc_RecipientKeyInfo_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_AgreementMethod_DEL_RecipientKeyInfo) */

