gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_xenc_CipherReference_NUM_Transforms) */

int zxmd_xenc_CipherReference_NUM_Transforms(struct zxmd_xenc_CipherReference_s* x)
{
  struct zxmd_xenc_Transforms_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Transforms; y; ++n, y = (struct zxmd_xenc_Transforms_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_CipherReference_GET_Transforms) */

struct zxmd_xenc_Transforms_s* zxmd_xenc_CipherReference_GET_Transforms(struct zxmd_xenc_CipherReference_s* x, int n)
{
  struct zxmd_xenc_Transforms_s* y;
  if (!x) return 0;
  for (y = x->Transforms; n>=0 && y; --n, y = (struct zxmd_xenc_Transforms_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_CipherReference_POP_Transforms) */

struct zxmd_xenc_Transforms_s* zxmd_xenc_CipherReference_POP_Transforms(struct zxmd_xenc_CipherReference_s* x)
{
  struct zxmd_xenc_Transforms_s* y;
  if (!x) return 0;
  y = x->Transforms;
  if (y)
    x->Transforms = (struct zxmd_xenc_Transforms_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_CipherReference_PUSH_Transforms) */

void zxmd_xenc_CipherReference_PUSH_Transforms(struct zxmd_xenc_CipherReference_s* x, struct zxmd_xenc_Transforms_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Transforms->gg.g;
  x->Transforms = z;
}

/* FUNC(zxmd_xenc_CipherReference_REV_Transforms) */

void zxmd_xenc_CipherReference_REV_Transforms(struct zxmd_xenc_CipherReference_s* x)
{
  struct zxmd_xenc_Transforms_s* nxt;
  struct zxmd_xenc_Transforms_s* y;
  if (!x) return;
  y = x->Transforms;
  if (!y) return;
  x->Transforms = 0;
  while (y) {
    nxt = (struct zxmd_xenc_Transforms_s*)y->gg.g.n;
    y->gg.g.n = &x->Transforms->gg.g;
    x->Transforms = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_CipherReference_PUT_Transforms) */

void zxmd_xenc_CipherReference_PUT_Transforms(struct zxmd_xenc_CipherReference_s* x, int n, struct zxmd_xenc_Transforms_s* z)
{
  struct zxmd_xenc_Transforms_s* y;
  if (!x || !z) return;
  y = x->Transforms;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Transforms = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_Transforms_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_CipherReference_ADD_Transforms) */

void zxmd_xenc_CipherReference_ADD_Transforms(struct zxmd_xenc_CipherReference_s* x, int n, struct zxmd_xenc_Transforms_s* z)
{
  struct zxmd_xenc_Transforms_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Transforms->gg.g;
    x->Transforms = z;
    return;
  case -1:
    y = x->Transforms;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_Transforms_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Transforms; n > 1 && y; --n, y = (struct zxmd_xenc_Transforms_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_CipherReference_DEL_Transforms) */

void zxmd_xenc_CipherReference_DEL_Transforms(struct zxmd_xenc_CipherReference_s* x, int n)
{
  struct zxmd_xenc_Transforms_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Transforms = (struct zxmd_xenc_Transforms_s*)x->Transforms->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_Transforms_s*)x->Transforms;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_Transforms_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Transforms; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_Transforms_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_xenc_CipherReference_GET_URI) */
struct zx_str_s* zxmd_xenc_CipherReference_GET_URI(struct zxmd_xenc_CipherReference_s* x) { return x->URI; }
/* FUNC(zxmd_xenc_CipherReference_PUT_URI) */
void zxmd_xenc_CipherReference_PUT_URI(struct zxmd_xenc_CipherReference_s* x, struct zx_str_s* y) { x->URI = y; }





/* FUNC(zxmd_xenc_DataReference_GET_URI) */
struct zx_str_s* zxmd_xenc_DataReference_GET_URI(struct zxmd_xenc_DataReference_s* x) { return x->URI; }
/* FUNC(zxmd_xenc_DataReference_PUT_URI) */
void zxmd_xenc_DataReference_PUT_URI(struct zxmd_xenc_DataReference_s* x, struct zx_str_s* y) { x->URI = y; }







/* FUNC(zxmd_xenc_EncryptedData_NUM_EncryptionMethod) */

int zxmd_xenc_EncryptedData_NUM_EncryptionMethod(struct zxmd_xenc_EncryptedData_s* x)
{
  struct zxmd_xenc_EncryptionMethod_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EncryptionMethod; y; ++n, y = (struct zxmd_xenc_EncryptionMethod_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_EncryptedData_GET_EncryptionMethod) */

struct zxmd_xenc_EncryptionMethod_s* zxmd_xenc_EncryptedData_GET_EncryptionMethod(struct zxmd_xenc_EncryptedData_s* x, int n)
{
  struct zxmd_xenc_EncryptionMethod_s* y;
  if (!x) return 0;
  for (y = x->EncryptionMethod; n>=0 && y; --n, y = (struct zxmd_xenc_EncryptionMethod_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedData_POP_EncryptionMethod) */

struct zxmd_xenc_EncryptionMethod_s* zxmd_xenc_EncryptedData_POP_EncryptionMethod(struct zxmd_xenc_EncryptedData_s* x)
{
  struct zxmd_xenc_EncryptionMethod_s* y;
  if (!x) return 0;
  y = x->EncryptionMethod;
  if (y)
    x->EncryptionMethod = (struct zxmd_xenc_EncryptionMethod_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedData_PUSH_EncryptionMethod) */

void zxmd_xenc_EncryptedData_PUSH_EncryptionMethod(struct zxmd_xenc_EncryptedData_s* x, struct zxmd_xenc_EncryptionMethod_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptionMethod->gg.g;
  x->EncryptionMethod = z;
}

/* FUNC(zxmd_xenc_EncryptedData_REV_EncryptionMethod) */

void zxmd_xenc_EncryptedData_REV_EncryptionMethod(struct zxmd_xenc_EncryptedData_s* x)
{
  struct zxmd_xenc_EncryptionMethod_s* nxt;
  struct zxmd_xenc_EncryptionMethod_s* y;
  if (!x) return;
  y = x->EncryptionMethod;
  if (!y) return;
  x->EncryptionMethod = 0;
  while (y) {
    nxt = (struct zxmd_xenc_EncryptionMethod_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptionMethod->gg.g;
    x->EncryptionMethod = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_EncryptedData_PUT_EncryptionMethod) */

void zxmd_xenc_EncryptedData_PUT_EncryptionMethod(struct zxmd_xenc_EncryptedData_s* x, int n, struct zxmd_xenc_EncryptionMethod_s* z)
{
  struct zxmd_xenc_EncryptionMethod_s* y;
  if (!x || !z) return;
  y = x->EncryptionMethod;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptionMethod = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_EncryptionMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_EncryptedData_ADD_EncryptionMethod) */

void zxmd_xenc_EncryptedData_ADD_EncryptionMethod(struct zxmd_xenc_EncryptedData_s* x, int n, struct zxmd_xenc_EncryptionMethod_s* z)
{
  struct zxmd_xenc_EncryptionMethod_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EncryptionMethod->gg.g;
    x->EncryptionMethod = z;
    return;
  case -1:
    y = x->EncryptionMethod;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_EncryptionMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptionMethod; n > 1 && y; --n, y = (struct zxmd_xenc_EncryptionMethod_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_EncryptedData_DEL_EncryptionMethod) */

