gitpan/zxid/c/saml2md-getput.c
void zxmd_xenc_EncryptedData_DEL_EncryptionMethod(struct zxmd_xenc_EncryptedData_s* x, int n)
{
  struct zxmd_xenc_EncryptionMethod_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptionMethod = (struct zxmd_xenc_EncryptionMethod_s*)x->EncryptionMethod->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_EncryptionMethod_s*)x->EncryptionMethod;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_EncryptionMethod_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptionMethod; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_EncryptionMethod_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_xenc_EncryptedData_NUM_KeyInfo) */

int zxmd_xenc_EncryptedData_NUM_KeyInfo(struct zxmd_xenc_EncryptedData_s* x)
{
  struct zxmd_ds_KeyInfo_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KeyInfo; y; ++n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_EncryptedData_GET_KeyInfo) */

struct zxmd_ds_KeyInfo_s* zxmd_xenc_EncryptedData_GET_KeyInfo(struct zxmd_xenc_EncryptedData_s* x, int n)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return 0;
  for (y = x->KeyInfo; n>=0 && y; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedData_POP_KeyInfo) */

struct zxmd_ds_KeyInfo_s* zxmd_xenc_EncryptedData_POP_KeyInfo(struct zxmd_xenc_EncryptedData_s* x)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return 0;
  y = x->KeyInfo;
  if (y)
    x->KeyInfo = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedData_PUSH_KeyInfo) */

void zxmd_xenc_EncryptedData_PUSH_KeyInfo(struct zxmd_xenc_EncryptedData_s* x, struct zxmd_ds_KeyInfo_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->KeyInfo->gg.g;
  x->KeyInfo = z;
}

/* FUNC(zxmd_xenc_EncryptedData_REV_KeyInfo) */

void zxmd_xenc_EncryptedData_REV_KeyInfo(struct zxmd_xenc_EncryptedData_s* x)
{
  struct zxmd_ds_KeyInfo_s* nxt;
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return;
  y = x->KeyInfo;
  if (!y) return;
  x->KeyInfo = 0;
  while (y) {
    nxt = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n;
    y->gg.g.n = &x->KeyInfo->gg.g;
    x->KeyInfo = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_EncryptedData_PUT_KeyInfo) */

void zxmd_xenc_EncryptedData_PUT_KeyInfo(struct zxmd_xenc_EncryptedData_s* x, int n, struct zxmd_ds_KeyInfo_s* z)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x || !z) return;
  y = x->KeyInfo;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->KeyInfo = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_EncryptedData_ADD_KeyInfo) */

void zxmd_xenc_EncryptedData_ADD_KeyInfo(struct zxmd_xenc_EncryptedData_s* x, int n, struct zxmd_ds_KeyInfo_s* z)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->KeyInfo->gg.g;
    x->KeyInfo = z;
    return;
  case -1:
    y = x->KeyInfo;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyInfo; n > 1 && y; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_EncryptedData_DEL_KeyInfo) */

void zxmd_xenc_EncryptedData_DEL_KeyInfo(struct zxmd_xenc_EncryptedData_s* x, int n)
{
  struct zxmd_ds_KeyInfo_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyInfo = (struct zxmd_ds_KeyInfo_s*)x->KeyInfo->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_KeyInfo_s*)x->KeyInfo;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyInfo; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_xenc_EncryptedData_NUM_CipherData) */

int zxmd_xenc_EncryptedData_NUM_CipherData(struct zxmd_xenc_EncryptedData_s* x)
{
  struct zxmd_xenc_CipherData_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->CipherData; y; ++n, y = (struct zxmd_xenc_CipherData_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_EncryptedData_GET_CipherData) */

struct zxmd_xenc_CipherData_s* zxmd_xenc_EncryptedData_GET_CipherData(struct zxmd_xenc_EncryptedData_s* x, int n)
{
  struct zxmd_xenc_CipherData_s* y;
  if (!x) return 0;
  for (y = x->CipherData; n>=0 && y; --n, y = (struct zxmd_xenc_CipherData_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedData_POP_CipherData) */

struct zxmd_xenc_CipherData_s* zxmd_xenc_EncryptedData_POP_CipherData(struct zxmd_xenc_EncryptedData_s* x)
{
  struct zxmd_xenc_CipherData_s* y;
  if (!x) return 0;
  y = x->CipherData;
  if (y)
    x->CipherData = (struct zxmd_xenc_CipherData_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedData_PUSH_CipherData) */

void zxmd_xenc_EncryptedData_PUSH_CipherData(struct zxmd_xenc_EncryptedData_s* x, struct zxmd_xenc_CipherData_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->CipherData->gg.g;
  x->CipherData = z;
}

/* FUNC(zxmd_xenc_EncryptedData_REV_CipherData) */

void zxmd_xenc_EncryptedData_REV_CipherData(struct zxmd_xenc_EncryptedData_s* x)
{
  struct zxmd_xenc_CipherData_s* nxt;
  struct zxmd_xenc_CipherData_s* y;
  if (!x) return;
  y = x->CipherData;
  if (!y) return;
  x->CipherData = 0;
  while (y) {
    nxt = (struct zxmd_xenc_CipherData_s*)y->gg.g.n;
    y->gg.g.n = &x->CipherData->gg.g;
    x->CipherData = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_EncryptedData_PUT_CipherData) */

void zxmd_xenc_EncryptedData_PUT_CipherData(struct zxmd_xenc_EncryptedData_s* x, int n, struct zxmd_xenc_CipherData_s* z)
{
  struct zxmd_xenc_CipherData_s* y;
  if (!x || !z) return;
  y = x->CipherData;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->CipherData = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_CipherData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_EncryptedData_ADD_CipherData) */

void zxmd_xenc_EncryptedData_ADD_CipherData(struct zxmd_xenc_EncryptedData_s* x, int n, struct zxmd_xenc_CipherData_s* z)
{
  struct zxmd_xenc_CipherData_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->CipherData->gg.g;
    x->CipherData = z;
    return;
  case -1:
    y = x->CipherData;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_CipherData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->CipherData; n > 1 && y; --n, y = (struct zxmd_xenc_CipherData_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

