gitpan/zxid/c/saml2md-getput.c
void zxmd_xenc_EncryptedKey_DEL_EncryptionProperties(struct zxmd_xenc_EncryptedKey_s* x, int n)
{
  struct zxmd_xenc_EncryptionProperties_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptionProperties = (struct zxmd_xenc_EncryptionProperties_s*)x->EncryptionProperties->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_EncryptionProperties_s*)x->EncryptionProperties;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_EncryptionProperties_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptionProperties; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_EncryptionProperties_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_xenc_EncryptedKey_GET_Id) */
struct zx_str_s* zxmd_xenc_EncryptedKey_GET_Id(struct zxmd_xenc_EncryptedKey_s* x) { return x->Id; }
/* FUNC(zxmd_xenc_EncryptedKey_PUT_Id) */
void zxmd_xenc_EncryptedKey_PUT_Id(struct zxmd_xenc_EncryptedKey_s* x, struct zx_str_s* y) { x->Id = y; }
/* FUNC(zxmd_xenc_EncryptedKey_GET_Type) */
struct zx_str_s* zxmd_xenc_EncryptedKey_GET_Type(struct zxmd_xenc_EncryptedKey_s* x) { return x->Type; }
/* FUNC(zxmd_xenc_EncryptedKey_PUT_Type) */
void zxmd_xenc_EncryptedKey_PUT_Type(struct zxmd_xenc_EncryptedKey_s* x, struct zx_str_s* y) { x->Type = y; }
/* FUNC(zxmd_xenc_EncryptedKey_GET_MimeType) */
struct zx_str_s* zxmd_xenc_EncryptedKey_GET_MimeType(struct zxmd_xenc_EncryptedKey_s* x) { return x->MimeType; }
/* FUNC(zxmd_xenc_EncryptedKey_PUT_MimeType) */
void zxmd_xenc_EncryptedKey_PUT_MimeType(struct zxmd_xenc_EncryptedKey_s* x, struct zx_str_s* y) { x->MimeType = y; }
/* FUNC(zxmd_xenc_EncryptedKey_GET_Encoding) */
struct zx_str_s* zxmd_xenc_EncryptedKey_GET_Encoding(struct zxmd_xenc_EncryptedKey_s* x) { return x->Encoding; }
/* FUNC(zxmd_xenc_EncryptedKey_PUT_Encoding) */
void zxmd_xenc_EncryptedKey_PUT_Encoding(struct zxmd_xenc_EncryptedKey_s* x, struct zx_str_s* y) { x->Encoding = y; }


/* FUNC(zxmd_xenc_EncryptedKey_NUM_ReferenceList) */

int zxmd_xenc_EncryptedKey_NUM_ReferenceList(struct zxmd_xenc_EncryptedKey_s* x)
{
  struct zxmd_xenc_ReferenceList_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ReferenceList; y; ++n, y = (struct zxmd_xenc_ReferenceList_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_EncryptedKey_GET_ReferenceList) */

struct zxmd_xenc_ReferenceList_s* zxmd_xenc_EncryptedKey_GET_ReferenceList(struct zxmd_xenc_EncryptedKey_s* x, int n)
{
  struct zxmd_xenc_ReferenceList_s* y;
  if (!x) return 0;
  for (y = x->ReferenceList; n>=0 && y; --n, y = (struct zxmd_xenc_ReferenceList_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedKey_POP_ReferenceList) */

struct zxmd_xenc_ReferenceList_s* zxmd_xenc_EncryptedKey_POP_ReferenceList(struct zxmd_xenc_EncryptedKey_s* x)
{
  struct zxmd_xenc_ReferenceList_s* y;
  if (!x) return 0;
  y = x->ReferenceList;
  if (y)
    x->ReferenceList = (struct zxmd_xenc_ReferenceList_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedKey_PUSH_ReferenceList) */

void zxmd_xenc_EncryptedKey_PUSH_ReferenceList(struct zxmd_xenc_EncryptedKey_s* x, struct zxmd_xenc_ReferenceList_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ReferenceList->gg.g;
  x->ReferenceList = z;
}

/* FUNC(zxmd_xenc_EncryptedKey_REV_ReferenceList) */

void zxmd_xenc_EncryptedKey_REV_ReferenceList(struct zxmd_xenc_EncryptedKey_s* x)
{
  struct zxmd_xenc_ReferenceList_s* nxt;
  struct zxmd_xenc_ReferenceList_s* y;
  if (!x) return;
  y = x->ReferenceList;
  if (!y) return;
  x->ReferenceList = 0;
  while (y) {
    nxt = (struct zxmd_xenc_ReferenceList_s*)y->gg.g.n;
    y->gg.g.n = &x->ReferenceList->gg.g;
    x->ReferenceList = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_EncryptedKey_PUT_ReferenceList) */

void zxmd_xenc_EncryptedKey_PUT_ReferenceList(struct zxmd_xenc_EncryptedKey_s* x, int n, struct zxmd_xenc_ReferenceList_s* z)
{
  struct zxmd_xenc_ReferenceList_s* y;
  if (!x || !z) return;
  y = x->ReferenceList;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ReferenceList = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_ReferenceList_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_EncryptedKey_ADD_ReferenceList) */

void zxmd_xenc_EncryptedKey_ADD_ReferenceList(struct zxmd_xenc_EncryptedKey_s* x, int n, struct zxmd_xenc_ReferenceList_s* z)
{
  struct zxmd_xenc_ReferenceList_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ReferenceList->gg.g;
    x->ReferenceList = z;
    return;
  case -1:
    y = x->ReferenceList;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_ReferenceList_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ReferenceList; n > 1 && y; --n, y = (struct zxmd_xenc_ReferenceList_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_EncryptedKey_DEL_ReferenceList) */

void zxmd_xenc_EncryptedKey_DEL_ReferenceList(struct zxmd_xenc_EncryptedKey_s* x, int n)
{
  struct zxmd_xenc_ReferenceList_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ReferenceList = (struct zxmd_xenc_ReferenceList_s*)x->ReferenceList->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_ReferenceList_s*)x->ReferenceList;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_ReferenceList_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ReferenceList; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_ReferenceList_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_xenc_EncryptedKey_NUM_CarriedKeyName) */

int zxmd_xenc_EncryptedKey_NUM_CarriedKeyName(struct zxmd_xenc_EncryptedKey_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->CarriedKeyName; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_EncryptedKey_GET_CarriedKeyName) */

struct zx_elem_s* zxmd_xenc_EncryptedKey_GET_CarriedKeyName(struct zxmd_xenc_EncryptedKey_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->CarriedKeyName; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedKey_POP_CarriedKeyName) */

struct zx_elem_s* zxmd_xenc_EncryptedKey_POP_CarriedKeyName(struct zxmd_xenc_EncryptedKey_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->CarriedKeyName;
  if (y)
    x->CarriedKeyName = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_xenc_EncryptedKey_PUSH_CarriedKeyName) */

void zxmd_xenc_EncryptedKey_PUSH_CarriedKeyName(struct zxmd_xenc_EncryptedKey_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->CarriedKeyName->g;
  x->CarriedKeyName = z;
}

/* FUNC(zxmd_xenc_EncryptedKey_REV_CarriedKeyName) */

void zxmd_xenc_EncryptedKey_REV_CarriedKeyName(struct zxmd_xenc_EncryptedKey_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->CarriedKeyName;
  if (!y) return;
  x->CarriedKeyName = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->CarriedKeyName->g;
    x->CarriedKeyName = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_EncryptedKey_PUT_CarriedKeyName) */

