gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_xenc_EncryptionMethod_DEL_OAEPparams) */

void zxmd_xenc_EncryptionMethod_DEL_OAEPparams(struct zxmd_xenc_EncryptionMethod_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->OAEPparams = (struct zx_elem_s*)x->OAEPparams->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->OAEPparams;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->OAEPparams; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}

/* FUNC(zxmd_xenc_EncryptionMethod_GET_Algorithm) */
struct zx_str_s* zxmd_xenc_EncryptionMethod_GET_Algorithm(struct zxmd_xenc_EncryptionMethod_s* x) { return x->Algorithm; }
/* FUNC(zxmd_xenc_EncryptionMethod_PUT_Algorithm) */
void zxmd_xenc_EncryptionMethod_PUT_Algorithm(struct zxmd_xenc_EncryptionMethod_s* x, struct zx_str_s* y) { x->Algorithm = y; }







/* FUNC(zxmd_xenc_EncryptionProperties_NUM_EncryptionProperty) */

int zxmd_xenc_EncryptionProperties_NUM_EncryptionProperty(struct zxmd_xenc_EncryptionProperties_s* x)
{
  struct zxmd_xenc_EncryptionProperty_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EncryptionProperty; y; ++n, y = (struct zxmd_xenc_EncryptionProperty_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_EncryptionProperties_GET_EncryptionProperty) */

struct zxmd_xenc_EncryptionProperty_s* zxmd_xenc_EncryptionProperties_GET_EncryptionProperty(struct zxmd_xenc_EncryptionProperties_s* x, int n)
{
  struct zxmd_xenc_EncryptionProperty_s* y;
  if (!x) return 0;
  for (y = x->EncryptionProperty; n>=0 && y; --n, y = (struct zxmd_xenc_EncryptionProperty_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_EncryptionProperties_POP_EncryptionProperty) */

struct zxmd_xenc_EncryptionProperty_s* zxmd_xenc_EncryptionProperties_POP_EncryptionProperty(struct zxmd_xenc_EncryptionProperties_s* x)
{
  struct zxmd_xenc_EncryptionProperty_s* y;
  if (!x) return 0;
  y = x->EncryptionProperty;
  if (y)
    x->EncryptionProperty = (struct zxmd_xenc_EncryptionProperty_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_EncryptionProperties_PUSH_EncryptionProperty) */

void zxmd_xenc_EncryptionProperties_PUSH_EncryptionProperty(struct zxmd_xenc_EncryptionProperties_s* x, struct zxmd_xenc_EncryptionProperty_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptionProperty->gg.g;
  x->EncryptionProperty = z;
}

/* FUNC(zxmd_xenc_EncryptionProperties_REV_EncryptionProperty) */

void zxmd_xenc_EncryptionProperties_REV_EncryptionProperty(struct zxmd_xenc_EncryptionProperties_s* x)
{
  struct zxmd_xenc_EncryptionProperty_s* nxt;
  struct zxmd_xenc_EncryptionProperty_s* y;
  if (!x) return;
  y = x->EncryptionProperty;
  if (!y) return;
  x->EncryptionProperty = 0;
  while (y) {
    nxt = (struct zxmd_xenc_EncryptionProperty_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptionProperty->gg.g;
    x->EncryptionProperty = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_EncryptionProperties_PUT_EncryptionProperty) */

void zxmd_xenc_EncryptionProperties_PUT_EncryptionProperty(struct zxmd_xenc_EncryptionProperties_s* x, int n, struct zxmd_xenc_EncryptionProperty_s* z)
{
  struct zxmd_xenc_EncryptionProperty_s* y;
  if (!x || !z) return;
  y = x->EncryptionProperty;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptionProperty = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_EncryptionProperty_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_EncryptionProperties_ADD_EncryptionProperty) */

void zxmd_xenc_EncryptionProperties_ADD_EncryptionProperty(struct zxmd_xenc_EncryptionProperties_s* x, int n, struct zxmd_xenc_EncryptionProperty_s* z)
{
  struct zxmd_xenc_EncryptionProperty_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->EncryptionProperty->gg.g;
    x->EncryptionProperty = z;
    return;
  case -1:
    y = x->EncryptionProperty;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_EncryptionProperty_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptionProperty; n > 1 && y; --n, y = (struct zxmd_xenc_EncryptionProperty_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_EncryptionProperties_DEL_EncryptionProperty) */

void zxmd_xenc_EncryptionProperties_DEL_EncryptionProperty(struct zxmd_xenc_EncryptionProperties_s* x, int n)
{
  struct zxmd_xenc_EncryptionProperty_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->EncryptionProperty = (struct zxmd_xenc_EncryptionProperty_s*)x->EncryptionProperty->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_EncryptionProperty_s*)x->EncryptionProperty;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_EncryptionProperty_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->EncryptionProperty; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_EncryptionProperty_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zxmd_xenc_EncryptionProperties_GET_Id) */
struct zx_str_s* zxmd_xenc_EncryptionProperties_GET_Id(struct zxmd_xenc_EncryptionProperties_s* x) { return x->Id; }
/* FUNC(zxmd_xenc_EncryptionProperties_PUT_Id) */
void zxmd_xenc_EncryptionProperties_PUT_Id(struct zxmd_xenc_EncryptionProperties_s* x, struct zx_str_s* y) { x->Id = y; }





/* FUNC(zxmd_xenc_EncryptionProperty_GET_Target) */
struct zx_str_s* zxmd_xenc_EncryptionProperty_GET_Target(struct zxmd_xenc_EncryptionProperty_s* x) { return x->Target; }
/* FUNC(zxmd_xenc_EncryptionProperty_PUT_Target) */
void zxmd_xenc_EncryptionProperty_PUT_Target(struct zxmd_xenc_EncryptionProperty_s* x, struct zx_str_s* y) { x->Target = y; }
/* FUNC(zxmd_xenc_EncryptionProperty_GET_Id) */
struct zx_str_s* zxmd_xenc_EncryptionProperty_GET_Id(struct zxmd_xenc_EncryptionProperty_s* x) { return x->Id; }
/* FUNC(zxmd_xenc_EncryptionProperty_PUT_Id) */
void zxmd_xenc_EncryptionProperty_PUT_Id(struct zxmd_xenc_EncryptionProperty_s* x, struct zx_str_s* y) { x->Id = y; }





