gitpan/zxid/c/saml2md-getput.c
void zxmd_xenc_RecipientKeyInfo_PUSH_KeyName(struct zxmd_xenc_RecipientKeyInfo_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->KeyName->g;
  x->KeyName = z;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_REV_KeyName) */

void zxmd_xenc_RecipientKeyInfo_REV_KeyName(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->KeyName;
  if (!y) return;
  x->KeyName = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->KeyName->g;
    x->KeyName = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_PUT_KeyName) */

void zxmd_xenc_RecipientKeyInfo_PUT_KeyName(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->KeyName;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->KeyName = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_ADD_KeyName) */

void zxmd_xenc_RecipientKeyInfo_ADD_KeyName(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->KeyName->g;
    x->KeyName = z;
    return;
  case -1:
    y = x->KeyName;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->KeyName; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_DEL_KeyName) */

void zxmd_xenc_RecipientKeyInfo_DEL_KeyName(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyName = (struct zx_elem_s*)x->KeyName->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->KeyName;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->KeyName; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zxmd_xenc_RecipientKeyInfo_NUM_KeyValue) */

int zxmd_xenc_RecipientKeyInfo_NUM_KeyValue(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_KeyValue_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KeyValue; y; ++n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_GET_KeyValue) */

struct zxmd_ds_KeyValue_s* zxmd_xenc_RecipientKeyInfo_GET_KeyValue(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x) return 0;
  for (y = x->KeyValue; n>=0 && y; --n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_POP_KeyValue) */

struct zxmd_ds_KeyValue_s* zxmd_xenc_RecipientKeyInfo_POP_KeyValue(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x) return 0;
  y = x->KeyValue;
  if (y)
    x->KeyValue = (struct zxmd_ds_KeyValue_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_PUSH_KeyValue) */

void zxmd_xenc_RecipientKeyInfo_PUSH_KeyValue(struct zxmd_xenc_RecipientKeyInfo_s* x, struct zxmd_ds_KeyValue_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->KeyValue->gg.g;
  x->KeyValue = z;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_REV_KeyValue) */

void zxmd_xenc_RecipientKeyInfo_REV_KeyValue(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_KeyValue_s* nxt;
  struct zxmd_ds_KeyValue_s* y;
  if (!x) return;
  y = x->KeyValue;
  if (!y) return;
  x->KeyValue = 0;
  while (y) {
    nxt = (struct zxmd_ds_KeyValue_s*)y->gg.g.n;
    y->gg.g.n = &x->KeyValue->gg.g;
    x->KeyValue = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_PUT_KeyValue) */

void zxmd_xenc_RecipientKeyInfo_PUT_KeyValue(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zxmd_ds_KeyValue_s* z)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x || !z) return;
  y = x->KeyValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->KeyValue = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_ADD_KeyValue) */

void zxmd_xenc_RecipientKeyInfo_ADD_KeyValue(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zxmd_ds_KeyValue_s* z)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->KeyValue->gg.g;
    x->KeyValue = z;
    return;
  case -1:
    y = x->KeyValue;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyValue; n > 1 && y; --n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_DEL_KeyValue) */

void zxmd_xenc_RecipientKeyInfo_DEL_KeyValue(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zxmd_ds_KeyValue_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyValue = (struct zxmd_ds_KeyValue_s*)x->KeyValue->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_KeyValue_s*)x->KeyValue;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyValue; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_KeyValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_xenc_RecipientKeyInfo_NUM_RetrievalMethod) */

int zxmd_xenc_RecipientKeyInfo_NUM_RetrievalMethod(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_RetrievalMethod_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->RetrievalMethod; y; ++n, y = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_GET_RetrievalMethod) */

struct zxmd_ds_RetrievalMethod_s* zxmd_xenc_RecipientKeyInfo_GET_RetrievalMethod(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zxmd_ds_RetrievalMethod_s* y;
  if (!x) return 0;
  for (y = x->RetrievalMethod; n>=0 && y; --n, y = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_POP_RetrievalMethod) */

struct zxmd_ds_RetrievalMethod_s* zxmd_xenc_RecipientKeyInfo_POP_RetrievalMethod(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_RetrievalMethod_s* y;
  if (!x) return 0;
  y = x->RetrievalMethod;
  if (y)
    x->RetrievalMethod = (struct zxmd_ds_RetrievalMethod_s*)y->gg.g.n;
  return y;
}

