gitpan/zxid/c/saml2md-getput.c
int zxmd_xenc_RecipientKeyInfo_NUM_PGPData(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_PGPData_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->PGPData; y; ++n, y = (struct zxmd_ds_PGPData_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_GET_PGPData) */

struct zxmd_ds_PGPData_s* zxmd_xenc_RecipientKeyInfo_GET_PGPData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zxmd_ds_PGPData_s* y;
  if (!x) return 0;
  for (y = x->PGPData; n>=0 && y; --n, y = (struct zxmd_ds_PGPData_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_POP_PGPData) */

struct zxmd_ds_PGPData_s* zxmd_xenc_RecipientKeyInfo_POP_PGPData(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_PGPData_s* y;
  if (!x) return 0;
  y = x->PGPData;
  if (y)
    x->PGPData = (struct zxmd_ds_PGPData_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_PUSH_PGPData) */

void zxmd_xenc_RecipientKeyInfo_PUSH_PGPData(struct zxmd_xenc_RecipientKeyInfo_s* x, struct zxmd_ds_PGPData_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->PGPData->gg.g;
  x->PGPData = z;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_REV_PGPData) */

void zxmd_xenc_RecipientKeyInfo_REV_PGPData(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_PGPData_s* nxt;
  struct zxmd_ds_PGPData_s* y;
  if (!x) return;
  y = x->PGPData;
  if (!y) return;
  x->PGPData = 0;
  while (y) {
    nxt = (struct zxmd_ds_PGPData_s*)y->gg.g.n;
    y->gg.g.n = &x->PGPData->gg.g;
    x->PGPData = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_PUT_PGPData) */

void zxmd_xenc_RecipientKeyInfo_PUT_PGPData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zxmd_ds_PGPData_s* z)
{
  struct zxmd_ds_PGPData_s* y;
  if (!x || !z) return;
  y = x->PGPData;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->PGPData = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_PGPData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_ADD_PGPData) */

void zxmd_xenc_RecipientKeyInfo_ADD_PGPData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zxmd_ds_PGPData_s* z)
{
  struct zxmd_ds_PGPData_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->PGPData->gg.g;
    x->PGPData = z;
    return;
  case -1:
    y = x->PGPData;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_PGPData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->PGPData; n > 1 && y; --n, y = (struct zxmd_ds_PGPData_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_DEL_PGPData) */

void zxmd_xenc_RecipientKeyInfo_DEL_PGPData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zxmd_ds_PGPData_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->PGPData = (struct zxmd_ds_PGPData_s*)x->PGPData->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_PGPData_s*)x->PGPData;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_PGPData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->PGPData; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_PGPData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_xenc_RecipientKeyInfo_NUM_SPKIData) */

int zxmd_xenc_RecipientKeyInfo_NUM_SPKIData(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_SPKIData_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->SPKIData; y; ++n, y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_GET_SPKIData) */

struct zxmd_ds_SPKIData_s* zxmd_xenc_RecipientKeyInfo_GET_SPKIData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zxmd_ds_SPKIData_s* y;
  if (!x) return 0;
  for (y = x->SPKIData; n>=0 && y; --n, y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_POP_SPKIData) */

struct zxmd_ds_SPKIData_s* zxmd_xenc_RecipientKeyInfo_POP_SPKIData(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_SPKIData_s* y;
  if (!x) return 0;
  y = x->SPKIData;
  if (y)
    x->SPKIData = (struct zxmd_ds_SPKIData_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_PUSH_SPKIData) */

void zxmd_xenc_RecipientKeyInfo_PUSH_SPKIData(struct zxmd_xenc_RecipientKeyInfo_s* x, struct zxmd_ds_SPKIData_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->SPKIData->gg.g;
  x->SPKIData = z;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_REV_SPKIData) */

void zxmd_xenc_RecipientKeyInfo_REV_SPKIData(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zxmd_ds_SPKIData_s* nxt;
  struct zxmd_ds_SPKIData_s* y;
  if (!x) return;
  y = x->SPKIData;
  if (!y) return;
  x->SPKIData = 0;
  while (y) {
    nxt = (struct zxmd_ds_SPKIData_s*)y->gg.g.n;
    y->gg.g.n = &x->SPKIData->gg.g;
    x->SPKIData = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_PUT_SPKIData) */

void zxmd_xenc_RecipientKeyInfo_PUT_SPKIData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zxmd_ds_SPKIData_s* z)
{
  struct zxmd_ds_SPKIData_s* y;
  if (!x || !z) return;
  y = x->SPKIData;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->SPKIData = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_ADD_SPKIData) */

void zxmd_xenc_RecipientKeyInfo_ADD_SPKIData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zxmd_ds_SPKIData_s* z)
{
  struct zxmd_ds_SPKIData_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->SPKIData->gg.g;
    x->SPKIData = z;
    return;
  case -1:
    y = x->SPKIData;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SPKIData; n > 1 && y; --n, y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

