gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_xenc_RecipientKeyInfo_DEL_SPKIData) */

void zxmd_xenc_RecipientKeyInfo_DEL_SPKIData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zxmd_ds_SPKIData_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SPKIData = (struct zxmd_ds_SPKIData_s*)x->SPKIData->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_SPKIData_s*)x->SPKIData;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SPKIData; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_SPKIData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_xenc_RecipientKeyInfo_NUM_MgmtData) */

int zxmd_xenc_RecipientKeyInfo_NUM_MgmtData(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->MgmtData; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_GET_MgmtData) */

struct zx_elem_s* zxmd_xenc_RecipientKeyInfo_GET_MgmtData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->MgmtData; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_POP_MgmtData) */

struct zx_elem_s* zxmd_xenc_RecipientKeyInfo_POP_MgmtData(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->MgmtData;
  if (y)
    x->MgmtData = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_PUSH_MgmtData) */

void zxmd_xenc_RecipientKeyInfo_PUSH_MgmtData(struct zxmd_xenc_RecipientKeyInfo_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->MgmtData->g;
  x->MgmtData = z;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_REV_MgmtData) */

void zxmd_xenc_RecipientKeyInfo_REV_MgmtData(struct zxmd_xenc_RecipientKeyInfo_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->MgmtData;
  if (!y) return;
  x->MgmtData = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->MgmtData->g;
    x->MgmtData = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_PUT_MgmtData) */

void zxmd_xenc_RecipientKeyInfo_PUT_MgmtData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->MgmtData;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->MgmtData = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_ADD_MgmtData) */

void zxmd_xenc_RecipientKeyInfo_ADD_MgmtData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->MgmtData->g;
    x->MgmtData = z;
    return;
  case -1:
    y = x->MgmtData;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->MgmtData; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_DEL_MgmtData) */

void zxmd_xenc_RecipientKeyInfo_DEL_MgmtData(struct zxmd_xenc_RecipientKeyInfo_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->MgmtData = (struct zx_elem_s*)x->MgmtData->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->MgmtData;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->MgmtData; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}

/* FUNC(zxmd_xenc_RecipientKeyInfo_GET_Id) */
struct zx_str_s* zxmd_xenc_RecipientKeyInfo_GET_Id(struct zxmd_xenc_RecipientKeyInfo_s* x) { return x->Id; }
/* FUNC(zxmd_xenc_RecipientKeyInfo_PUT_Id) */
void zxmd_xenc_RecipientKeyInfo_PUT_Id(struct zxmd_xenc_RecipientKeyInfo_s* x, struct zx_str_s* y) { x->Id = y; }







/* FUNC(zxmd_xenc_ReferenceList_NUM_DataReference) */

int zxmd_xenc_ReferenceList_NUM_DataReference(struct zxmd_xenc_ReferenceList_s* x)
{
  struct zxmd_xenc_DataReference_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->DataReference; y; ++n, y = (struct zxmd_xenc_DataReference_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_ReferenceList_GET_DataReference) */

struct zxmd_xenc_DataReference_s* zxmd_xenc_ReferenceList_GET_DataReference(struct zxmd_xenc_ReferenceList_s* x, int n)
{
  struct zxmd_xenc_DataReference_s* y;
  if (!x) return 0;
  for (y = x->DataReference; n>=0 && y; --n, y = (struct zxmd_xenc_DataReference_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_ReferenceList_POP_DataReference) */

struct zxmd_xenc_DataReference_s* zxmd_xenc_ReferenceList_POP_DataReference(struct zxmd_xenc_ReferenceList_s* x)
{
  struct zxmd_xenc_DataReference_s* y;
  if (!x) return 0;
  y = x->DataReference;
  if (y)
    x->DataReference = (struct zxmd_xenc_DataReference_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_ReferenceList_PUSH_DataReference) */

void zxmd_xenc_ReferenceList_PUSH_DataReference(struct zxmd_xenc_ReferenceList_s* x, struct zxmd_xenc_DataReference_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->DataReference->gg.g;
  x->DataReference = z;
}

/* FUNC(zxmd_xenc_ReferenceList_REV_DataReference) */

void zxmd_xenc_ReferenceList_REV_DataReference(struct zxmd_xenc_ReferenceList_s* x)
{
  struct zxmd_xenc_DataReference_s* nxt;
  struct zxmd_xenc_DataReference_s* y;
  if (!x) return;
  y = x->DataReference;
  if (!y) return;
  x->DataReference = 0;
  while (y) {
    nxt = (struct zxmd_xenc_DataReference_s*)y->gg.g.n;
    y->gg.g.n = &x->DataReference->gg.g;
    x->DataReference = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_ReferenceList_PUT_DataReference) */

void zxmd_xenc_ReferenceList_PUT_DataReference(struct zxmd_xenc_ReferenceList_s* x, int n, struct zxmd_xenc_DataReference_s* z)
{
  struct zxmd_xenc_DataReference_s* y;
  if (!x || !z) return;
  y = x->DataReference;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->DataReference = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_DataReference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

