gitpan/zxid/c/saml2md-getput.c
/* FUNC(zxmd_xenc_ReferenceList_ADD_DataReference) */

void zxmd_xenc_ReferenceList_ADD_DataReference(struct zxmd_xenc_ReferenceList_s* x, int n, struct zxmd_xenc_DataReference_s* z)
{
  struct zxmd_xenc_DataReference_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->DataReference->gg.g;
    x->DataReference = z;
    return;
  case -1:
    y = x->DataReference;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_DataReference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->DataReference; n > 1 && y; --n, y = (struct zxmd_xenc_DataReference_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_ReferenceList_DEL_DataReference) */

void zxmd_xenc_ReferenceList_DEL_DataReference(struct zxmd_xenc_ReferenceList_s* x, int n)
{
  struct zxmd_xenc_DataReference_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->DataReference = (struct zxmd_xenc_DataReference_s*)x->DataReference->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_DataReference_s*)x->DataReference;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_DataReference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->DataReference; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_DataReference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zxmd_xenc_ReferenceList_NUM_KeyReference) */

int zxmd_xenc_ReferenceList_NUM_KeyReference(struct zxmd_xenc_ReferenceList_s* x)
{
  struct zxmd_xenc_KeyReference_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->KeyReference; y; ++n, y = (struct zxmd_xenc_KeyReference_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_ReferenceList_GET_KeyReference) */

struct zxmd_xenc_KeyReference_s* zxmd_xenc_ReferenceList_GET_KeyReference(struct zxmd_xenc_ReferenceList_s* x, int n)
{
  struct zxmd_xenc_KeyReference_s* y;
  if (!x) return 0;
  for (y = x->KeyReference; n>=0 && y; --n, y = (struct zxmd_xenc_KeyReference_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_ReferenceList_POP_KeyReference) */

struct zxmd_xenc_KeyReference_s* zxmd_xenc_ReferenceList_POP_KeyReference(struct zxmd_xenc_ReferenceList_s* x)
{
  struct zxmd_xenc_KeyReference_s* y;
  if (!x) return 0;
  y = x->KeyReference;
  if (y)
    x->KeyReference = (struct zxmd_xenc_KeyReference_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_ReferenceList_PUSH_KeyReference) */

void zxmd_xenc_ReferenceList_PUSH_KeyReference(struct zxmd_xenc_ReferenceList_s* x, struct zxmd_xenc_KeyReference_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->KeyReference->gg.g;
  x->KeyReference = z;
}

/* FUNC(zxmd_xenc_ReferenceList_REV_KeyReference) */

void zxmd_xenc_ReferenceList_REV_KeyReference(struct zxmd_xenc_ReferenceList_s* x)
{
  struct zxmd_xenc_KeyReference_s* nxt;
  struct zxmd_xenc_KeyReference_s* y;
  if (!x) return;
  y = x->KeyReference;
  if (!y) return;
  x->KeyReference = 0;
  while (y) {
    nxt = (struct zxmd_xenc_KeyReference_s*)y->gg.g.n;
    y->gg.g.n = &x->KeyReference->gg.g;
    x->KeyReference = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_ReferenceList_PUT_KeyReference) */

void zxmd_xenc_ReferenceList_PUT_KeyReference(struct zxmd_xenc_ReferenceList_s* x, int n, struct zxmd_xenc_KeyReference_s* z)
{
  struct zxmd_xenc_KeyReference_s* y;
  if (!x || !z) return;
  y = x->KeyReference;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->KeyReference = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_KeyReference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_ReferenceList_ADD_KeyReference) */

void zxmd_xenc_ReferenceList_ADD_KeyReference(struct zxmd_xenc_ReferenceList_s* x, int n, struct zxmd_xenc_KeyReference_s* z)
{
  struct zxmd_xenc_KeyReference_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->KeyReference->gg.g;
    x->KeyReference = z;
    return;
  case -1:
    y = x->KeyReference;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_xenc_KeyReference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyReference; n > 1 && y; --n, y = (struct zxmd_xenc_KeyReference_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_ReferenceList_DEL_KeyReference) */

void zxmd_xenc_ReferenceList_DEL_KeyReference(struct zxmd_xenc_ReferenceList_s* x, int n)
{
  struct zxmd_xenc_KeyReference_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyReference = (struct zxmd_xenc_KeyReference_s*)x->KeyReference->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_xenc_KeyReference_s*)x->KeyReference;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_xenc_KeyReference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyReference; n > 1 && y->gg.g.n; --n, y = (struct zxmd_xenc_KeyReference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zxmd_xenc_Transforms_NUM_Transform) */

int zxmd_xenc_Transforms_NUM_Transform(struct zxmd_xenc_Transforms_s* x)
{
  struct zxmd_ds_Transform_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Transform; y; ++n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_xenc_Transforms_GET_Transform) */

struct zxmd_ds_Transform_s* zxmd_xenc_Transforms_GET_Transform(struct zxmd_xenc_Transforms_s* x, int n)
{
  struct zxmd_ds_Transform_s* y;
  if (!x) return 0;
  for (y = x->Transform; n>=0 && y; --n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_xenc_Transforms_POP_Transform) */

struct zxmd_ds_Transform_s* zxmd_xenc_Transforms_POP_Transform(struct zxmd_xenc_Transforms_s* x)
{
  struct zxmd_ds_Transform_s* y;
  if (!x) return 0;
  y = x->Transform;
  if (y)
    x->Transform = (struct zxmd_ds_Transform_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_xenc_Transforms_PUSH_Transform) */

void zxmd_xenc_Transforms_PUSH_Transform(struct zxmd_xenc_Transforms_s* x, struct zxmd_ds_Transform_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Transform->gg.g;
  x->Transform = z;
}

/* FUNC(zxmd_xenc_Transforms_REV_Transform) */

void zxmd_xenc_Transforms_REV_Transform(struct zxmd_xenc_Transforms_s* x)
{
  struct zxmd_ds_Transform_s* nxt;
  struct zxmd_ds_Transform_s* y;
  if (!x) return;
  y = x->Transform;
  if (!y) return;
  x->Transform = 0;
  while (y) {
    nxt = (struct zxmd_ds_Transform_s*)y->gg.g.n;
    y->gg.g.n = &x->Transform->gg.g;
    x->Transform = y;
    y = nxt;
  }
}

/* FUNC(zxmd_xenc_Transforms_PUT_Transform) */

void zxmd_xenc_Transforms_PUT_Transform(struct zxmd_xenc_Transforms_s* x, int n, struct zxmd_ds_Transform_s* z)
{
  struct zxmd_ds_Transform_s* y;
  if (!x || !z) return;
  y = x->Transform;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Transform = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zxmd_xenc_Transforms_ADD_Transform) */

void zxmd_xenc_Transforms_ADD_Transform(struct zxmd_xenc_Transforms_s* x, int n, struct zxmd_ds_Transform_s* z)
{
  struct zxmd_ds_Transform_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Transform->gg.g;
    x->Transform = z;
    return;
  case -1:
    y = x->Transform;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Transform; n > 1 && y; --n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zxmd_xenc_Transforms_DEL_Transform) */

void zxmd_xenc_Transforms_DEL_Transform(struct zxmd_xenc_Transforms_s* x, int n)
{
  struct zxmd_ds_Transform_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Transform = (struct zxmd_ds_Transform_s*)x->Transform->gg.g.n;
    return;
  case -1:
    y = (struct zxmd_ds_Transform_s*)x->Transform;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Transform; n > 1 && y->gg.g.n; --n, y = (struct zxmd_ds_Transform_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zxmd_root_NUM_EntityDescriptor) */

int zxmd_root_NUM_EntityDescriptor(struct zxmd_root_s* x)
{
  struct zxmd_md_EntityDescriptor_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EntityDescriptor; y; ++n, y = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zxmd_root_GET_EntityDescriptor) */

struct zxmd_md_EntityDescriptor_s* zxmd_root_GET_EntityDescriptor(struct zxmd_root_s* x, int n)
{
  struct zxmd_md_EntityDescriptor_s* y;
  if (!x) return 0;
  for (y = x->EntityDescriptor; n>=0 && y; --n, y = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zxmd_root_POP_EntityDescriptor) */

struct zxmd_md_EntityDescriptor_s* zxmd_root_POP_EntityDescriptor(struct zxmd_root_s* x)
{
  struct zxmd_md_EntityDescriptor_s* y;
  if (!x) return 0;
  y = x->EntityDescriptor;
  if (y)
    x->EntityDescriptor = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n;
  return y;
}

/* FUNC(zxmd_root_PUSH_EntityDescriptor) */

void zxmd_root_PUSH_EntityDescriptor(struct zxmd_root_s* x, struct zxmd_md_EntityDescriptor_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EntityDescriptor->gg.g;
  x->EntityDescriptor = z;
}

/* FUNC(zxmd_root_REV_EntityDescriptor) */

void zxmd_root_REV_EntityDescriptor(struct zxmd_root_s* x)
{
  struct zxmd_md_EntityDescriptor_s* nxt;
  struct zxmd_md_EntityDescriptor_s* y;
  if (!x) return;
  y = x->EntityDescriptor;
  if (!y) return;
  x->EntityDescriptor = 0;
  while (y) {
    nxt = (struct zxmd_md_EntityDescriptor_s*)y->gg.g.n;
    y->gg.g.n = &x->EntityDescriptor->gg.g;
    x->EntityDescriptor = y;
    y = nxt;
  }
}

